[
{"meal_name": "Ugali – Kenyan cornmeal", "category": "Breakfast", "tags": null, "ingredients": ["Water (2 cups)", "White Cornmeal (1 1/2 cups)"], "instructions": "Bring the water to a boil in a medium saucepan.\r\nReduce the heat to low, and stirring constantly with a whisk, slowly add the cornmeal to the boiling water. The ugali will begin to thicken quite quickly.\r\nContinue cooking on low heat, stirring constantly with a sturdy wooden spoon, until the ugali begins to pull away from the sides of the pan, hold together, and takes on the aroma of roasted corn. Turn it out immediately onto a serving plate. If you would like, using a spoon or spatula, quickly shape it into a thick disk or round.\r\nThe ugali will continue to firm as it cools and will be thick enough to cut with a knife (similar to firm polenta).", "image_url": "https://www.themealdb.com/images/media/meals/smoa3h1762341142.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53114"},
{"meal_name": "Salmon Eggs Eggs Benedict", "category": "Breakfast", "tags": "Bun,Brunch", "ingredients": ["Eggs (4)", "White Wine Vinegar (2 tbs)", "English Muffins (2)", "Butter (To serve)", "Smoked Salmon (8 slices)", "Lemon Juice (2 tsp)", "White Wine Vinegar (2 tsp)", "Egg (3 Yolkes)", "Unsalted Butter (125g)"], "instructions": "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.\r\n\r\nTo poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.\r\n\r\nLightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives.", "image_url": "https://www.themealdb.com/images/media/meals/1550440197.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52962"},
{"meal_name": "Torrijas with sherry", "category": "Breakfast", "tags": null, "ingredients": ["Egg (2 medium)", "Double Cream (2 tbsp)", "Milk (2 tblsp)", "Golden Caster Sugar (3 tsp)", "Sweet Sherry (3  tablespoons)", "Bread (4 thick slices)", "Olive Oil (For frying)", "Icing Sugar (To serve)", "Creme Fraiche (To serve)"], "instructions": "step 1\r\nIn a wide, shallow bowl, beat the eggs with the cream, milk, golden caster sugar and sherry. Cut each slice of bread in two and dip them into the egg mix, turning to make sure they get a good coating on either side. Soak bread in egg mixture for 10 mins to absorb the liquid (carefully turn them over from time to time and make sure they don’t get too soggy).\r\n\r\nstep 2\r\nHeat 1½ tbsp olive oil in a large frying pan and cook the bread for about 3 mins on each side until dark golden and crisp on the edge. Keep the slices warm in a low oven as you cook the rest.\r\n\r\nstep 3\r\nDivide the torrijas between plates and dust with the icing sugar. Serve with crème fraîche or Greek yogurt on the side.", "image_url": "https://www.themealdb.com/images/media/meals/f3ee3y1763309332.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53165"},
{"meal_name": "Smoked Haddock Kedgeree", "category": "Breakfast", "tags": "Brunch,Fish,Fusion", "ingredients": ["Butter (50g)", "Onion (1 chopped)", "Cardamom (3 Pods)", "Turmeric (1/4 tsp)", "Cinnamon Stick (1 small)", "Bay Leaf (Sprigs of fresh)", "Basmati Rice (450g)", "Chicken Stock (1 Litre)", "Smoked Haddock (750g)", "Eggs (3)", "Parsley (3 tblsp chopped)", "Lemon (1 chopped)"], "instructions": "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.\r\n\r\nStir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.\r\n\r\nTip in 450g basmati rice and stir until it is all well coated in the spicy butter.\r\n\r\nPour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.\r\n\r\nMeanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.\r\n\r\nHard-boil 3 eggs for 8 minutes.\r\n\r\nFlake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop.\u2028\r\n\r\nUncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.\r\n\r\nGently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges.", "image_url": "https://www.themealdb.com/images/media/meals/1550441275.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52964"},
{"meal_name": "Oatmeal pancakes", "category": "Breakfast", "tags": null, "ingredients": ["Egg (1 medium)", "Milk (80 ml)", "Sugar (1 tablespoon)", "Baking Powder (1 tsp)", "Salt (Pinch)", "Vanilla Extract (1 dash)", "Ground Oats (150g)", "Butter (150g)", "Sugar Syrup (1 tablespoon)", "Strawberries (3)"], "instructions": "Place all the ingredients in the glass and beat.\r\nLet the mixture stand for 10 minutes.\r\nGrease a hot frying pan with a little butter and pour a little of the mixture.\r\nWhen it starts to bubble on the surface, turn over with a spatula. Cook over medium-low heat so that they do not burn.\r\nFinally, add the caramel and strawberries.", "image_url": "https://www.themealdb.com/images/media/meals/c400ok1764439058.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53331"},
{"meal_name": "Yemeni Lahsa (Elite Shakshuka)", "category": "Breakfast", "tags": null, "ingredients": ["Egg (5)", "Onion (1 Diced)", "Tomato (1 Diced)", "Olive Oil (2 tablespoons)", "Allspice (1/4 tsp)", "Black Pepper (1/4 tsp)", "Liquid Cheese (3  tablespoons)"], "instructions": "1\r\nFirst, On medium heat, heat the olive oil and add the diced onion until it wethers. Next, add the tomatoes and cook for another 4-5 min. Lastly, add the all spice, salt, and cracked pepper.\r\n2\r\nAdd the eggs and mix throughly for 2 minutes and cover to cook 5-6 minutes until top is solidified. Lastly, spread the liquid cheese and have it covered for a minute.\r\n3\r\nI served mine Mediterranean style with hash-browns, Egyptian fava beans, Turkish salami and olives, cheese wedges, and greek feta.", "image_url": "https://www.themealdb.com/images/media/meals/30s7vf1763741844.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53225"},
{"meal_name": "Rømmegrøt – Norwegian Sour Cream Porridge", "category": "Breakfast", "tags": null, "ingredients": ["Full fat sour cream (2 cups)", "Flour (3/4 cup)", "Milk (2 cups)", "Salt (1 tsp)", "Sugar (Sprinkling)", "Cinnamon (Sprinkling)", "Butter (To taste)"], "instructions": "▢\r\nCook the sour cream in a covered saucepan on medium heat for about 5 minutes.\r\n▢\r\nTurn down the heat and add half of the flour and stir well with a whisk. Once the flour is fully incorporated, let the mixture continue to cook, stirring occasionally, until fat starts to release. Use a spoon to gather as much of the fat as you can in a small bowl, saving for later. (Don't worry if you can't get any fat – in that case you can add butter later.)\r\n▢\r\nWhisk in the rest of the flour and then slowly add the milk, whisking constantly to avoid lumps. Let the porridge continue to cook on low heat for 5 minutes and then add salt.\r\n▢\r\nServe with sugar, cinnamon, and the fat from the porridge. If you're using lower fat sour cream you can top the rømmegrøt with some butter instead.", "image_url": "https://www.themealdb.com/images/media/meals/hyk47c1762772689.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53118"},
{"meal_name": "Full English Breakfast", "category": "Breakfast", "tags": "Greasy,UnHealthy,HangoverFood,Calorific,Breakfast,BBQ", "ingredients": ["Sausages (4)", "Bacon (4)", "Mushrooms (4)", "Tomatoes (3)", "Black Pudding (2 sliced)", "Eggs (2)", "Bread (1 Slice)", "Baked Beans (100g)"], "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.", "image_url": "https://www.themealdb.com/images/media/meals/sqrtwu1511721265.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52896"},
{"meal_name": "Breakfast Potatoes", "category": "Breakfast", "tags": "Breakfast,Brunch", "ingredients": ["Potatoes (3 Medium)", "Olive Oil (1 tbs)", "Bacon (2 strips)", "Garlic Clove (Minced)", "Maple Syrup (1 tbs)", "Parsley (Garnish)", "Salt (Pinch)", "Pepper (Pinch)", "Allspice (To taste)"], "instructions": "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r\nWash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r\nIn the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r\nOnce the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r\nCook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r\nChop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r\nOnce the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r\nLet the garlic cook until fragrant, about one minute.\r\nJust before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r\nServe in a warm bowl with a sunny side up egg!", "image_url": "https://www.themealdb.com/images/media/meals/1550441882.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52965"},
{"meal_name": "Fruit and Cream Cheese Breakfast Pastries", "category": "Breakfast", "tags": "Breakfast,Summer", "ingredients": ["Cream Cheese (1 1/4 oz)", "Sugar (1 1/4 cup)", "Vanilla Extract (1 teaspoon)", "Flour", "Puff Pastry (2)", "Strawberries", "Raspberries", "Blackberries"], "instructions": "Preheat oven to 400ºF (200ºC), and prepare two cookie sheets with parchment paper. In a bowl, mix cream cheese, sugar, and vanilla until fully combined. Lightly flour the surface and roll out puff pastry on top to flatten. Cut each sheet of puff pastry into 9 equal squares. On the top right and bottom left of the pastry, cut an L shape approximately ½ inch (1 cm) from the edge.\r\nNOTE: This L shape should reach all the way down and across the square, however both L shapes should not meet at the ends. Your pastry should look like a picture frame with two corners still intact.\r\nTake the upper right corner and fold down towards the inner bottom corner. You will now have a diamond shape.\r\nPlace 1 to 2 teaspoons of the cream cheese filling in the middle, then place berries on top.\r\nRepeat with the remaining pastry squares and place them onto the parchment covered baking sheet.\r\nBake for 15-20 minutes or until pastry is golden brown and puffed.\r\nEnjoy!\r\n", "image_url": "https://www.themealdb.com/images/media/meals/1543774956.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52957"},
{"meal_name": "Venetian Duck Ragu", "category": "Pasta", "tags": null, "ingredients": ["Olive Oil (1 tbls)", "Duck Legs (4)", "Onions (2 finely chopped)", "Garlic (2 cloves minced)", "Cinnamon (2 tsp ground)", "Plain Flour (2 tsp)", "Red Wine (250ml)", "Chopped Tomatoes (800g)", "Chicken Stock Cube (1)", "Rosemary (3 sprigs)", "Bay Leaves (2)", "Sugar (1 tsp)", "Milk (2 tbs)", "Paccheri Pasta (600g)", "Parmesan Cheese (Grated)"], "instructions": "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then.\r\nCarefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta.\r\nCook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like.", "image_url": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52838"},
{"meal_name": "English Breakfast", "category": "Breakfast", "tags": "Breakfast", "ingredients": ["Sausages (2)", "Bacon (3)", "Mushrooms (2)", "Tomatoes (2)", "Black Pudding (1 Slice)", "Eggs (2)", "Bread (1 Slice)"], "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.", "image_url": "https://www.themealdb.com/images/media/meals/utxryw1511721587.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52895"},
{"meal_name": "Syrian Spaghetti", "category": "Pasta", "tags": null, "ingredients": ["Spaghetti (16 ounces)", "Tomato Sauce (8 ounces)", "Tomato Puree (6 oz)", "Cinnamon (1 teaspoon)", "Vegetable Oil (1/4 cup)", "Salt (Dash)", "Pepper (Dash)"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\r\n\r\nBring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and stir in tomato sauce, tomato paste, cinnamon, oil, salt and pepper. Transfer to prepared dish.\r\n\r\nBake in preheated oven for 1 hour, or until top is crunchy.", "image_url": "https://www.themealdb.com/images/media/meals/5fu4ew1760524857.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53093"},
{"meal_name": "Bread omelette", "category": "Breakfast", "tags": null, "ingredients": ["Bread (2)", "Egg (2)", "Salt (0.5)"], "instructions": "Make and enjoy", "image_url": "https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53076"},
{"meal_name": "Spaghetti alla Carbonara", "category": "Pasta", "tags": "Pasta,BBQ,Breakfast", "ingredients": ["Spaghetti (320g)", "Egg Yolks (6)", "Salt (As required)", "Bacon (150g)", "Pecorino (50g)", "Black Pepper (As required)"], "instructions": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\r\n\r\nSTEP 3\r\nBeat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\r\n\r\nSTEP 4\r\nAdd 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\r\n\r\nSTEP 5\r\nSquash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\r\n\r\nSTEP 6\r\nWhile the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\r\n\r\nSTEP 7\r\nLeave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\r\n\r\nSTEP 8\r\nKeep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\r\n\r\nSTEP 9\r\nMix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\r\n\r\nSTEP 10\r\nTake the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\r\n\r\nSTEP 11\r\nAdd extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\r\n\r\nSTEP 12\r\nUse a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.", "image_url": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52982"},
{"meal_name": "Matar Paneer", "category": "Vegetarian", "tags": "Curry,Vegetarian", "ingredients": ["Sunflower Oil (1 tbls)", "Paneer (225g)", "Ginger (2)", "Cumin (1 tsp)", "Turmeric (1 tsp)", "Coriander (1 tsp)", "Green Chilli (1)", "Tomato (4 large)", "Peas (150g)", "Garam Masala (1 tsp)", "Coriander (Small bunch)", "Naan Bread (to serve)"], "instructions": "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.\r\nPut the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice.", "image_url": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52865"},
{"meal_name": "Leblebi Soup", "category": "Vegetarian", "tags": "Soup", "ingredients": ["Olive Oil (2 tbs)", "Onion (1 medium finely diced)", "Chickpeas (250g)", "Vegetable Stock (1.5L)", "Cumin (1 tsp)", "Garlic (5 cloves)", "Salt (1/2 tsp)", "Harissa Spice (1 tsp)", "Pepper (Pinch)", "Lime (1/2)"], "instructions": "Heat the oil in a large pot. Add the onion and cook until translucent.\r\nDrain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.\r\nIn the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.\r\nAdd the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.\r\nSeason to taste with salt, pepper and lemon juice and serve hot.", "image_url": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52973"},
{"meal_name": "Kidney Bean Curry", "category": "Vegetarian", "tags": "Curry", "ingredients": ["Vegetable Oil (1 tbls)", "Onion (1 finely chopped)", "Garlic (2 cloves chopped)", "Ginger (1 part)", "Coriander (1 Packet)", "Cumin (1 tsp)", "Paprika (1 tsp)", "Garam Masala (2 tsp)", "Chopped Tomatoes (400g)", "Kidney Beans (400g)", "Basmati Rice (to serve)"], "instructions": "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.\r\n\r\nAdd the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.\r\n\r\nTurn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves.", "image_url": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52868"},
{"meal_name": "Koshari", "category": "Vegetarian", "tags": null, "ingredients": ["Brown Lentils (1 1/2 cups)", "Rice (1 1/2 cups)", "Coriander (1/2 tsp)", "Macaroni (2 cups)", "Chickpeas (Can)", "Onion (1 large)", "Salt (Sprinking)", "Vegetable Oil (1/2 cup)"], "instructions": "Cook the lentils. Bring lentils and 4 cups of water to a boil in a medium pot or saucepan over high heat. Reduce the heat to low and cook until lentils are just tender (15-17 minutes). Drain from water and season with a little salt. (Note: when the lentils are ready, they should not be fully cooked. They should be only par-cooked and still have a bite to them as they need to finish cooking with the rice).\r\nNow, for the rice. Drain the rice from its soaking water. Combine the par-cooked lentils and the rice in the saucepan over medium-high heat with 1 tbsp cooking oil, salt, pepper, and coriander. Cook for 3 minutes, stirring regularly. Add warm water to cover the rice and lentil mixture by about 1 1/2 inches (you’ll probably use about 3 cups of water here). Bring to a boil; the water should reduce a bit. Now cover and cook until all the liquid has been absorbed and both the rice and lentils are well cooked through (about 20 minutes).  Keep covered and undisturbed for 5 minutes or so.\r\nNow make the pasta. While the rice and lentils are cooking, make the pasta according to package instructions by adding the elbow pasta to boiling water with a dash of salt and a little oil. Cook until the pasta is al dente. Drain.\r\nCover the chickpeas and warm in the microwave briefly before serving.\r\n\r\nMake the crispy onion topping. \r\n\r\nSprinkle the onion rings with salt, then toss them in the flour to coat. Shake off excess flour.\r\nIn a large skillet, heat the cooking oil over medium-high heat, cook the onion rings, stirring often, until they turn a nice caramelized brown. Onions must be crispy, but not burned (15-20 minutes).", "image_url": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53027"},
{"meal_name": "Hodge Podge", "category": "Vegetarian", "tags": null, "ingredients": ["New Potatoes (1 lb)", "Carrots (1 lb)", "Green Beans (1 cup)", "Peas (1/2 cup)", "Dill (1 tablespoon)", "Chives (1 tablespoon)", "Milk (3 Cups)", "Heavy Cream (1/2 cup)", "Butter (1/2 cup)", "Salt (1/2 tsp)", "Black Pepper (1/4 tsp)"], "instructions": "First, cook your vegetables. Bring a large pot of salted water to boil. Par-cook carrots and potatoes for five minutes until carrots and potatoes are fork tender, then blanch the peas and beans for about a minute in the same pot. Strain vegetables and set aside.\r\nIn a heavy-bottomed pot or Dutch oven, melt butter over medium heat, add vegetables, and cook to warm through.\r\nAdd milk and cream and bring the soup to a boil. Turn the heat down to low and season with salt and pepper.\r\nAdd dill and chives and let simmer for at least 10 minutes. Serve warm.", "image_url": "https://www.themealdb.com/images/media/meals/xihv0c1764447887.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53340"},
{"meal_name": "Kafteji", "category": "Vegetarian", "tags": null, "ingredients": ["Potatoes (5 Large)", "Olive Oil (2 tbs)", "Green Pepper (1)", "Onions (5)", "Ras el hanout (1 tbs)", "Pumpkin (500g)", "Eggs (24 Skinned)", "Salt (Pinch)", "Pepper (Pinch)"], "instructions": "Peel potatoes and cut into 5cm cubes.\r\nPour 1-2 cm of olive oil into a large pan and heat up very hot. Fry potatoes until golden brown for 20 minutes, turning from time to time. Place on kitchen paper to drain.\r\nCut the peppers in half and remove seeds. Rub a little olive oil on them and place the cut side down on a baking tray. Place them under the grill. Grill until the skin is dark and bubbly. While the peppers are still hot, put them into a plastic sandwich bag and seal it. Take them out after 15 minutes and remove skins.\r\nIn the meantime, heat more olive oil another pan. Peel the onions and cut into thin rings. Fry for 15 minutes until golden brown, turning them often. Add the Ras el hanout at the end.\r\nCut the pumpkin into 5cm cubes and fry in the same pan you used for the potatoes for 10-15 minutes until it is soft and slightly browned. Place on kitchen paper.\r\nPour the remaining olive oil out of the pan and put all the cooked vegetables into the pan and mix. Whisk eggs and pour them over the vegetables. Put the lid on the pan so that the eggs cook. Put the contents of the pan onto a large chopping board, add salt and pepper and chopped and mix everything with a big knife.", "image_url": "https://www.themealdb.com/images/media/meals/1bsv1q1560459826.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52971"},
{"meal_name": "Home-made Mandazi", "category": "Breakfast", "tags": "Baking,Breakfast,Egg,Warm,Snack", "ingredients": ["Self-raising Flour (750g)", "Sugar (6 tablespoons)", "Eggs (2)", "Milk (1 cup)"], "instructions": "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.\r\nYou can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.\r\nFor “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.\r\n\r\n1. Mix the flour,cinnamon and sugar in a suitable bowl.\r\n2. In a separate bowl whisk the egg into the milk\r\n3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.\r\n4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.\r\n5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.\r\n6. Roll the dough on a lightly floured surface into a 1cm thick piece.\r\n7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.\r\n8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.\r\n9. Serve them warm or cold", "image_url": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52967"},
{"meal_name": "Grilled eggplant with coconut milk", "category": "Vegetarian", "tags": null, "ingredients": ["Egg Plants (6)", "Coconut Milk (1 can)", "Lemon Juice (1 tbs)", "Salt (1 tsp)", "Red Pepper Flakes (To taste)", "Onions (4 Sticks)"], "instructions": ".  Prepare the eggplants for grilling by pricking them all over with a fork.  This is so it won’t burst during the grilling process as the natural water in it heats up.\r\n2.  Grill the eggplants, turning them over frequently to ensure even cooking.  Grill until the skins are dark brown, even black and the eggplant is soft when you touch it.\r\n3.  Soak the grilled eggplant in a bowl of water to cool it down.  Peel the skin off the eggplant.  Place the whole eggplants in a shallow dish (my mom actually cuts the eggplant into small, bite-sized pieces).\r\n 4.  In a small mixing bowl, mix together the coconut milk or cream, lemon powder, salt and hot pepper.  Mix until the lemon powder and salt dissolve.  Taste, then adjust the amount of lemon powder, salt and hot pepper to your liking.  Pour the mixture over the eggplant.  Sprinkle the green onions over the eggplant and coconut milk.  Stir gently to combine. \r\n", "image_url": "https://www.themealdb.com/images/media/meals/bopa2i1683209167.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53074"},
{"meal_name": "Mazariner – Scandinavian Almond Tartlets", "category": "Dessert", "tags": null, "ingredients": ["Flour (3 Cups)", "Powdered Sugar (1 1/4 cup)", "Butter (200g)", "Egg (1)", "Egg (3)", "Powdered Sugar (1 1/4 cup)", "Butter (100g)", "Vanilla Extract (2 teaspoons)", "Flour (2 tblsp)", "Almond Flour (2 cups)", "Almond Extract (1 teaspoon)", "Powdered Sugar (2 cups)", "Heavy Cream (3  tablespoons)", "Almond Extract (1/4 tsp)"], "instructions": "Shells\r\n▢\r\nCombine the flour and powdered sugar in a food processor. Add the butter and pulse until it's evenly distributed. Add the egg and pulse until the dough comes together.\r\n▢\r\nRoll out the dough on a floured surface. Cut the dough in circles with a large mug. Press the circles down into a greased muffin pan. Put the pan of shells in the fridge while you prepare the almond filling.\r\nAlmond filling\r\n▢\r\nPreheat oven to 355°F (180°C).\r\n▢\r\nWhisk the egg and powdered sugar together until thick and airy. Melt the butter and stir it into the egg mixture. Stir in the vanilla, flour, and almond extract. Stir in the almond flour.\r\n▢\r\nPipe or spoon the almond filling onto the shells, filling the shells about 3/4 full.\r\n▢\r\nBake the mazariner for 20 – 25 minutes, until light golden brown. Cool on a wire rack.\r\nGlaze\r\n▢\r\nMix together the powdered sugar and liquid until you get a spreadable glaze. Spread the glaze on top of the mazariner and if you wish, decorate with sprinkles, or anything you like.", "image_url": "https://www.themealdb.com/images/media/meals/uh1n5u1763075545.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53132"},
{"meal_name": "Mince Pies", "category": "Dessert", "tags": "Christmas", "ingredients": ["Butter (225g)", "Plain Flour (350g)", "Caster Sugar (100g)", "Mincemeat (280g)", "Egg (1 small)", "Icing Sugar (Topping)"], "instructions": "To make the pastry, rub 225g cold, diced butter into 350g plain flour, then mix in 100g golden caster sugar and a pinch of salt.\r\n\r\nCombine the pastry into a ball – don’t add liquid – and knead it briefly. The dough will be fairly firm, like shortbread dough. You can use the dough immediately, or chill for later.\r\n\r\nPreheat the oven to 200C/gas 6/fan 180C. Line 18 holes of two 12-hole patty tins, by pressing small walnut-sized balls of pastry into each hole.\r\n\r\nSpoon 280g mincemeat into the pies.\r\n\r\nTake slightly smaller balls of pastry than before and pat them out between your hands to make round lids, big enough to cover the pies. \r\n\r\nTop the pies with their lids, pressing the edges gently together to seal – you don’t need to seal them with milk or egg as they will stick on their own. (The pies may now be frozen for up to 1 month).\r\n\r\nBeat 1 small egg and brush the tops of the pies. Bake for 20 mins until golden. Leave to cool in the tin for 5 mins, then remove to a wire rack.\r\n\r\nTo serve, lightly dust with icing sugar.", "image_url": "https://www.themealdb.com/images/media/meals/qe8pf51576795532.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52991"},
{"meal_name": "Mamoul (Eid biscuits)", "category": "Dessert", "tags": "Celebration,Party, Eid", "ingredients": ["Plain Flour (300g)", "Semolina (200g)", "Sunflower Oil (25g)", "Unsalted Butter (250g)", "Milk (50 ml)", "Icing Sugar (60g)"], "instructions": "1\r\nMix butter with sugar until creamy.\r\n2\r\nAdd oil flour and semolina and mix.\r\n3\r\nAdd warm milk and don't knead too much\r\n4\r\nCover and leave aside for an hour or less until you prepare the filling\r\n5\r\nFor the dates filling, fry some sesame in a pan then add butter. Add the dates paste and mixed well with sesame and butter. Then add a little bit of water until it's mushy. Be careful don't make it too mushy.\r\n6\r\nTake it of the pan, put in a plate until it's cool. Then start to shape balls that weigh 15 gm.\r\n7\r\nRefrigerate for 1/2 an hour.\r\n8\r\nGet back to the dough and shape it as balls that weigh 30 gm.\r\n9\r\nTake the date filling out of the fridge and start to stuff each dough ball with dates ball.\r\nThen use the mamoul mould to give it this shape.\r\n10\r\nIn a preheated oven 180 degrees, put it for 20 minutes until golden from below and little bit golden from above.", "image_url": "https://www.themealdb.com/images/media/meals/35kejr1763599712.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53221"},
{"meal_name": "Madeira Cake", "category": "Dessert", "tags": "Cake,Light,Baking,Desert", "ingredients": ["Butter (175g)", "Caster Sugar (175g)", "Eggs (3)", "Self-raising Flour (250g)", "Milk (3 tbs)", "Lemon (Zest of 1)", "Mixed Peel (To Glaze)"], "instructions": "Pre-heat the oven to 180C/350F/Gas 4. Grease an 18cm/7in round cake tin, line the base with greaseproof paper and grease the paper.\r\nCream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each one and adding a tablespoon of the flour with the last egg to prevent the mixture curdling.\r\nSift the flour and gently fold in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the lemon zest.\r\nSpoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown on top and a skewer inserted into the centre comes out clean.\r\nRemove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely.\r\nTo serve, decorate the cake with the candied peel.", "image_url": "https://www.themealdb.com/images/media/meals/urtqut1511723591.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52900"},
{"meal_name": "Lamingtons", "category": "Dessert", "tags": null, "ingredients": ["Salted Butter (125g)", "Golden Caster Sugar (250g)", "Egg (3 Large)", "Self-raising Flour (250g)", "Milk (3  tablespoons)", "Salt (1/2 teaspoon)", "Double Cream (250ml)", "Icing Sugar (2 tblsp)", "Raspberry Jam (200g)", "Desiccated Coconut (350g)", "Unsalted Butter (80g)", "Milk (250ml)", "Cocoa Powder (50g)", "Icing Sugar (400g)"], "instructions": "step 1\r\nHeat the oven to 200C/180C fan/gas 6. Butter and line a 20 x 30cm rectangle tin.\r\n\r\nstep 2\r\nBeat the butter and sugar in a free-standing mixer until pale and fluffy. Add the eggs one at a time and beat well. Beat through the flour, milk and salt until fully combined, then spoon into the tin. Bake in the oven for 25 mins or until golden and firm to the touch. Set aside to cool completely.\r\n\r\nstep 3\r\nSlice the sponge horizontally to create two halves. Trim the edges to make perfect corners. Cut the sponge into 18 squares. Lightly whip the cream with the icing sugar until it reaches soft peaks. Spread a little of the jam on half of the sponge squares then pipe or spread over a little of the cream. Sandwich each one with a second square of sponge then set aside in the fridge to chill.\r\n\r\nstep 4\r\nTo make the icing, whisk together the melted butter and milk in a bowl. Sieve the cocoa powder and icing sugar together in a seperate bowl. Gradually add the cocoa and sugar to the butter and milk mixture, whisking continuously to ensure there are no lumps. If it gets lumpy, whizz with a hand blender until smooth.\r\n\r\nstep 5\r\nDivide the coconut between three shallow bowls (this keeps it from getting coated in too much chocolate whilst you’re dipping).\r\n\r\nstep 6\r\nDip each lamington in the icing until completely covered. Roll in the coconut and set on a wire rack. Repeat with the remaining sponges. Chill for a minimum of 1 hr.", "image_url": "https://www.themealdb.com/images/media/meals/j2n7vg1761848636.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53104"},
{"meal_name": "Kvæfjord Cake “Verdens Beste” (World’s Best Cake)", "category": "Dessert", "tags": null, "ingredients": ["Egg Yolks (2 large)", "Cornstarch (2 tblsp)", "Granulated Sugar (1/4 cup)", "Heavy Cream (2/3 Cup)", "Milk (3/4 cup)", "vanilla pod (1)", "Butter (2/3 Cup)", "Granulated Sugar (3/4 cup)", "Egg Yolks (5 Large)", "Flour (1 1/4 cup)", "Baking Powder (1.5 tsp)", "Milk (1/2 cup)", "Egg White (7)", "Granulated Sugar (1 1/2 cups)", "Almonds (Sliced)", "Whipping Cream (1 1/4 cup)"], "instructions": "Vanilla custard\r\n▢\r\nSeparate the egg yolks and set aside the whites to use in the meringue.\r\n▢\r\nWhisk together the egg yolks, cornstarch and sugar in a bowl.\r\n▢\r\nHeat the cream and milk in a saucepan. Split open the vanilla pod and add the beans to the saucepan. Once the milk begins to bubble pour about half of it into the bowl with the egg mixture, whisking constantly. Then return the saucepan to the heat and pour the egg mixture back into the saucepan with remaining milk, whisking constantly. Once the mixture thickens lower the heat and continue whisking for about 30 seconds.\r\n▢\r\nPour the custard into a clean bowl and cover with plastic wrap, placing the plastic directly on the top layer of the custard. Chill in the fridge.\r\nCake\r\n▢\r\nMix together butter and sugar until light and fluffy. Add egg yolks one at a time, setting aside the egg whites for the meringue. Add the flour mixed with baking powder. Stir in the milk, beating until smooth (you can use an electric mixer if you prefer).\r\n▢\r\nPreheat oven to 320°F (160°C). Cover a baking sheet with baking paper and spread out the batter into a large, even rectangle.\r\nMeringue topping\r\n▢\r\nWhisk together the egg whites and sugar until you get glossy, stiff peaks. The meringue should hold its form – if it still melts continue whisking.\r\n▢\r\nSpread out the meringue on top of the cake batter. Use a spatula to form light waves with the meringue. Sprinkle almonds on top of the meringue. Bake for about 30 minutes, until the meringue and almonds are golden.\r\nCream filling\r\n▢\r\nWhisk the cream into stiff peaks. Carefully fold in the vanilla custard.\r\nAssembly\r\n▢\r\nOnce the cake has cooled, cut it in half. You can use scissors for this, or a knife on a cutting board, slicing through the baking paper as well.\r\n▢\r\nPlace half of the cake on a serving platter with the meringue side down and peel off the baking paper.\r\n▢\r\nSpread the cream filling across the cake. Then carefully remove the other half of the cake from the baking paper and place it over the cream filling, meringue side up.\r\n▢\r\nServe with fresh berries.\r\n\r\n", "image_url": "https://www.themealdb.com/images/media/meals/gdn1ot1763075684.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53128"},
{"meal_name": "Krispy Kreme Donut", "category": "Dessert", "tags": null, "ingredients": ["Yeast (1/4 ounce)", "Water (1/4 cup)", "Water (1 1/2 cups)", "Sugar (1/2 cup)", "Salt (1 tsp)", "Eggs (2)", "Shortening (1/3 cup)", "Flour (5 drops)", "Canola Oil (Sprinking)", "Milk (1/2 cup)", "Sugar (2 cups)", "Vanilla (1 1/2 cups)", "Boiling Water (6 tablespoons)", "Butter (1/3 cup)"], "instructions": "Dissolve yeast in warm water in 2 1/2-quart bowl. Add milk, sugar, salt, eggs, shortening and 2 cups flour. Beat on low for 30 seconds, scraping bowl constantly. Beat on medium speed for 2 minutes, scraping bowl occasionally. Stir in remaining flour until smooth. Cover and let rise until double, 50-60 minutes. (Dough is ready when indentation remains when touched.) Turn dough onto floured surface; roll around lightly to coat with flour. Gently roll dough 1/2-inch thick with floured rolling pin. Cut with floured doughnut cutter. Cover and let rise until double, 30-40 minutes.\r\nHeat vegetable oil in deep fryer to 350°. Slide doughnuts into hot oil with wide spatula. Turn doughnuts as they rise to the surface. Fry until golden brown, about 1 minute on each side. Remove carefully from oil (do not prick surface); drain. Dip the doughnuts into creamy glaze set on rack.\r\n\r\n\r\nGlaze: \r\nHeat butter until melted. Remove from heat. Stir in powdered sugar and vanilla until smooth. Stir in water, 1 tablespoon at a time, until desired consistency.", "image_url": "https://www.themealdb.com/images/media/meals/4i5cnx1587672171.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53015"},
{"meal_name": "White chocolate creme brulee", "category": "Dessert", "tags": "Desert,DinnerParty,Pudding", "ingredients": ["Double Cream (568ml)", "White Chocolate Chips (100g)", "Vanilla (Pod of)", "Egg Yolks (6)", "Caster Sugar (2 tbs)", "Caster Sugar (Top)"], "instructions": "Heat the cream, chocolate and vanilla pod in a pan until the chocolate has melted. Take off the heat and allow to infuse for 10 mins, scraping the pod seeds into the cream. If using the vanilla extract, add straight away. Heat oven to 160C/fan 140C/gas 3.\r\nBeat yolks and sugar until pale. stir in the chocolate cream. Strain into a jug and pour into ramekins. Place in a deep roasting tray and pour boiling water halfway up the sides. Bake for 15-20 mins until just set with a wobbly centre. Chill in the fridge for at least 4 hrs.\r\nTo serve, sprinkle some sugar on top of the brûlées and caramelise with a blowtorch or briefly under a hot grill. Leave caramel to harden, then serve.", "image_url": "https://www.themealdb.com/images/media/meals/uryqru1511798039.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52917"},
{"meal_name": "Walnut Roll Gužvara", "category": "Dessert", "tags": "Nutty", "ingredients": ["Flour (450g)", "Caster Sugar (55g)", "Yeast (2 parts)", "Salt (1/2 tsp)", "Milk (6 oz)", "Eggs (2 Beaten)", "Butter (30g)", "Walnuts (140g)", "Butter (85g)", "Brown Sugar (85g)", "Cinnamon (1 tsp)", "Milk (To Glaze)", "Icing Sugar (To Glaze)"], "instructions": "Mix all the ingredients for the dough together and knead well. Cover the dough and put to rise until doubled in size which should take about 2 hours. Knock back the dough and knead lightly.\r\n\r\nDivide the dough into two equal pieces; roll each piece into an oblong about 12 inches by 8 inches. Mix the filling ingredients together and divide between the dough, spreading over each piece. Roll up the oblongs as tightly as possible to give two 12 inch sausages. Place these side by side, touching each other, on a greased baking sheet. Cover and leave to rise for about 40 minutes. Heat oven to 200ºC (425ºF). Bake for 30-35 minutes until well risen and golden brown. Bread should sound hollow when the base is tapped.\r\n\r\nRemove from oven and brush the hot bread top with milk. Sift with a generous covering of icing sugar.", "image_url": "https://www.themealdb.com/images/media/meals/u9l7k81628771647.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53062"},
{"meal_name": "Walnut, date & honey cake", "category": "Dessert", "tags": null, "ingredients": ["Self-raising Flour (225g)", "Ground Cinnamon (1/2 teaspoon)", "Butter (175g)", "Muscovado Sugar (100g)", "Clear Honey (3  tablespoons)", "Egg (2 Beaten)", "Banana (2 medium)", "Stoned Dates (100g)", "Walnuts (50g)"], "instructions": "step 1\r\nPreheat the oven to 160C/Gas 3/fan oven 140C. Line the base and long sides of a 900g/2lb loaf tin with greaseproof paper, buttering the tin and paper.\r\n\r\nstep 2\r\nTip the flour, cinnamon, butter, sugar, 2 tablespoons of the honey and the eggs into a large mixing bowl. Mash the bananas and chop the dates (kitchen scissors are easiest for this) and add to the bowl. Beat the mixture for 2-3 minutes, using a wooden spoon or hand-held mixer, until well blended.\r\n\r\nstep 3\r\nSpoon into the prepared tin and level the top. Scatter the walnut pieces over. Bake for 1 hour, then lightly press the top – it will feel firm if cooked. If not, bake for a further 10 minutes.\r\n\r\nstep 4\r\nCool for 15 minutes, then lift out of the tin using the paper. When cold, drizzle the remaining honey over. Cut into thick slices.", "image_url": "https://www.themealdb.com/images/media/meals/towo9c1763814590.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53271"},
{"meal_name": "Tunisian Orange Cake", "category": "Dessert", "tags": null, "ingredients": ["Orange (1 large)", "Caster Sugar (300g)", "Olive Oil (75 ml)", "Flour (280g)", "Baking Powder (1 tbs)", "Eggs (4 large)", "Vanilla Extract (2 tsp)"], "instructions": "Preheat oven to 190 C / Gas 5. Grease a 23cm round springform tin.\r\nCut off the hard bits from the top and bottom of the orange. Slice the orange and remove all seeds. Puree the orange with its peel in a food processor. Add one third of the sugar and the olive oil and continue to mix until well combined.\r\nSieve together flour and baking powder.\r\nBeat the eggs and the remaining sugar with an electric hand mixer for at least five minutes until very fluffy. Fold in half of the flour mixture, then the orange and the vanilla, then fold in the remaining flour. Mix well but not for too long.\r\nPour cake mixture into prepared tin and smooth out. Bake in preheated oven for 20 minutes. Reduce the oven temperature to 160 C / Gas 2 and bake again for 30 minutes Bake until the cake is golden brown and a skewer comes out clean. Cool on a wire cake rack.", "image_url": "https://www.themealdb.com/images/media/meals/y4jpgq1560459207.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52970"},
{"meal_name": "Treacle Tart", "category": "Dessert", "tags": "Tart", "ingredients": ["Plain Flour (250g)", "Butter (135g)", "Golden Syrup (400g)", "Breadcrumbs (150g)", "Lemons (Zest of 2)", "Eggs (1 beaten)"], "instructions": "First make the short crust pastry: measure the flour into a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs (alternatively, this can be done in a food processor). Add about three tablespoons of cold water and mix to a firm dough, wrap in cling film and chill in the fridge for about 20 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat up. Grease a deep 18cm/7in loose-bottomed fluted flan tin with butter.\r\nRemove about 150g/5½oz of pastry from the main ball and set aside for the lattice top.\r\nRoll the rest of the pastry out thinly on a lightly floured work surface and line the prepared flan tin with the pastry.\r\nPrick the base with a fork, to stop the base rising up during baking.\r\nPlace the reserved pastry for the lattice top on cling film and roll out thinly. Egg wash the pastry and set aside to chill in the fridge (the cling film makes it easier to move about). Do not cut into strips at this stage. Do not egg wash the strips once they are on the tart as it will drip into the treacle mixture.\r\nTo make the filling, heat the syrup gently in a large pan but do not boil.\r\nOnce melted, add the breadcrumbs, lemon juice and zest to the syrup. (You can add less lemon if you would prefer less citrus taste.) If the mixture looks runny, add a few more breadcrumbs.\r\nPour the syrup mixture into the lined tin and level the surface.\r\nRemove the reserved pastry from the fridge and cut into long strips, 1cm/½in wide. Make sure they are all longer than the edges of the tart tin.\r\nEgg wash the edge of the pastry in the tin, and start to make the woven laying lattice pattern over the mixture, leave the strips hanging over the edge of the tin.\r\nOnce the lattice is in place, use the tin edge to cut off the strips by pressing down with your hands, creating a neat finish.\r\nBake on the pre-heated baking tray in the hot oven for about 10 minutes until the pastry has started to colour, and then reduce the oven temperature to 180C/350F/Gas 4. If at this stage the lattice seems to be getting too dark brown, cover the tart with tin foil.\r\nBake for a further 25-30 minutes until the pastry is golden-brown and the filling set.\r\nRemove the tart from the oven and leave to firm up in the tin. Serve warm or cold.", "image_url": "https://www.themealdb.com/images/media/meals/wprvrw1511641295.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52892"},
{"meal_name": "Vanilla alfajores", "category": "Dessert", "tags": null, "ingredients": ["Dulce de leche (150g)", "Coconut Flakes (50g)", "Butter (100g)", "Sugar (100g)", "Egg (1)", "Egg Yolks (1)", "Cornstarch (200g)", "All purpose flour (100g)", "Baking Powder (1 tsp)", "Vanilla Extract (1 tsp)", "Dulce de leche (150g)", "Coconut Flakes (50g)"], "instructions": "For the sandwich cookie cream the soft butter for about a minute, then add the sugar and cream for another two minutes. Incorporate the egg fully before mixing in the egg yolk. Once everything is nicely combined, add all remaining ingredients and mix one more time. Form dough into a ball and wrap in plastic wrap. Chill for at least half an hour or overnight.\r\n\r\n2\r\nPreheat oven to 180 degrees Celsius and line two baking sheets with parchment paper.\r\n\r\n3\r\nDivide dough in half, put one back in the fridge and roll out the other thickly on a lightly floured surface. Cut out cookies with either the bottom of a glass or a cookie cutter around 6cm in diameter. Repeat with all the dough.\r\n\r\n4\r\nBake for about 8-10min, the cookies will look very pale. Let cool off before filling half with each a teaspoon of dulce de leche. Place other half of cookies on top and roll the sides of each cookie in the coconut flakes (it helps if the dulce de leche was pressed down to the sides of the cookie). Enjoy.", "image_url": "https://www.themealdb.com/images/media/meals/3wnyvh1764373818.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53321"},
{"meal_name": "Venezuelan Shredded Beef", "category": "Beef", "tags": null, "ingredients": ["Skirty Steak (2 Lbs)", "Garlic (2 cloves minced)", "Onion (1 chopped)", "Onion (1 sliced)", "Red Pepper (1 sliced)", "Tomato (3 sliced thinly)", "Beef Stock (4 cups)", "Worcestershire Sauce (2 tsp)", "Tomato Puree (1 tablespoon)", "Cumin (1 tsp)", "Tomato Ketchup (1/4 cup)", "Salt (To taste)", "Pepper (To taste)", "Olive Oil (1 tablespoon)"], "instructions": "Season beef with salt, pepper and minced garlic\r\nChop 1 onion in 4 big wedges\r\nPlace in the beef pressure cooker with the 4 wedges of onion and the stock\r\nPressure cook for 20 minutes\r\nRelease the pressure and open the lid\r\nRemove the beef and SAVE 2 cups of stock in another container\r\nWith 2 forks, shred the beef. Beef should be tender enough to so easily. If not, cook for another 10 minutes\r\nPress the saute button of the Instant pot. Add the olive oil\r\nWhen the machine beeps, add the sliced onion, pepper and tomatoes. Cook until tender\r\nAdd the shredded beef back in the pot and mix\r\nPour in 1 1/2 cups of the saved stock, the Worcestershire sauce, tomato paste, ketchup and cumin. Mix\r\nIf sauce seems to dry, add a tad more of stock\r\nSeason with salt and pepper\r\nServe!", "image_url": "https://www.themealdb.com/images/media/meals/mq27gf1764436795.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53328"},
{"meal_name": "Venezuelan Sancocho", "category": "Beef", "tags": null, "ingredients": ["Hind Shank (2 Lbs)", "Onion (2 small)", "Pepper (1/2)", "Garlic (4 Cloves Chopped)", "Garlic (4 Cloves Crushed)", "Leek (1)", "Beef Stock (8 cups)", "Sweet Red Peppers (1/2 cup)", "Scallions (1/2 cup)", "Sweetcorn (2)", "Cassaba (1/2 lb)", "Yautia (1/2 lb)", "White Yam (1/2 lb)", "Butternut Squash (1/2 lb)", "Salt (To taste)", "Pepper (To taste)", "Cilantro (Chopped)"], "instructions": "Add hind shank, 1 halved small onion, halved bell pepper, 4 whole garlic cloves, the dark green leaves of the leek, and stock to a large stockpot. Cook for 45-60 minutes until the meat is fork-tender. NOTE: the meat can take a bit longer to be fork-tender; that is okay, just add more cooking time if necessary.\r\nWhen the meat is tender, remove the big pieces of vegetables and bones. Discard.\r\nAdd diced onion, 2 minced garlic, mini sweet peppers, sliced leeks (light green part), scallions, yucca, and corn; Mix and simmer covered over medium heat for 5- 8 minutes, until the yucca is starting to soften. NOTE: the yuca can take a bit longer to start softening; that is okay, just add more cooking time if necessary.\r\nAdd yautia, white yam, and butternut squash. Mix to combine. Simmer covered over medium heat for 5 – 6 minutes, until all the root vegetables are tender. NOTE: Do not cook too much, or they will fall apart.\r\nTaste and add salt to your taste, if necessary. Add cilantro and the remaining 2 minced garlic cloves. Mix and let simmer for 2 more minutes.\r\nServe hot in large soup bowls, dividing the meat and vegetables evenly. Add a squish of lime juice and/or hot sauce, if desired. Serve along with arepas and or casabe (cassava bread).", "image_url": "https://www.themealdb.com/images/media/meals/8859m71764377470.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53326"},
{"meal_name": "Vegetable Shepherds Pie", "category": "Beef", "tags": "Baking", "ingredients": ["Potatoes (3 Lbs)", "Small Potatoes (3 Lbs)", "Salted Butter (1/2 cup)", "Mushrooms (1 oz)", "Brown Lentils (3/4 cup)", "Garlic (6 cloves)", "Kosher Salt (1 tsp)", "Onion (3 cups)", "Tomato Puree (2 tbsp)", "Bay Leaves", "Olive Oil", "Dry White Wine (2 cups)", "Vegetable Stock (8 cups)", "Cornstarch (2 tbsp)", "Soy Sauce (2 tsp)", "Rosemary (2 sprigs)", "Parsley", "Sage", "Chives"], "instructions": "Add Ingredients:\r\n\r\n12 cups chopped mixed vegetables\r\n1   cup chopped fresh mushrooms \r\n1   cup pearl onions\r\n\r\nTOPPING:\r\n\r\nPreheat oven to 450°. Bake potatoes on a foil-lined baking sheet until tender, about 45 minutes. Let cool slightly, then peel. Press potatoes through a ricer, food mill, or colander into a large bowl. Add butter; stir until well blended. Stir in milk. Season to taste with salt.\r\n\r\nFILLING:\r\n\r\nSoak dried porcini in 3 cups hot water; set aside. Combine lentils, 1 garlic clove, 1 tsp. salt, and 4 cups water in a medium saucepan. Bring to a boil; reduce heat and simmer, stirring occasionally, until lentils are tender but not mushy, 15–20 minutes. Drain lentils and discard garlic.\r\n\r\nHeat 3 Tbsp. oil in a large heavy pot over medium heat. Add onions and cook, stirring occasionally, until soft, about 12 minutes. Add chopped garlic and cook for 1 minute. Stir in tomato paste. Cook, stirring constantly, until tomato paste is caramelized, 2–3 minutes.\r\n\r\nAdd bay leaves and wine; stir, scraping up any browned bits. Stir in porcini, slowly pouring porcini soaking liquid into pan but leaving any sediment behind. Bring to a simmer and cook until liquid is reduced by half, about 10 minutes. Stir in broth and cook, stirring occasionally, until reduced by half, about 45 minutes.\r\n\r\nStrain mixture into a large saucepan and bring to a boil; discard solids in strainer. Stir cornstarch and 2 Tbsp. water in a small bowl to dissolve. Add cornstarch mixture; simmer until thickened, about 5 minutes. Whisk in miso. Season sauce with salt and pepper. Set aside.\r\n\r\nPreheat oven to 450°. Toss vegetables and pearl onions with remaining 2 Tbsp. oil, 5 garlic cloves, and rosemary sprigs in a large bowl; season with salt and pepper. Divide between 2 rimmed baking sheets. Roast, stirring once, until tender, 20–25 minutes. Transfer garlic cloves to a small bowl; mash well with a fork and stir into sauce. Discard rosemary. DO AHEAD: Lentils, sauce, and vegetables can be made 1 day ahead. Cover separately; chill.\r\nArrange lentils in an even layer in a 3-qt. baking dish; set dish on a foil-lined rimmed baking sheet. Toss roasted vegetables with fresh mushrooms and chopped herbs; layer on top of lentils. Pour sauce over vegetables. Spoon potato mixture evenly over.\r\n\r\nBake until browned and bubbly, about 30 minutes. Let stand for 15 minutes before serving.", "image_url": "https://www.themealdb.com/images/media/meals/w8umt11583268117.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53000"},
{"meal_name": "Tall Skoleboller", "category": "Dessert", "tags": null, "ingredients": ["Milk (1 cup)", "Instant Yeast (3 tsp)", "Granulated Sugar (1-⅓ cups)", "Cardamom (1 tsp)", "Vanilla Extract (1 teaspoon)", "Flour (2 1/4 cups)", "Butter (5 tblsp)", "Milk (1 1/4 cup)", "Granulated Sugar (1-⅓ cups)", "Egg Yolks (3)", "Cornstarch (2 tblsp)", "vanilla pod (1)", "Powdered Sugar (2 cups)", "Water (3  tablespoons)", "Shredded Coconut (1 cup)"], "instructions": "▢\r\nHeat the milk until it's lukewarm. Add the yeast and dissolve.\r\n▢\r\nAdd the sugar, cardamom, vanilla, and about 2/3 of the flour.\r\n▢\r\nMix the dough together either by hand or in a mixer with a dough hook, slowly adding the rest of the flour. You might need a bit more or less flour to form dough that isn't too sticky to knead. When the dough forms a nice ball, add the softened butter and continue to knead the dough for about ten minutes.\r\n▢\r\nRoll the dough into a cylinder and cut into six equal parts. Roll each piece into a round bun and set them in a greased muffin/cake tin. Cover and let rise until doubled in size (about an hour).", "image_url": "https://www.themealdb.com/images/media/meals/xihiu41762773169.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53119"},
{"meal_name": "Timbits", "category": "Dessert", "tags": "Snack,Treat", "ingredients": ["Flour (2 cups)", "Sugar (1/3 cup)", "Baking Powder (3 tsp)", "Salt (½ tsp)", "Egg (1 beaten)", "Milk (¾ cup)", "Oil (3 tbs)", "Oil (for frying)", "Icing Sugar (garnish)"], "instructions": "Sift together dry ingredients.\r\nMix together wet ingredients and incorporate into dry. Stir until smooth.\r\nDrop by teaspoonfuls(no bigger) into hot oil (365 degrees, no hotter), turning after a few moments until golden brown on all sides.\r\nRemove and drain.\r\nRoll in cinnamon sugar while still warm and serve.", "image_url": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52929"},
{"meal_name": "Tarte Tatin", "category": "Dessert", "tags": "Treat,Tart,Desert,DinnerParty", "ingredients": ["Puff Pastry (300g)", "Plain Flour (Dusting)", "Braeburn Apples (6)", "Caster Sugar (100g)", "Butter (85g)", "Creme Fraiche (to serve)"], "instructions": "Roll the pastry to a 3mm-thick round on a lightly floured surface and cut a 24cm circle, using a plate as a guide. Lightly prick all over with a fork, wrap in cling film on a baking sheet and freeze while preparing the apples.\r\nHeat oven to 180C/160C fan/gas 4. Peel, quarter and core the apples. Put the sugar in a flameproof 20cm ceramic Tatin dish or a 20cm ovenproof heavy-based frying pan and place over a medium-high heat. Cook the sugar for 5-7 mins to a dark amber caramel syrup that’s starting to smoke, then turn off the heat and stir in the 60g diced chilled butter.\r\nTo assemble the Tarte Tatin, arrange the apple quarters very tightly in a circle around the edge of the dish first, rounded-side down, then fill in the middle in a similar fashion. Gently press with your hands to ensure there are no gaps. Brush the fruit with the melted butter.\r\nBake in the oven for 30 mins, then remove and place the disc of frozen puff pastry on top – it will quickly defrost. Tuck the edges down the inside of the dish and, with a knife, prick a few holes in the pastry to allow steam to escape. Bake for a further 40-45 mins until the pastry is golden brown and crisp.\r\nAllow to cool to room temperature for 1 hr before running a knife around the edge of the dish and inverting it onto a large serving plate that is deep enough to contain the juices. Serve with crème fraîche or vanilla ice cream.", "image_url": "https://www.themealdb.com/images/media/meals/ryspuw1511786688.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52909"},
{"meal_name": "Summer Pudding", "category": "Dessert", "tags": "Summer", "ingredients": ["Strawberries (300g)", "Blackberries (250g)", "Redcurrants (100g)", "Raspberries (500g)", "Caster Sugar (175g)", "Bread (7 Slices)"], "instructions": "Bring out the juices: Wash fruit and gently dry on kitchen paper – keep strawberries separate. Put sugar and 3 tbsp water into a large pan. Gently heat until sugar dissolves – stir a few times. Bring to a boil for 1 min, then tip in the fruit (not strawberries). Cook for 3 mins over a low heat, stirring 2-3 times. The fruit will be softened, mostly intact and surrounded by dark red juice. Put a sieve over a bowl and tip in the fruit and juice.\r\nLine the bowl with cling film and prepare the bread: Line the 1.25-litre basin with cling film as this will help you to turn out the pudding. Overlap two pieces of cling film in the middle of the bowl as it’s easier than trying to get one sheet to stick to all of the curves. Let the edges overhang by about 15cm. Cut the crusts off the bread. Cut 4 pieces of bread in half, a little on an angle, to give 2 lopsided rectangles per piece. Cut 2 slices into 4 triangles each and leave the final piece whole.\r\nBuild the pud: Dip the whole piece of bread into the juice for a few secs just to coat. Push this into the bottom of the basin. Now dip the wonky rectangular pieces one at a time and press around the basin’s sides so that they fit together neatly, alternately placing wide and narrow ends up. If you can’t quite fit the last piece of bread in it doesn’t matter, just trim into a triangle, dip in juice and slot in. Now spoon in the softened fruit, adding the strawberries here and there as you go.\r\nLet flavours mingle then serve: Dip the bread triangles in juice and place on top – trim off overhang with scissors. Keep leftover juice for later. Bring cling film up and loosely seal. Put a side plate on top and weight down with cans. Chill for 6 hrs or overnight. To serve, open out cling film then put a serving plate upside-down on top and flip over. serve with leftover juice, any extra berries and cream.", "image_url": "https://www.themealdb.com/images/media/meals/rsqwus1511640214.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52889"},
{"meal_name": "Šúĺlance s Makom", "category": "Dessert", "tags": null, "ingredients": ["Potatoes (700g)", "All purpose flour (300g)", "Semolina (100g)", "Salt (Pinch)", "Ground Poppy seeds (150g)", "Powdered Sugar (100g)", "Butter (100g)"], "instructions": "1. Prepare the Potatoes\r\n\r\nBoil the potatoes with their skins on until tender.\r\nLet them cool completely (preferably overnight), then peel and mash them finely.\r\n2. Make the Dough\r\n\r\nIn a bowl, combine mashed potatoes, flour, semolina, and salt.\r\nKnead the mixture until you get a smooth, non-sticky dough.\r\n3. Shape the Šúĺlance\r\n\r\nDivide the dough into portions and roll each into a thin rope (about 1.5 cm in diameter).\r\nCut into 3 cm-long pieces and roll between your palms to shape small dumplings.\r\n4. Cook the Dumplings\r\n\r\nBring a pot of salted water to a boil.\r\nDrop in the dumplings in batches and cook until they float to the surface (about 2-3 minutes).\r\nDrain and transfer to a bowl.\r\n5. Prepare the Topping\r\n\r\nIn a separate bowl, mix ground poppy seeds and powdered sugar.\r\nMelt the butter and keep it ready.\r\n6. Assemble the Dish\r\n\r\nDrizzle the cooked dumplings with melted butter.\r\nToss them in the poppy seed-sugar mixture until evenly coated.\r\n7. Serve and Enjoy\r\n\r\nServe warm, optionally with a dusting of extra powdered sugar or a drizzle of honey.", "image_url": "https://www.themealdb.com/images/media/meals/d6o4nu1763362422.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53187"},
{"meal_name": "Suksessterte (Norwegian almond “success cake”)", "category": "Dessert", "tags": null, "ingredients": ["Almonds (2 cups)", "Egg (3)", "Granulated Sugar (1 1/4 cup)", "Flour (2 tblsp)", "Baking Powder (1 teaspoon)", "Egg Yolks (5)", "Heavy Cream (1/2 cup)", "Granulated Sugar (1/3 cup)", "Vanilla Extract (1 teaspoon)", "Butter (100g)"], "instructions": "Almond base\r\n▢\r\nPreheat oven to 345°F (175°C) and grease cake form (I use a 27 cm spring form) – you can line the bottom with baking paper if you like.\r\n▢\r\nGrind almonds in an almond grinder or food processor. I like to keep them a bit coarse.\r\n▢\r\nGently whisk the eggs and sugar together until combined (no longer). Stir in the ground almonds, flour, and baking powder.\r\n▢\r\nPour batter into cake form and bake for about 45 – 50 minutes, monitoring to make sure the top doesn't burn.\r\nYellow egg cream\r\n▢\r\nAdd egg yolks, heavy cream, sugar, and vanilla to a saucepan. Heat over low/medium heat while stirring constantly until the mixture thickens – about 15 minutes. Turn up the heat if the mixture doesn't thicken, but be careful not to boil.\r\n▢\r\nLet the mixture cool to room temperature and then add the butter. You can use an electric mixer for a fluffy egg cream.\r\nAssembly\r\n▢\r\nWait for the cake to cool completely before removing from form and frosting.", "image_url": "https://www.themealdb.com/images/media/meals/de83k51763075604.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53130"},
{"meal_name": "Strawberry Rhubarb Pie", "category": "Dessert", "tags": "Pudding,Pie,Baking,Fruity,Glazed", "ingredients": ["Flour (350g)", "Salt (1 tsp)", "Sugar (2 tbs)", "Butter (1 cup)", "Water (1/2 cup)", "Rhubarb (450g)", "Strawberries (450g)", "Cornstarch (3 tbs)", "Sugar (150g)", "Cinnamon (1/4 tsp)", "Lemon Juice (1 tsp)", "Unsalted Butter (2 tbs)", "Milk (2 tbs)", "Sugar (Spinkling)"], "instructions": "Pie Crust:  In a food processor, place the flour, salt, and sugar and process until combined. Add the butter and process until the mixture resembles coarse\r\n\r\nmeal (about 15 seconds). Pour 1/4 cup (60 ml) water in a slow, steady stream, through the feed tube until the dough just holds together when pinched. If necessary, add more water. Do not process more than 30 seconds.\r\nTurn the dough onto your work surface and gather into a ball. Divide the dough in half, flattening each half into a disk, cover with plastic wrap, and refrigerate for about one hour before using. This will chill the butter and relax the gluten in the flour. \r\n\r\nAfter the dough has chilled sufficiently, remove one portion of the dough from the fridge and place it on a lightly floured surface.  Roll the pastry into a 12 inch (30 cm) circle. (To prevent the pastry from sticking to the counter and to ensure uniform thickness, keep lifting up and turning the pastry a quarter turn as you roll (always roll from the center of the pastry outwards).)  Fold the dough in half and gently transfer to a 9 inch (23 cm) pie pan. Brush off any excess flour and trim any overhanging pastry to an edge of 1/2 inch (1.5 cm). Refrigerate the pastry, covered with plastic wrap, while you make the filling. \r\n\r\nRemove the second round of pastry and roll it into a 13 inch (30 cm) circle. Using a pastry wheel or pizza cutter, cut the pastry into about 3/4 inch (2 cm) strips. Place the strips of pastry on a parchment paper-lined baking sheet, cover with plastic wrap, and place in the refrigerator for about 10 minutes. \r\n\r\nMake the Strawberry Rhubarb Filling: Place the cut strawberries and rhubarb in a large bowl. In a small bowl mix together the cornstarch, sugar, and ground cinnamon. \r\n\r\nRemove the chilled pie crust from the fridge. Sprinkle about 2 tablespoons of the sugar mixture over the bottom of the pastry crust. Add the remaining sugar mixture to the strawberries and rhubarb and gently toss to combine. Pour the fruit mixture into the prepared pie shell. Sprinkle the fruit with about 1 teaspoon of lemon juice and dot with 2 tablespoons of butter.\r\n\r\nRemove the lattice pastry from the refrigerator and, starting at the center with the longest strips and working outwards, place half the strips, spacing about 1 inch (2.5 cm) apart, on top of the filling. (Use the shortest pastry strips at the outer edges.) Then, gently fold back, about halfway, every other strip of pastry. Take another strip of pastry and place it perpendicular on top of the first strips of pastry. Unfold the bottom strips of pastry and then fold back the strips that weren't folded back the first time. Lay another strip of pastry perpendicular on top of the filling and then continue with the remaining strips. Trim the edges of the pastry strips, leaving a 1 inch (2.5 cm) overhang. Seal the edges of the pastry strips by folding them under the bottom pastry crust and flute the edges of the pastry. Brush the lattice pastry with milk and sprinkle with a little sugar. Cover and place in the refrigerator while you preheat the oven to 400 degrees F (205 degrees C) and place the oven rack in the lower third of the oven. Put a baking sheet, lined with aluminum foil, on the oven rack (to catch any spills.)\r\n\r\nPlace the pie plate on the hot baking sheet and bake the pie for about 35 minutes and then, if the edges of the pie are browning too much, cover with a foil ring. Continue to bake the pie for about another 10 minutes or until the crust is a golden brown color and the fruit juices begin to bubble.\r\n\r\nRemove the pie from the oven and place on a wire rack to cool for several hours. Serve at room temperature with softly whipped cream or vanilla ice cream. Leftovers can be stored in the refrigerator for about 3 days. Reheat before serving. This pie can be frozen.\r\n\r\nMakes one 9 inch (23 cm) pie.", "image_url": "https://www.themealdb.com/images/media/meals/178z5o1585514569.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53005"},
{"meal_name": "Sugar Pie", "category": "Dessert", "tags": "Pie,Desert", "ingredients": ["Brown Sugar (2 cups)", "Butter (¼ cup)", "Eggs (2)", "Vanilla Extract (1 tsp)", "Salt (1 tsp)", "Plain Flour (½ cup)", "Milk (1 1/2 cups)"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie dish.\r\nPlace the brown sugar and butter in a mixing bowl, and beat them together with an electric mixer until creamy and very well combined, without lumps. Beat in eggs, one at a time, incorporating the first egg before adding the next one. Add the vanilla extract and salt; beat the flour in, a little at a time, and then the milk, making a creamy batter. Pour the batter into the prepared pie dish.\r\nBake in the preheated oven for 35 minutes; remove pie, and cover the rim with aluminum foil to prevent burning. Return to oven, and bake until the middle sets and the top forms a crusty layer, about 15 more minutes. Let the pie cool to room temperature, then refrigerate for at least 1 hour before serving.", "image_url": "https://www.themealdb.com/images/media/meals/yrstur1511816601.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52931"},
{"meal_name": "Strawberries Romanoff", "category": "Dessert", "tags": "Fruity", "ingredients": ["Strawberries (2 pint)", "Sugar (4 tbs)", "Grand Marnier (4 tbs)", "Cream (1 cup)", "Sour Cream (1/4 cup)"], "instructions": "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir to combine then cover and refrigerate at least 1 hour and up to 2 hours, stirring once or twice.\r\n\r\nTwo photos of cut strawberries in a bowl with one having sugar being added to the bowl Two photos of cut up strawberries for Strawberry Romanoff \r\n\r\nJust before serving, in a large mixing bowl, combine 1 cup cold heavy cream and 1/4 cup powdered sugar, and beat with an electric mixer until stiff peaks form. Using a spatula, fold in 1/4 cup sour cream just until well blended.\r\n\r\nTo serve, stir strawberries then divide between 6 serving glasses or bowls. You can spoon a little syrup over the berries if you like. You can also use this syrup to soak a cake. Spoon cream over strawberries, dividing evenly. You can also use an ice cream scoop with trigger release for a nice rounded puff of cream. Serve right away or chill and enjoy within 2 hours of assembly.\r\n\r\n", "image_url": "https://www.themealdb.com/images/media/meals/oe8rg51699014028.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53082"},
{"meal_name": "Saskatoon Pie", "category": "Dessert", "tags": null, "ingredients": ["All purpose flour (6 cups)", "Salt (2 tsp)", "Unsalted Butter (1 cup)", "Vegetable Shortening (1 cup)", "Egg (1 large)", "Vinegar (1 tablespoon)", "Water (Splash)", "Saskatoon Berries (5 Cups)", "Sugar (1/2 cup)", "Sugar (1 tablespoon)", "Cornstarch (3  tablespoons)", "Unsalted Butter (2 tablespoons)", "Egg (1 beaten)", "Water (1 tablespoon)"], "instructions": "To make the pastry, place the flour and salt in a large bowl. Mix well. Add the cubes of butter and shortening and mix them in (I like to use my hands to mix the fat into the flour, but you can use a pastry blender) just until it looks like coarse oatmeal with some pea-sized bits remaining. Place the egg in a 2-cup measure and beat it with a fork. Beat in the vinegar and just enough ice-cold water to bring it to the 1-cup mark. Stir this into the flour mixture, just until the dough clings together. I like to use my hands for this part as well, but a wooden spoon would also work. Try not to overmix it.\r\nOn a lightly floured surface, gather the dough into a ball and divide it into 5 evenly sized portions. Shape each portion into a disc and wrap tightly in plastic. Chill 2 of these discs for 1 hour. Freeze the other 3 in a resealable freezer bag for future use. The pastry keeps well in the freezer for up to 2 months.\r\nPreheat the oven to 350°F. Place the rack in the lower third of the oven. Line a baking sheet with aluminum foil to catch drippings.\r\nOn a lightly floured surface, roll out 1 disc of pastry into a 12-inch circle, or thereabouts. Place it in the bottom of a 9-inch pie plate, with the pastry overhanging the edges of the pie plate.\r\nTo make the filling, place the saskatoon berries in a large bowl and stir in the 1/2 cup sugar and the cornstarch until well combined. Pour the berry mixture into the bottom of the pie. Dot with the butter. On a lightly floured surface, roll out the pastry in another 12-inch circle for the top crust. Use a ruler to guide you when cutting the pastry into 6 wide, long strips to keep the edges straight. Save the 2 end pieces in case you need to do any patching. I like wide strips, but if you like a thinner look, feel free to cut thin strips of pastry. Weave the pastry strips, going over and under, making sure they connect with the edges of the pie crust. Fold over the edges of the bottom crust, tucking in the lattice ends. This will help to trap the juices and give a rustic look.\r\nIf you prefer a cleaner, tidier look, you can trim the overhanging pieces and crimp the edges with a fork. Brush the top of the pie with the egg wash. Sprinkle with the remaining Tbsp sugar. Place the pie on the prepared baking sheet and bake it for about 90 – 100 minutes, until it’s golden brown and bubbling. Remove the pie from the oven and place it on a wire rack to cool.\r\nServe the pie warm or at room temperature with whipped cream or ice cream. Makes 6 servings. This keeps well if covered with plastic and refrigerated for up to 4 days.", "image_url": "https://www.themealdb.com/images/media/meals/5xdrkw1764444472.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53337"},
{"meal_name": "Sticky Toffee Pudding Ultimate", "category": "Dessert", "tags": "Pudding,Desert,Cake,Dairy", "ingredients": ["Medjool dates (225g)", "water (175ml Boiling)", "vanilla extract (1 tsp)", "self-raising flour (175g)", "bicarbonate of soda (1 tsp)", "eggs (2)", "butter (85g)", "demerara sugar (140g)", "black treacle (2 tbsp)", "milk (100ml)", "ice cream (1 scoop)", "muscovado sugar (175g)", "butter (50g)", "double cream (225ml)", "black treacle (1 tbsp)"], "instructions": "Stone and chop the dates quite small, put them in a bowl, then pour the boiling water over. Leave for about 30 mins until cool and well-soaked, then mash a bit with a fork. Stir in the vanilla extract. Butter and flour seven mini pudding tins (each about 200ml/7fl oz) and sit them on a baking sheet. Heat oven to 180C/fan 160C/gas 4.\r\nWhile the dates are soaking, make the puddings. Mix the flour and bicarbonate of soda together and beat the eggs in a separate bowl. Beat the butter and sugar together in a large bowl for a few mins until slightly creamy (the mixture will be grainy from the sugar). Add the eggs a little at a time, beating well between additions. Beat in the black treacle then, using a large metal spoon, gently fold in one-third of the flour, then half the milk, being careful not to overbeat. Repeat until all the flour and milk is used. Stir the soaked dates into the pudding batter. The mix may look a little curdled at this point and will be like a soft, thick batter. Spoon it evenly between the tins and bake for 20-25 mins, until risen and firm.\r\nMeanwhile, put the sugar and butter for the sauce in a medium saucepan with half the cream. Bring to the boil over a medium heat, stirring all the time, until the sugar has completely dissolved. Stir in the black treacle, turn up the heat slightly and let the mixture bubble away for 2-3 mins until it is a rich toffee colour, stirring occasionally to make sure it doesn’t burn. Take the pan off the heat and beat in the rest of the cream.\r\nRemove the puddings from the oven. Leave in the tins for a few mins, then loosen them well from the sides of the tins with a small palette knife before turning them out. You can serve them now with the sauce drizzled over, but they’ll be even stickier if left for a day or two coated in the sauce. To do this, pour about half the sauce into one or two ovenproof serving dishes. Sit the upturned puddings on the sauce, then pour the rest of the sauce over them. Cover with a loose tent of foil so that the sauce doesn’t smudge (no need to chill).\r\nWhen ready to serve, heat oven to 180C/fan 160C/gas 4. Warm the puddings through, still covered, for 15-20 mins or until the sauce is bubbling. Serve them on their own, or with cream or custard.", "image_url": "https://www.themealdb.com/images/media/meals/xrptpq1483909204.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52793"},
{"meal_name": "Spanish fig & almond balls", "category": "Dessert", "tags": null, "ingredients": ["Almonds (100g)", "Figs (500g)", "Dried Apricots (85g)", "Dried cranberries (50g)", "Brandy (1 tablespoon)", "Clear Honey (1 tblsp)", "Cloves (1 teaspoon)", "Sesame Seed (100g)"], "instructions": "step 1\r\nWhizz the almonds in a food processor until most are finely chopped, then tip into a large bowl. Roughly chop the figs, then whizz to a smooth sticky paste. Scrape onto the almonds then, using your hands, mix together well with the dried fruit, brandy, honey and cloves.\r\n\r\nstep 2\r\nDivide the mixture into 6 and roll into balls. Tip the sesame seeds onto a tray, then roll the balls in them until covered. Cover the tray loosely with a clean tea towel, then leave the fig balls to dry for a week before packaging. Will keep in a cool place for 2 months.", "image_url": "https://www.themealdb.com/images/media/meals/si2rty1763282314.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53163"},
{"meal_name": "Spotted Dick", "category": "Dessert", "tags": "Fruity,Pudding,Desert", "ingredients": ["Self-raising Flour (250g)", "Salt (pinch)", "Suet (125g)", "Currants (175g)", "Caster Sugar (80g)", "Lemon (Zest of 1)", "Orange (Zest of 1)", "Milk (150ml)", "Custard (to serve)"], "instructions": "Put the flour and salt in a bowl. Add the suet, currants, sugar, lemon and orange zest.\r\nPour in 150ml milk and mix to a firm but moist dough, adding the extra milk if necessary.\r\nShape into a fat roll about 20cm long. Place on a large rectangle of baking parchment. Wrap loosely to allow for the pudding to rise and tie the ends with string like a Christmas cracker.\r\nPlace a steamer over a large pan of boiling water, add the pudding to the steamer, cover and steam for 1 1/2 hours. Top up the pan with water from time to time.\r\nRemove from the steamer and allow to cool slightly before unwrapping. Serve sliced with custard.", "image_url": "https://www.themealdb.com/images/media/meals/xqvyqr1511638875.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52886"},
{"meal_name": "Sticky Toffee Pudding", "category": "Dessert", "tags": "Pudding,Cake,Desert", "ingredients": ["Butter (100g)", "Muscovado Sugar (175g)", "Eggs (2 large)", "Self-raising Flour (225g)", "Baking Powder (1 tsp)", "Bicarbonate Of Soda (1 tsp)", "Black Treacle (3 tbs)", "Milk (275ml)", "Double Cream (to serve)", "Butter (100g)", "Muscovado Sugar (125g)", "Black Treacle (1 tbs)", "Double Cream (300ml)", "Vanilla Extract (1 tsp)"], "instructions": "Preheat the oven to 180C/160C Fan/Gas 4. Butter a wide shallow 1.7-litre/3-pint ovenproof dish.\r\nPut the butter, sugar, eggs, flour, baking powder, bicarbonate of soda and treacle into a mixing bowl. Beat using an electric handheld whisk for about 30 seconds or until combined. Pour in the milk gradually and whisk again until smooth. Pour into the prepared dish. Bake for 35–40 minutes or until well risen and springy in the centre.\r\nTo make the sauce, put all the ingredients into a saucepan and stir over a low heat until the sugar has dissolved and the butter has melted. Bring to the boil, stirring for a minute.\r\nTo serve, pour half the sauce over the pudding in the baking dish. Serve with the cream or ice cream.", "image_url": "https://www.themealdb.com/images/media/meals/xqqqtu1511637379.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52883"},
{"meal_name": "Salted Caramel Cheescake", "category": "Dessert", "tags": null, "ingredients": ["Digestive Biscuits (250g)", "Pretzels (75g)", "Butter (135g)", "Cream Cheese (450g)", "Vanilla Extract (1tsp)", "Icing Sugar (100g)", "Caramel (150g)", "Sea Salt (1tsp)", "Double Cream (300ml)", "Caramel Sauce (drizzle)", "Toffee Popcorn (Top)", "Pretzels (Top)"], "instructions": "1) Blitz the biscuits and the pretzels in a food processor and mix the biscuits with the melted butter. Spread on the bottom of an 8″/20cm Deep Springform Tin and press down firmly. Leave to set in the fridge whilst you make the rest!\r\n\r\n2) Using an electric mixer, I use my KitchenAid with the whisk attachment, whisk together the cream cheese, vanilla, and icing sugar until smooth and then add the caramel and whisk again until smooth and lump free – this could take a couple of minutes, I whisk it at half speed so not too quick or slow!\r\n\r\n3) Pour in the double cream & Salt flakes and continue to whisk for a couple of minutes until its very thick and mousse like (I mix it on a medium speed, level 6/10) – Now this could take up to 5 minutes depending on your mixer, but you seriously have to stick at it – it will hold itself completely when finished mixing (like a meringue does!) If you don’t mix it enough it will not set well enough, but don’t get impatient and whisk it really quick because that’ll make it split! Spread over the biscuit base and leave to set in the fridge overnight.\r\n\r\n4) Remove the Cheesecake from the tin carefully and decorate the cheesecake – I drizzled over some of the spare caramel, and then some Toffee Popcorn and more Pretzels!", "image_url": "https://www.themealdb.com/images/media/meals/xqrwyr1511133646.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52833"},
{"meal_name": "Seri muka kuih", "category": "Dessert", "tags": null, "ingredients": ["Rice (400g)", "Coconut Milk (150ml)", "Water (100ml)", "Salt (1 tsp)", "Corn Flour (5 tbs)", "Flour (3 tbs)", "Eggs (3)", "Coconut Cream (200ml)", "Sugar (140g)"], "instructions": "Soak glutinous rice with water for at least 1 ½ hours prior to using. Drain.\r\nPrepare a 9-inch round or square cake pan and spray with cooking spray or line with plastic wrap.\r\nMix coconut milk, water, salt and the rice. Pour it into cake pan, topped with the pandan knots.\r\nSteam for 30 minutes.\r\nAfter 30 minutes, fluff up the rice and remove pandan knots. Then, using a greased spatula, flatten the steamed rice. Make sure there are no holes/air bubbles and gaps in the rice, especially the sides.\r\nSteam for another 10 minutes.\r\n\r\nCombine pandan juice, coconut milk, all purpose flour, cornflour, and sugar. Mix well.\r\nAdd eggs and whisk well then strain into a medium sized metal bowl or pot.\r\nPlace pandan mixture over simmering water (double boiler or bain-marie)\r\nStir continuously and cook till custard starts to thicken. (15 minutes)\r\nPour pandan custard into glutinous rice layer, give it a little tap (for air bubbles) and continue to steam for 30 minutes.\r\nRemove kuih seri muka from the steamer and allow to cool completely before cutting into rectangles or diamond shapes.", "image_url": "https://www.themealdb.com/images/media/meals/6ut2og1619790195.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53054"},
{"meal_name": "Rogaliki (Polish Croissant Cookies)", "category": "Dessert", "tags": null, "ingredients": ["Butter (1 cup)", "Egg Yolks (3)", "Cream Cheese (8 oz)", "Baking Powder (1 tsp)", "Flour (3 cups)", "Jam (1 Jar)"], "instructions": "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.\r\nCreate a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.\r\nTake the dough out and separate into two. Roll and cut out 3 inch trangles.\r\nMake as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.\r\nPlace the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.\r\nRepeat with the rest of the dough.\r\nWhen you take them out, put aside and sprinkle with powdered sugar on top.\r\nThis makes about 3 batches of 20 cookies each.\r\nTotal count about 60 cookies.", "image_url": "https://www.themealdb.com/images/media/meals/7mxnzz1593350801.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53024"},
{"meal_name": "Rocky Road Fudge", "category": "Dessert", "tags": "Chocolate,Snack,Sweet,Baking", "ingredients": ["Miniature Marshmallows (2 cups)", "Chocolate Chips (3 cups)", "Peanut Butter (½ cup)", "Vanilla Extract (1 tsp)", "Peanuts (1 ¼ cups)"], "instructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nPour ½ cup of the miniature marshmallows into the bottom of the lined baking dish.\r\nIn a microwave-safe bowl, combine the chocolate chips and peanut butter. Microwave the chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract and stir well, until smooth.\r\nReserve 2 tablespoons of the chopped almonds or peanuts, and set aside.\r\nFold 1 ½ cups of the miniature marshmallows and the remaining chopped nuts into the chocolate mixture.\r\nTransfer the chocolate mixture into the prepared pan and spread into an even layer. Immediately top with the reserved chopped nuts and the mallow bits or additional miniature marshmallows, if using.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.", "image_url": "https://www.themealdb.com/images/media/meals/vtxyxv1483567157.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52786"},
{"meal_name": "Rock Cakes", "category": "Dessert", "tags": "Baking,Cake", "ingredients": ["Self-raising Flour (225g)", "Caster Sugar (75g)", "Baking Powder (1 tsp)", "Butter (125g)", "Dried Fruit (150g)", "Eggs (1)", "Milk (1 tbs)", "Vanilla Extract (2 tsp)"], "instructions": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.\r\nIn a clean bowl, beat the egg and milk together with the vanilla extract.\r\nAdd the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.\r\nPlace golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.\r\nBake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool.", "image_url": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52901"},
{"meal_name": "Pumpkin Pie", "category": "Dessert", "tags": "Halloween,Pie,Desert", "ingredients": ["Pumpkin (750g)", "Shortcrust Pastry (350g)", "Plain Flour (Dusting)", "Caster Sugar (140g)", "Salt (½ tsp)", "Nutmeg (½ tsp)", "Cinnamon (1 tsp)", "Eggs (2 Beaten)", "Butter (25g)", "Milk (175g)", "Icing Sugar (1 tblsp)"], "instructions": "Place the pumpkin in a large saucepan, cover with water and bring to the boil. Cover with a lid and simmer for 15 mins or until tender. Drain pumpkin; let cool.\r\nHeat oven to 180C/160C fan/gas 4. Roll out the pastry on a lightly floured surface and use it to line a 22cm loose-bottomed tart tin. Chill for 15 mins. Line the pastry with baking parchment and baking beans, then bake for 15 mins. Remove the beans and paper, and cook for a further 10 mins until the base is pale golden and biscuity. Remove from the oven and allow to cool slightly.\r\nIncrease oven to 220C/200C fan/gas 7. Push the cooled pumpkin through a sieve into a large bowl. In a separate bowl, combine the sugar, salt, nutmeg and half the cinnamon. Mix in the beaten eggs, melted butter and milk, then add to the pumpkin purée and stir to combine. Pour into the tart shell and cook for 10 mins, then reduce the temperature to 180C/160C fan/gas 4. Continue to bake for 35-40 mins until the filling has just set.\r\nLeave to cool, then remove the pie from the tin. Mix the remaining cinnamon with the icing sugar and dust over the pie. Serve chilled.", "image_url": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52857"},
{"meal_name": "Raspberry mousse", "category": "Dessert", "tags": null, "ingredients": ["Gelatine Leafs (2)", "Raspberries (350g)", "Caster Sugar (60g)", "Lemon (Juice of 1)", "Whipping Cream (500ml)"], "instructions": "step 1\r\nPut the gelatine leaves in a bowl, cover with warm water and leave to soak for 5 mins. Drain and squeeze out any excess water.\r\n\r\nstep 2\r\nTip the raspberries into a pan over a medium-low heat along with the sugar and lemon juice. Cook for 5-6 mins until the berries have completely broken down. Push the mixture through a sieve set over a bowl, discarding the seeds. Stir in the gelatine leaves until dissolved (if they don’t dissolve, pour the mixture into a clean saucepan and heat gently until dissolved). Set aside to cool for 15 mins.\r\n\r\nstep 3\r\nWhip the cream to soft peaks using an electric whisk, then gently fold this into the raspberry mixture. Spoon into the ramekins or moulds and chill overnight, or for at least 6 hrs. Serve with raspberries scattered over the top.", "image_url": "https://www.themealdb.com/images/media/meals/v5jrnn1764362830.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53303"},
{"meal_name": "Pouding chomeur", "category": "Dessert", "tags": "Pudding", "ingredients": ["Butter (½ cup)", "Sugar (1 cup)", "Eggs (2)", "Vanilla Extract (1 tsp)", "Flour (2 cups)", "Baking Powder (1 tsp)", "Milk (1 1/4 cup)", "Maple Syrup (1 1/2 cup)", "Brown Sugar (1 1/2 cup)", "Single Cream (1 1/2 cup)", "Butter (1/3 cup)"], "instructions": "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.\r\nAdd eggs and vanilla and mix.\r\nIn another bowl, mix flour and baking powder.\r\nAlternate flour mix and milk to the butter mix.\r\nPour into a 13 inch by 9 inch greased pan.\r\nMAPLE SAUCE.\r\nIn a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.\r\nReduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.\r\nPour sauce gently over cake.\r\nBake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean.", "image_url": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52932"},
{"meal_name": "Postre Chajá", "category": "Dessert", "tags": null, "ingredients": ["Egg (5)", "Sugar (100g)", "Salt (Pinch)", "All purpose flour (75g)", "Cornstarch (30g)", "Egg White (1)", "Sugar (50g)", "Dulce de leche (200g)", "Heavy Cream (400g)", "Vanilla Extract (1 tsp)", "Sugar (40g)", "Peaches (500g)", "Peach Juice (50 ml)", "Cornstarch (1 tsp)"], "instructions": "For the sponge cake preheat oven to 180 degrees Celsius and prepare either one or two 20cm/8 inch cake pan(s). Line bottom with parchment paper. Then divide the eggs into egg white and egg yolks. Use a bigger bowl for the egg yolks. If you have a glass or metal bowl, use that one for the egg whites. Be sure that bowl is free of fat/grease and that your mixer was properly cleaned. First beat the egg whites on medium speed with a pinch of salt until soft peaks form. Set aside. Without cleaning our mixer, beat the egg yolks with the sugar. Beat until the color becomes much paler and you have a creamy consistency. This usually takes several minutes.\r\n\r\n2\r\nGently pour one third of the egg whites on top of the mixed egg yolks and sift the flour and cornstarch on top. Don't skip this step. It is important that the flour mix was sifted. Gently mix all ingredients with a spatula. Try to incorperate the flour mix and egg whites without losing volume. Add the last two thirds of beaten egg whites and gently fold the mixture. Don't overmix. Put batter into the prepared cake pans and immediately bake. Don't let the batter sit for too long as it will quickly lose volume. Bake for 35 minutes if using one springform or 25 minutes if using two. Let cool a little before gently getting them out of the form. Tip: if making the day before, wrap in cling wrap, it is much easier to cut in half once cold.\r\n\r\n3\r\nFor the meringue beat egg white until soft peaks form, add pinch of salt and continue beating on high while adding the sugar. Beat for at least three more minutes until glossy and shiny. Pipe small stars or other shapes with the meringue on a baking sheet lined with parchment paper. Dry for about 45min at 100 degrees Celsius in the oven. Keep in airtight container until further use.\r\n\r\n4\r\nFor the filling beat heavy cream, vanilla extract and sugar until stiff peaks form, slice peaches in thin slices. Cut cake in four layers, this is much easier done once the cake layers are cold. Brush cake layer with some of the peach juice left, then pipe thin layer of whipped cream around the edges, place the peach slices in the middle on first layer on cake, on the second layer only spread the dulce de leche. Repeat layer with brushed peach juice, whipped cream and peaches for the third and final layer. Be sure to reserve enough peach slices for the top. Spread thin layer of whipped cream on the sides of the cake and pipe on some roses around the edges if desired. Heat the peach juice and mix the cornstarch with a bit of water until you see no lumps. Once juice is hot, add the cornstarch and stir until glaze thickenes. Pour over peaches of the top layer cake. Crush the meringue and pat around the sides. Serve immediately.\r\n\r\n", "image_url": "https://www.themealdb.com/images/media/meals/wii0591764375062.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53323"},
{"meal_name": "Portuguese custard tarts", "category": "Dessert", "tags": null, "ingredients": ["Plain Flour (2 tbs)", "Icing Sugar (2 tbs)", "Puff Pastry (375g)", "Caster Sugar (250g)", "Lemon Zest (2 strips)", "Cinnamon (1 Stick)", "Eggs (2)", "Egg Yolks (4)", "Corn Flour (50g)", "Whole Milk (500ml)", "Vanilla (Pod of)", "Cinnamon (To serve)"], "instructions": "STEP 1\r\nRoll the pastry\r\nMix the flour and icing sugar, and use this to dust the work surface. Roll the pastry out to make a 45 x 30cm rectangle. Roll up lengthways to create a long sausage shape.\r\n\r\nSTEP 2\r\nCutting pastry into rounds\r\nCut the pastry into 24 wheels, about 1-2cm thick.\r\n\r\nSTEP 3\r\nRoll out each pastry portion\r\nRoll each wheel lightly with the rolling pin to fit 2 x 12-hole non-stick fairy cake tins.\r\n\r\nSTEP 4\r\nPress pastry into the tin\r\nPress the pastry circles into the tins and mould into the tins to make thin cases. Chill until needed.\r\n\r\nSTEP 5\r\nMake the infused syrup\r\nHeat the oven to 220C/fan 200C/gas 7. Make a sugar syrup by bringing the sugar, 200ml water, lemon zest and cinnamon stick to the boil. Reduce until syrupy, allow to cool, then remove the cinnamon and lemon. Whisk the eggs, egg yolks and cornflour until smooth in another large pan.\r\n\r\nSTEP 6\r\nMaking custard\r\nHeat the milk and vanilla pod seeds in a separate pan until just below the boil. Gradually pour the hot milk over the eggs and cornflour, then cook on a low heat, continually whisking.\r\n\r\nSTEP 7\r\nAdd syrup to custard\r\nAdd the cooled sugar syrup to the custard and whisk until thickened slightly.\r\n\r\nSTEP 8\r\nPour custard into the tins\r\nPour the custard through a sieve. Pour into the pastry cases and bake for 15 minutes until the pastry is golden and the custard has darkened.\r\n\r\nSTEP 9\r\ncool and dust with icing sugar\r\nCool completely in the tins then sift over icing sugar and ground cinnamon to serve.\r\n\r\n\r\n\r\n ", "image_url": "https://www.themealdb.com/images/media/meals/vmz7gl1614350221.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53046"},
{"meal_name": "Polskie Nalesniki (Polish Pancakes)", "category": "Dessert", "tags": null, "ingredients": ["Flour (1 cup)", "Eggs (2)", "Milk (1 cup)", "Water (3/4 cup)", "Salt (Pinch)", "Sugar (1 tsp)", "Butter (3 tbs)"], "instructions": "Add flour, eggs, milk, water, and salt in a large bowl then mix with a hand mixer until you have a smooth, lump-free batter.\r\nAt this point, mix in the butter or the vegetable oil. Alternatively, you can use them to grease the pan before frying each pancake.\r\nHeat a non-stick pan over medium heat, then pour in the batter, swirling the pan to help it spread.\r\nWhen the pancake starts pulling away a bit from the sides, and the top is no longer wet, flip it and cook shortly on the other side as well.\r\nTransfer to a plate. Cook the remaining batter until all used up.\r\nServe warm, with the filling of your choice.", "image_url": "https://www.themealdb.com/images/media/meals/58bkyo1593350017.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53022"},
{"meal_name": "Polish doughnuts (Pączki)", "category": "Dessert", "tags": null, "ingredients": ["Yeast (10g)", "Caster Sugar (1 tsp)", "Flour (1 tablespoon)", "Milk (125ml)", "Egg Yolks (7)", "Sugar (15g)", "Caster Sugar (10g)", "Vanilla Extract (1 tsp)", "Flour (500g)", "Double Cream (200ml)", "Butter (15g)", "Jam (125ml)", "Ground Almonds (10g)", "Oil (For frying)", "Icing Sugar (75g)", "Lemon (Juice of 1/2)", "Almond Essence (Dash)", "Almonds (50g)"], "instructions": "step 1\r\nTo make the leaven, mix the yeast with the sugar and flour, and stir in the warm milk. Set aside in a warm place for 30 minutes.\r\n\r\nstep 2\r\nFor the dough, put egg yolks into a heatproof bowl and add the sugar and vanilla sugar. Set the bowl over a pan of simmering water and whisk until smooth and thick.\r\n\r\nstep 3\r\nSift the flour into the bowl of a stand mixer, add the beaten yolks and the warm cream, mix thoroughly, then add a pinch of salt and the leaven. Bring together to make a dough and knead for 10 minutes (or 15-20 if doing this by hand).\r\n\r\nstep 4\r\nWhen the dough stops sticking to your hands, pour in the cooled melted butter and knead for a few more minutes. Cover with a cloth and leave in a warm place to rise for at least 1 hr-1 hr 30 mins.\r\n\r\nstep 5\r\nMix the jam with the ground almonds and spoon into a piping bag or jam syringe. Divide the dough into 16 pieces and shape them into doughnuts. Cover and leave to rise for 30 mins.\r\n\r\nstep 6\r\nFill a deep pan or a deep fat fryer one third full of oil or melted lard and heat it until it is 180C – if you don’t have a thermometer, drop in a small chunk of bread. The oil is ready when it browns in about 30 secs. Add the doughnuts and fry, turning them once for about 1-2 mins on each side (a thin lighter ring should form in the middle). After removing, drain the doughnuts of excess fat on some kitchen paper.", "image_url": "https://www.themealdb.com/images/media/meals/x6jqog1764359857.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53298"},
{"meal_name": "Polish chocolate & walnut cake", "category": "Dessert", "tags": null, "ingredients": ["Plain Flour (150g)", "Coco Sugar (50g)", "Egg (8)", "Caster Sugar (200g)", "Egg White (5)", "Caster Sugar (200g)", "Walnuts (250g)", "Plain Flour (1 tablespoon)", "Potato Starch (1 tablespoon)", "Double Cream (100g)", "Chocolate Chips (100g)"], "instructions": "Heat the oven to 170C/150C fan/gas 3½. Line a 30 x 22cm shallow baking tin with baking parchment. Sift the flour and mix it with cocoa, then set aside. Beat the egg whites until stiff, then add the sugar to them in small batches. Add the egg yolks, one by one, whisking constantly. Tip in the flour mixture and gently fold everything together with a spatula. Pour the prepared batter into the lined tin and bake for 35 mins. Cool for 5 mins, remove from the tin and re-line the tin with baking parchment.\r\n\r\nstep 2\r\nTo make the meringue, whisk the whites until stiff, then gradually whisk in the sugar, one tablespoon at a time. When you have a stiff and shiny meringue, fold in the finely chopped walnuts, flour and startch. Spread the mixture into the re-lined tin and cook for 40 mins on the same heat. Remove from the oven and leave to cool.\r\n\r\nstep 3\r\nFor the chocolate glaze, heat the cream over low heat, then remove from the heat, pour the chopped chocolate into it and mix it until it melts and becomes shiny.\r\n\r\nstep 4\r\nCut the cooled chocolate sponge cake and meringue into two layers. Put the nut meringue on top of the bottom layer of sponge and sprinkle on some of the reserved walnuts. Add another layer of meringue and then the upper layer of chocolate sponge cake and cover the top with chocolate glaze. Decorate with walnuts. Put the finished cake in the fridge for 1-2 hrs before serving.", "image_url": "https://www.themealdb.com/images/media/meals/e8ihjp1764123021.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53295"},
{"meal_name": "Pistachio Kunafa Chocolate Cake and Cupcakes", "category": "Dessert", "tags": null, "ingredients": ["White Chocolate (6 tablespoons)", "Unsalted Pistachio (1 cup)", "Condensed Milk (3  tablespoons)", "Milk (5 tablespoons)", "Oreo Cream Biscuits (25)", "Milk (1/2 cup)", "Baking Powder (1/2 teaspoon)", "Vinegar (1/2 teaspoon)", "Salt (1 pinch)", "Sevaiiya (150g)", "Ghee (1 tablespoon)", "Dark Chocolate (120ml)", "Malai (4 tablespoons)"], "instructions": "1\r\nFor Chocolate Cake:Ready all the ingredients. Powder the oreo biscuits, pinch salt and mix warm milk as needed and make a cake batter. Add in baking powder and vinegar and mix.\r\n2\r\nGrease a loose bottomed tin. Pour a 1cm thick layer of the batter.\r\n3\r\nBake in a preheated oven @160°C for 7-8 minutes or until the knife comes out clean. Cool on wire rack.\r\n4\r\nFor Homemade Pistachio Paste:Ready all the pistachio paste ingredients. Slightly melt white chocolate on a double boiler.(else the mixer blade may break) Coarsely powder the pistachio in mixer. Add in condensed milk.\r\n5\r\nAdd in slightly warmed and slightly melted white chocolate and milk as required and crush to a smooth paste.(Green food colour can be add. I haven't.)\r\n6\r\nFor Kunafa: In a kadhaai take ghee and roast the sevaiiya on slow gas. Keep stirring until a pleasant roasted aroma releases. Cool it. Add in the Homemade pistachio paste.Mix well.\r\n7\r\nLip smacking Kunafa is ready. Spread a 2 cm layer on the cooled chocolate cake.\r\n8\r\nMelt dark chocolate and strained malai and prepare the chocolate ganache. Cool and pour on the Kunafa layer.\r\n9\r\nGarnish Pistachio Kunafa Chocolate Cake with chopped pistachio and silver balls. Keep in fridge for 2-3 hours. Then unmould the Kunafa Cake.\r\n10\r\nI also prepared Kunafa cupcakes. Cut and enjoy. The cake looked so pretty that we could either save it or have it!! ☺\r\n11\r\nCross sectional view of the Pistachio Kunafa Chocolate Cake.\r\n12\r\nEnjoy with a new sweet delicacy this festive season with family and friends. ", "image_url": "https://www.themealdb.com/images/media/meals/yh3sg71763741307.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53224"},
{"meal_name": "Pistachio cake", "category": "Dessert", "tags": null, "ingredients": ["Butter (250g)", "Pistachio (200g)", "Plain Flour (80g)", "Baking Powder (1 tsp)", "Caster Sugar (225g)", "Egg (4)", "Vanilla Extract (1 tsp)", "Icing Sugar (100g)", "Mascarpone (250g)", "Double Cream (200ml)", "Pistachio Paste (100g)", "Raspberries (400g)", "Unwaxed Lime (1)"], "instructions": "Heat the oven to 180C/160C fan/gas 4. Butter and line a 23cm springform cake tin. Tip 150g of the pistachios into a food processor and blitz until finely ground. Tip into a bowl and mix in the flour, baking powder and pinch of salt. Beat the butter and sugar in a separate bowl until fluffy and pale, around 5 mins. Crack in the eggs one at a time, beating well for 1 min after each addition, until they have all been added. Beat in the vanilla, then fold in the flour mixture gently. Carefully spoon into the prepared tin and bake for 35-40 mins until a skewer inserted into the middle comes out clean. Set aside to cool completely on a wire rack in the tin.\r\n\r\nstep 2\r\nMeanwhile, sift the icing sugar into a bowl, then tip in the mascarpone, double cream and pistachio paste. Beat until well combined, then set aside in the fridge for 20-30 mins to thicken to a spooning consistency.\r\n\r\nstep 3\r\nCut the cooled cake in half horizontally using a serrated knife, so you have two layers. Put the bottom layer on a plate or cake stand and spread over a generous spoonful of the pistachio cream. Top with a generous handful of the raspberries so the cake is covered. Top with the other sponge half, then cover the top and sides of the cake with the remaining cream. Scatter over the last of the raspberries, the remaining pistachios and the lime zest to serve. Will keep chilled in an airtight container for two days.", "image_url": "https://www.themealdb.com/images/media/meals/xvgpng1764121726.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53293"},
{"meal_name": "Piernik (Polish gingerbread)", "category": "Dessert", "tags": null, "ingredients": ["Unsalted Butter (140g)", "Clear Honey (300g)", "Brown Sugar (100g)", "Self-raising Flour (375g)", "Ground Ginger (3 tsp)", "Ground Cinnamon (1 tsp)", "Ground Clove (1/2 teaspoon)", "Ground Nutmeg (1/4 tsp)", "Pepper (1/4 tsp)", "Egg (3 Large)", "Plum Jam (200g)", "Double Cream (225ml)", "Dark Chocolate (140g)", "Clear Honey (3  tablespoons)"], "instructions": "Heat oven to 160C/140C fan/gas 3. Grease and line the base and sides of a deep 20cm cake tin with baking parchment. Put the honey, sugar and butter in a medium saucepan and cook over a medium heat until fully melted. Remove from the heat and allow to cool. Put the flour and spices in a large bowl and mix everything together.\r\n\r\nstep 2\r\nOnce the liquid ingredients have cooled, whisk in the eggs. Pour over the dry ingredients, whisking them together to form a smooth batter – be careful not to overmix as this can lead to a dry cake. Pour into the prepared tin and bake for 50-55 mins or until risen and a skewer inserted into the middle of the cake comes out clean. Allow the cake to cool in the pan for 20 mins before turning out onto a wire rack to cool completely.\r\n\r\nstep 3\r\nOnce cooled, use a large serrated knife to slice the cake into 3 layers. Spread the jam across the 2 bottom cake layers, then reassemble the cake and set aside while you make the glaze. Put the cream, chocolate and honey in a medium pan and cook over a low-medium heat until the chocolate is melted and you have a smooth, pourable mixture. Put the cake on a wire rack set over a parchment-lined baking tray and pour over the glaze, making sure to cover the entire cake. Use a fish slice to carefully transfer the cake to a serving plate and allow the glaze to set. To decorate, dust with a little edible gold powder, if you like. Uniced, this cake will keep for up to 5 days. Once iced, enjoy within 3 days – just keep in the fridge, but remove before serving and eat at room temperature.", "image_url": "https://www.themealdb.com/images/media/meals/kwmdk41764120884.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53292"},
{"meal_name": "Peanut Butter Cheesecake", "category": "Dessert", "tags": "Cake,Desert,Treat,UnHealthy,Speciality", "ingredients": ["Butter (50g)", "Peanut Cookies (175g)", "Gelatine Leafs (5)", "Ricotta (500g)", "Peanut Butter (175g)", "Golden Syrup (175g)", "Milk (150ml)", "Double Cream (275ml)", "Light Brown Soft Sugar (2 tblsp)", "Peanut Brittle (Crushed)"], "instructions": "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible. Melt the butter in a pan. Crush the biscuits by bashing them in a bag with a rolling pin, then stir them into the butter until very well coated. Press the mixture firmly into the base of the tin and chill.\r\nSoak the gelatine in water while you make the filling. Tip the ricotta into a bowl, then beat in the peanut butter and syrup. Ricotta has a slightly grainy texture so blitz until smooth with a stick blender for a smoother texture if you prefer.\r\nTake the soaked gelatine from the water and squeeze dry. Put it into a pan with the milk and heat very gently until the gelatine dissolves. Beat into the peanut mixture, then tip onto the biscuit base. Chill until set.\r\nTo freeze, leave in the tin and as soon as it is solid, cover the surface with cling film, then wrap the tin with cling film and foil.\r\nTo defrost, thaw in the fridge overnight.\r\nTo serve, carefully remove from the tin. Whisk the cream with the sugar until it holds its shape, then spread on top of the cheesecake and scatter with the peanut brittle.", "image_url": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52861"},
{"meal_name": "Pear Tarte Tatin", "category": "Dessert", "tags": "Tart,Glazed,Baking", "ingredients": ["Pears (8)", "Caster Sugar (100g)", "Butter (100g)", "Star Anise (2)", "Cardamom (3 Pods)", "Cinnamon (1 large)", "Brandy (2 tbs)", "Puff Pastry (500g)"], "instructions": "Core the pears, then peel as neatly as possible and halve. If you like, they can be prepared up to a day ahead and kept in the fridge, uncovered, so that they dry out.\r\nTip the sugar, butter, star anise, cardamom and cinnamon into an ovenproof frying pan, about 20cm wide, and place over a high heat until bubbling. Shake the pan and stir the buttery sauce until it separates and the sugar caramelises to a toffee colour.\r\nLay the pears in the pan, then cook in the sauce for 10-12 mins, tossing occasionally, until completely caramelised. Don’t worry about them burning – they won’t – but you want to caramelise them as much as possible. Splash in the brandy and let it flambé, then set the pears aside.\r\nHeat oven to 200C/fan 180C/gas 6. Roll the pastry out to the thickness of a £1 coin. Using a plate slightly larger than the top of the pan, cut out a circle, then press the edges of the circle of pastry to thin them out.\r\nWhen the pears have cooled slightly, arrange them in the pan, cut side up, in a floral shape, with the pears around the edge pointing inwards. Rest the cinnamon stick on the top in the centre, with the cardamom pods scattered around.\r\nDrape the pastry over the pears, then tuck the edges down the pan sides and under the fruit (see Gordon’s guide). Pierce the pastry a few times, then bake for 15 mins. If a lot of juice bubbles up the side of the pan, pour it off at this stage (see guide). Reduce oven to 180C/fan 160C/gas 4 and bake for 15 mins more until the pastry is golden. Leave the tart to stand for 10 mins, then invert it carefully onto a serving dish.", "image_url": "https://www.themealdb.com/images/media/meals/rxvxrr1511797671.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52916"},
{"meal_name": "Peanut Butter Cookies", "category": "Dessert", "tags": "Breakfast,UnHealthy,BBQ", "ingredients": ["Peanut Butter (1 cup)", "Sugar (1/2 cup)", "Egg (1)"], "instructions": "Preheat oven to 350ºF (180ºC).\r\nIn a large bowl, mix together the peanut butter, sugar, and egg.\r\nScoop out a spoonful of dough and roll it into a ball. Place the cookie balls onto a nonstick baking sheet.\r\nFor extra decoration and to make them cook more evenly, flatten the cookie balls by pressing a fork down on top of them, then press it down again at a 90º angle to make a criss-cross pattern.\r\nBake for 8-10 minutes or until the bottom of the cookies are golden brown.\r\nRemove from baking sheet and cool.\r\nEnjoy!", "image_url": "https://www.themealdb.com/images/media/meals/1544384070.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52958"},
{"meal_name": "Peach & Blueberry Grunt", "category": "Dessert", "tags": "Desert,Pudding,Fruity", "ingredients": ["Corn Flour (1 tsp)", "Orange (Juice of 2)", "Orange (Zest of 1)", "Caster Sugar (2 tbs)", "Peaches (6)", "Blueberries (250g)", "Self-raising Flour (200g)", "Butter (50g)", "Muscovado Sugar (100g)", "Cinnamon (1 tsp)", "Milk (6 tblsp)"], "instructions": "Heat oven to 190C/170C fan/gas 5. Butter a wide shallow ovenproof dish. Blend the cornflour with the orange zest and juice, and put in a large pan with the sugar. Halve, stone and slice the peaches and add to the pan. Bring slowly to the boil, stirring gently until the sauce is shiny and thickened, about 3-4 mins. Remove from the heat, stir in the blueberries and tip into the prepared dish.\r\nTip the flour into a mixing bowl and add the 50g butter. Rub the butter into the flour until it resembles fine breadcrumbs, then stir in half the sugar. Mix the remaining sugar with the cinnamon and set aside.\r\nAdd the milk to the dry ingredients and mix to a soft dough. Turn out onto a lightly floured surface and knead briefly. Roll out to an oblong roughly 16 x 24cm. Brush with melted butter and sprinkle evenly with the spicy sugar. Roll up from one long side and cut into 12 slices. Arrange around the top of the dish, leaving the centre uncovered.\r\nBake for 20-25 mins, until the topping is crisp and golden. Serve warm.", "image_url": "https://www.themealdb.com/images/media/meals/ssxvup1511387476.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52862"},
{"meal_name": "Passion fruit mousse", "category": "Dessert", "tags": null, "ingredients": ["Unflavoured Gelatin (1 ½ tbsp)", "Passion Fruit Pulp (1)", "Sugar (1 cup)", "Condensed Milk (1 Can)", "Egg White (6)", "Mint (1 Sprig)"], "instructions": "Add gelatin and ¼ cup room-temperature water to small bowl; let sit until gelatin softens, about 5 minutes. In medium saucepan over medium-high heat, stir together passion fruit pulp, sugar and gelatin mixture. Cook, stirring occasionally, until mixture is thoroughly combined and smooth (mixture should not come to a boil). Remove from heat; cool completely. Stir in condensed milk.\r\nMeanwhile, in clean mixing bowl, using electric mixer, beat egg whites until stiff (peaks of egg whites will not droop, and egg whites will not move when bowl is tilted).\r\nStir 1/3 egg whites into cooled passion fruit mixture until combined. Using spatula, gently fold in remaining egg whites until combined. Divide mousse evenly among clear glass serving cups; cover. Refrigerate mousse until well chilled, at least 2 hrs.\r\nServe chilled. Garnish with mint, if desired.", "image_url": "https://www.themealdb.com/images/media/meals/gkcdpl1764441325.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53333"},
{"meal_name": "Pancakes", "category": "Dessert", "tags": "Breakfast,Desert,Sweet,Fruity", "ingredients": ["Flour (100g)", "Eggs (2 large)", "Milk (300ml)", "Sunflower Oil (1 tbls)", "Sugar (to serve)", "Raspberries (to serve)", "Blueberries (to serve)"], "instructions": "Put the flour, eggs, milk, 1 tbsp oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter. Set aside for 30 mins to rest if you have time, or start cooking straight away.\r\nSet a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go.\r\nServe with lemon wedges and sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months.", "image_url": "https://www.themealdb.com/images/media/meals/rwuyqx1511383174.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52854"},
{"meal_name": "Parkin Cake", "category": "Dessert", "tags": "Caramel", "ingredients": ["Butter (200g)", "Egg (1 large)", "Milk (4 tbs)", "Golden Syrup (200g)", "Black Treacle (85g)", "Brown Sugar (85g)", "Oatmeal (100g)", "Self-raising Flour (250g)", "Ground Ginger (1 tbs)"], "instructions": "Heat oven to 160C/140C fan/gas 3. Grease a deep 22cm/9in square cake tin and line with baking parchment. Beat the egg and milk together with a fork.\r\n\r\nGently melt the syrup, treacle, sugar and butter together in a large pan until the sugar has dissolved. Remove from the heat. Mix together the oatmeal, flour and ginger and stir into the syrup mixture, followed by the egg and milk.\r\n\r\nPour the mixture into the tin and bake for 50 mins - 1 hr until the cake feels firm and a little crusty on top. Cool in the tin then wrap in more parchment and foil and keep for 3-5 days before eating if you can – it’ll become softer and stickier the longer you leave it, up to 2 weeks.\r\n", "image_url": "https://www.themealdb.com/images/media/meals/qxuqtt1511724269.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52902"},
{"meal_name": "Norwegian Krumkake", "category": "Dessert", "tags": null, "ingredients": ["Egg (3 Large)", "Sugar (3/4 cup)", "Butter (2/3 Cup)", "Cardamom (1 teaspoon)", "Nutmeg (1 pinch)", "Salt (1/2 teaspoon)", "Flour (1 1/4 cup)", "Water (Splash)"], "instructions": "▢\r\nWhisk the egg and sugar until the mixture thickens.\r\n▢\r\nMelt the butter and let it cool slightly, then add the butter to the egg mixture.\r\n▢\r\nMix in spices and then slowly add the flour while stirring to avoid lumps. \r\n▢\r\nLet the batter rest for at least 30 minutes. This improves the texture of the krumkaker.\r\n▢\r\nSpoon about one heaping tablespoon of batter onto iron and bake. If the batter is too thick, add some water to it.\r\n▢\r\nWhile still hot, shape the krumkake with a wooden krumkake roller or over a cup (if using a cup, make them a bit thicker). The krumkaker harden quickly, so you can just let them sit on the roller/cup until the next krumkake is ready to be shaped. \r\n▢\r\nAfter completely cooled, store the krumkaker in a metal or glass tin lined with paper towels at the bottom. You can also freeze them!", "image_url": "https://www.themealdb.com/images/media/meals/z9g8011763075640.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53129"},
{"meal_name": "New York cheesecake", "category": "Dessert", "tags": "Desert,Dairy,Pudding,Cake,Breakfast", "ingredients": ["Butter (85g)", "Sour Cream (140g)", "Sugar (1tbsp)", "Cream Cheese (900g)", "Caster Sugar (250g)", "Plain Flour (3 tbs)", "Lemon Juice (1 ½ teaspoons)", "Eggs (3 Large)", "Sour Cream (250ml)", "Sour Cream (150ml)", "Caster Sugar (1 tbsp)", "Lemon Juice (2 tsp)"], "instructions": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.", "image_url": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52858"},
{"meal_name": "Turkish lahmacun", "category": "Beef", "tags": null, "ingredients": ["Strong white bread flour (500g)", "Fast action yeast (10g)", "Corn Flour (Sprinkling)", "Tomato (2)", "Green Chilli (2)", "Spring Onions (4 Chopped)", "Parsley (Bunch)", "Ground Beef (250g)", "Chilli Flakes (2 tsp)", "Ground Cumin (Pinch)", "Allspice (1 tsp)", "Olive Oil (2 tablespoons)", "Lemon (1/2)", "Red Onions (1)"], "instructions": "step 1\r\nSift the flour into a large bowl, make a well in the middle and sprinkle in the yeast. Pour 125ml water over the yeast, then flick flour over the liquid to create a layer. Cover and leave to rise in a warm place for 15 mins until cracks appear on the surface of that layer.\r\n\r\nstep 2\r\nUse your hands to mix in 250ml more water along with 1 tsp salt and knead the dough for about 10 mins until elastic and no longer sticky. Add a little more flour if you need to. Cover and leave to rise again in a warm place for 30 mins until doubled in size.\r\n\r\nstep 3\r\nHeat the oven to as high as it will go (about 240C/220C fan/gas 9) and sprinkle one or two baking trays thinly with cornmeal.\r\n\r\nstep 4\r\nPour boiling water from the kettle over the tomatoes, leave to stand briefly, then drain and slip off the skins. Cut the tomatoes in half, cut out the stalks, scoop out the seeds and discard, then chop the flesh.\r\n\r\nstep 5\r\nHalve the chillies lengthways, cut out the stalks, seeds and white inner membrane, then rinse. Cut lengthwise into fine strips, then crosswise into fine dice.\r\n\r\nstep 6\r\nPut the tomatoes, chillies, spring onions, finely chopped parsley, beef mince, spices, 1 tsp salt and ½ tsp freshly ground black pepper into a bowl and mix well.\r\n\r\nstep 7\r\nTake the dough and knead it briefly, then divide into four pieces and shape each into a ball. Roll each ball into a thin circle, place on the prepared baking trays. Spread with a thin layer of the meat mixture.\r\n\r\nstep 8\r\nBake each flatbread for 10-15 mins until the edges begin to darken. After removing from the oven, sprinkle the lahmacun with the roughly chopped parsley and sliced onion, then squeeze over a few drops of lemon juice. Serve straightaway.", "image_url": "https://www.themealdb.com/images/media/meals/tqd3ac1763786065.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53251"},
{"meal_name": "Nanaimo Bars", "category": "Dessert", "tags": "Treat,Snack,Dairy", "ingredients": ["Custard (125g)", "Caster Sugar (50g)", "Cocoa (5 tbs)", "Egg (1 beaten)", "Digestive Biscuits (200g shredded)", "Desiccated Coconut (100g)", "Almonds (50g)", "Butter (100g)", "Double Cream (4 tbs)", "Custard Powder (3 tbs)", "Icing Sugar (250g)", "Dark Chocolate (150g)", "Butter (50g)"], "instructions": "Start by making the biscuit base. In a bowl, over a pan of simmering water, melt the butter with the sugar and cocoa powder, stirring occasionally until smooth. Whisk in the egg for 2 to 3 mins until the mixture has thickened. Remove from heat and mix in the biscuit crumbs, coconut and almonds if using, then press into the base of a lined 20cm square tin. Chill for 10 mins.\r\nFor the middle layer, make the custard icing; whisk together the butter, cream and custard powder until light and fluffy, then gradually add the icing sugar until fully incorporated. Spread over the bottom layer and chill in the fridge for at least 10 mins until the custard is no longer soft.\r\nMelt the chocolate and butter together in the microwave, then spread over the chilled bars and put back in the fridge. Leave until the chocolate has fully set (about 2 hrs). Take the mixture out of the tin and slice into squares to serve.", "image_url": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52924"},
{"meal_name": "Mini bundt cakes", "category": "Dessert", "tags": null, "ingredients": ["Butter (150g)", "Plain Flour (175g)", "Caster Sugar (125g)", "Egg (3)", "Baking Powder (1 tsp)", "Cocoa Powder (2 tsp)", "Milk (3  tablespoons)", "Icing Sugar (1 tablespoon)"], "instructions": "step 1\r\nHeat the oven to 180C/160C fan/gas 4. Melt 25g butter and generously brush into the holes of a mini bundt tins. Tip a little flour into each hole and shake to coat, then tip out the excess. Beat the butter, caster sugar and a pinch of salt together using an electric whisk. Add the eggs, one at a time, beating well after each addition. Combine the flour and baking powder in a separate bowl, then sift this into the wet ingredients and stir until smooth. Combine the cocoa powder and milk in a small bowl until smooth.\r\n\r\nstep 2\r\nSpoon 1 tbsp of the plain batter into each hole of the bundt tin. Mix the remaining plain batter with the cocoa powder mixture, then divide this between the holes. Bake for 15-18 mins, or until a skewer inserted into the cakes comes out clean. Leave to cool in the tin for 5 mins, then turn out onto a wire rack and leave to cool completely. Dust with icing sugar to serve.\r\n\r\nstep 3\r\nPour 1 tablespoon of light batter into each mold. Mix the remaining batter with the stirred cocoa mixture and then fill the molds with a tablespoon.\r\n\r\nstep 4\r\nBake the mini Bundt cakes in the preheated oven for 15-18 minutes , depending on the size of the molds. After 15 minutes of baking time, use a toothpick to test with a skewer and, if necessary, bake for another 3 minutes. Let the mini Bundt cakes cool down completely in the tin. Then carefully remove from the mold. Dust with some icing sugar and serve. Enjoy your meal!", "image_url": "https://www.themealdb.com/images/media/meals/tzt3it1764363293.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53304"},
{"meal_name": "Traditional Croatian Goulash", "category": "Beef", "tags": "Soup", "ingredients": ["Beef (500g)", "Onions (2 chopped)", "Carrots (2 chopped)", "Garlic (2 cloves)", "Bay Leaf (2)", "Red Wine (200ml)", "Water (2 Litres)", "Mustard (3 tbs)", "Salt (1tbsp)", "Pepper (1/2 tsp)", "Paprika (1/2 tsp)", "Vegetable Oil (2 tbs)"], "instructions": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour\r\nHeat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot\r\nCut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster\r\nOnce the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid\r\nCover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes\r\nAllow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors", "image_url": "https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53057"},
{"meal_name": "Thai beef stir-fry", "category": "Beef", "tags": null, "ingredients": ["Vegetable Oil (2 tbsp)", "Beef (400g)", "Red Chilli (1 sliced)", "Oyster Sauce (2 tblsp)", "Basil Leaves (Handful)"], "instructions": "step 1\r\nHeat a wok or large frying pan until smoking hot. Pour in the oil and swirl around the pan, then tip in the beef strips and chilli. Cook, stirring all the time, until the meat is lightly browned, about 3 mins, then pour over the oyster sauce. Cook until heated through and the sauce coats the meat. stir in the basil leaves and serve with plain rice.", "image_url": "https://www.themealdb.com/images/media/meals/kyuxew1763479470.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53199"},
{"meal_name": "Steak and Kidney Pie", "category": "Beef", "tags": "Pie", "ingredients": ["Puff Pastry (300g)", "Egg White (Beaten)", "Egg Yolks (Beaten)", "Vegetable Oil (2 tbs)", "Beef (70 ml)", "Lamb Kidney (200g)", "Onions (2 chopped)", "Plain Flour (30g)", "Beef Stock (85 ml)", "Salt (pinch)", "Pepper (pinch)", "Worcestershire Sauce (Dash)"], "instructions": "Preheat the oven to 220C/425F/Gas 7\r\nHeat the vegetable oil in a large frying pan, and brown the beef all over. (You may need to do this in batches.) Set aside, then brown the kidneys on both sides in the same pan. Add the onions and cook for 3-4 minutes.\r\nReturn the beef to the pan, sprinkle flour over and coat the meat and onions\r\nAdd the stock to the pan, stir well and bring to the boil.\r\nTurn the heat down and simmer for 1½ hours without a lid. If the liquid evaporates too much, add more stock.\r\nRemove from the heat. Add salt, pepper and Worcestershire sauce and allow to cool completely. Place the cooked meat mixture into a pie dish.\r\nRoll out the pastry to 5mm/¼in thick and 5cm/2in larger than the dish you are using.\r\nUsing a rolling pin, lift the pastry and place it over the top of the pie dish. Trim and crimp the edges with your fingers and thumb.\r\nBrush the surface with the beaten egg mixture and bake for 30-40 minutes until golden-brown and puffed.\r\nServe with creamy mash and steamed vegetables to soak up the gravy.", "image_url": "https://www.themealdb.com/images/media/meals/qysyss1511558054.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52881"},
{"meal_name": "Szechuan Beef", "category": "Beef", "tags": null, "ingredients": ["Beef (1/2 lb)", "Salt (1/2 tsp)", "Sesame Seed Oil (1 tsp)", "Pepper (1 pinch)", "Egg White (1)", "Starch (3 tbs)", "Oil (4 tbs)", "Ginger (1 tsp)", "Garlic (1 tsp)", "Onion (3/4 cup)", "Carrots (1/2 cup)", "Green Pepper (3/4 cup)", "Celery (1 cup)", "Mushrooms (1 cup)", "Cooking wine (1 tbs)", "Water (1 cup)", "Oyster Sauce (1 tbs)", "Hotsauce (1/2 tsp)", "Sugar (1 tsp)", "Soy Sauce (1 tbs)"], "instructions": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.\r\nSTEP 2 - STIR FRY\r\nFirst Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.\r\nSet the beef aside\r\nIn a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.\r\nNext add all of the vegetables and then add sherry cooking wine and 1 cup of water.\r\nTo make the sauce add oyster sauce, hot pepper sauce, and sugar.\r\nadd the cooked beef and 1 spoon of soy sauce\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.", "image_url": "https://www.themealdb.com/images/media/meals/1529443236.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52950"},
{"meal_name": "Spaghetti Bolognese", "category": "Beef", "tags": "Pasta,Meat", "ingredients": ["onions (2)", "olive oil (1tbsp)", "garlic (1 clove)", "lean minced beef (500g)", "mushrooms (90g)", "dried oregano (1tsp)", "tomatoes (400g can)", "hot beef stock (300ml)", "tomato puree (1tbsp)", "worcestershire sauce (1tbsp)", "spaghetti (350g)", "parmesan (Topping)"], "instructions": "Put the onion and oil in a large pan and fry over a fairly high heat for 3-4 mins. Add the garlic and mince and fry until they both brown. Add the mushrooms and herbs, and cook for another couple of mins.\r\n\r\nStir in the tomatoes, beef stock, tomato ketchup or purée, Worcestershire sauce and seasoning. Bring to the boil, then reduce the heat, cover and simmer, stirring occasionally, for 30 mins.\r\n\r\nMeanwhile, cook the spaghetti in a large pan of boiling, salted water, according to packet instructions. Drain well, run hot water through it, put it back in the pan and add a dash of olive oil, if you like, then stir in the meat sauce. Serve in hot bowls and hand round Parmesan cheese, for sprinkling on top.", "image_url": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52770"},
{"meal_name": "Steak & Vietnamese noodle salad", "category": "Beef", "tags": null, "ingredients": ["Brown Rice Noodle (85g)", "Rapeseed Oil (1 tsp)", "Fillet Of Steak (250g)", "Carrots (2)", "Chinese Cabbage (1/2)", "Spring Onions (4 finely sliced)", "Coriander (Handful)", "Red Chilli (1 sliced)", "Lime (Juice of 1)", "Brown Sugar (2 tsp)", "Rice Vinegar (1 tsp)", "Garlic Clove (1 chopped)", "Fish Sauce (1/2 tbs)"], "instructions": "step 1\r\nMix all the ingredients for the dressing together in a bowl with 1 tbsp water until the sugar has dissolved.\r\n\r\nstep 2\r\nCook the noodles following pack instructions, then plunge into a bowl of cold water to cool completely. Drain the noodles, then add the carrot, cabbage, spring onion and dressing, and toss to combine.\r\n\r\nstep 3\r\nHeat the oil in a frying pan over a high heat. Season the steak, then cook to your liking; 2-3 mins on each side for medium rare. Leave to rest for 5 mins, then slice. Divide the salad and steak slices between bowls and scatter over some coriander to serve.", "image_url": "https://www.themealdb.com/images/media/meals/st9shl1763755808.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53229"},
{"meal_name": "Steak Diane", "category": "Beef", "tags": "DateNight,Expensive,Meat,MainMeal,Cheasy", "ingredients": ["Canola Oil (2 tbs)", "Beef Fillet (4)", "Beef Stock (1 1/2 cup)", "Butter (2 tbs)", "Garlic (2 cloves minced)", "Challots (1 medium finely diced)", "Mushrooms (4 oz)", "Brandy (¼ cup)", "Heavy Cream (¼ cup)", "Dijon Mustard (1 tbs)", "Worcestershire Sauce (1 tbs)", "Tabasco Sauce (Dash)", "Parsley (1 tbs minced)", "Chives (1 tbs minced)", "Salt (to taste)", "Pepper (to taste)"], "instructions": "Heat oil in a 12\" skillet over medium-high heat. Season steaks with salt and pepper, and add to skillet; cook, turning once, until browned on both sides and cooked to desired doneness, about 4 to 5 minutes for medium-rare. Transfer steaks to a plate, and set aside.\r\nReturn skillet to high heat, and add stock; cook until reduced until to 1⁄2 cup, about 10 minutes. Pour into a bowl, and set aside. Return skillet to heat, and add butter; add garlic and shallots, and cook, stirring, until soft, about 2 minutes. Add mushrooms, and cook, stirring, until they release any liquid and it evaporates and mushrooms begin to brown, about 2 minutes. Add cognac, and light with a match to flambée; cook until flame dies down. Stir in reserved stock, cream, Dijon, Worcestershire, and hot sauce, and then return steaks to skillet; cook, turning in sauce, until warmed through and sauce is thickened, about 4 minutes. Transfer steak to serving plates and stir parsley and chives into sauce; pour sauce over steaks to serve.", "image_url": "https://www.themealdb.com/images/media/meals/vussxq1511882648.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52935"},
{"meal_name": "Soy-Glazed Meatloaves with Wasabi Mashed Potatoes & Roasted Carrots", "category": "Beef", "tags": null, "ingredients": ["Potatoes (5)", "Carrots (12 ounces)", "Scallions (1)", "Garlic (2 cloves)", "Bread (1 Slice)", "Garlic Powder (1)", "Soy Sauce (2)", "Ground Beef (1)", "Vegetable Oil (1 tsp)", "Sugar (2 tsp)", "Butter (2 tbsp)"], "instructions": "1. Preheat oven to 425 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim, peel, and cut carrots on a diagonal into 1/2-inch-thick pieces. Trim and thinly slice scallions, separating whites from greens; finely chop whites. Peel and finely chop garlic.\r\n\r\n2. In a medium bowl, soak bread with 2 TBSP water (4 TBSP for 4 servings); break up with your hands until pasty. Stir in beef, sriracha, scallion whites, half the garlic, salt (we used 3/4 tsp kosher salt; 11/2 tsp for 4), and pepper. Form into two 1-inch-tall loaves (four loaves for 4). Place on one side of a baking sheet. Toss carrots on empty side of same sheet with a drizzle of oil, salt, and pepper. (For 4, spread meatloaves out across whole sheet and add carrots to a second sheet.) Bake for 20 minutes (we'll glaze the meatloaves then).\r\n\r\n3. Meanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very\r\ntender, 12-15 minutes. Reserve 1/2 cup potato cooking liquid, then drain. While potatoes cook, in a small bowl, combine soy sauce, garlic powder, 1/4 cup ketchup (1/2 cup for 4 servings), and 2 tsp sugar (4 tsp for 4).\r\n\r\n4. Once meatloaves and carrots have baked 20 minutes, remove from oven. Spoon half the ketchup glaze over meatloaves (save\r\nthe rest for serving); return to oven until carrots are browned and tender, meatloaves are cooked through, and glaze is tacky, 4-5 minutes more.\r\n\r\n5. Meanwhile, melt 2 TBSP butter (4 TBSP for 4 servings) in pot used for potatoes over medium heat. Add remaining garlic and cook\r\nuntil fragrant, 30 seconds. Add potatoes and 1/4 tsp wasabi. Mash, adding splashes of reserved potato cooking liquid as necessary until smooth. Season with salt and pepper. (If you like things spicy, stir in more wasabi!)\r\n\r\n6. Divide meatloaves, mashed potatoes, and roasted carrots between plates. Sprinkle with scallion greens and serve with remaining ketchup glaze on the side for dipping.", "image_url": "https://www.themealdb.com/images/media/meals/o2wb6p1581005243.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52992"},
{"meal_name": "Shawarma chuck roast wrap", "category": "Beef", "tags": null, "ingredients": ["Chuck Roast (1kg)", "Beef Stock (1 cup)", "Lemon Juice (3  tablespoons)", "Ground Cumin (1 tablespoon)", "Paprika (2 tsp)", "Salt (1 tsp)", "Ground Ginger (1 tsp)", "Turmeric (1 tsp)", "Cayenne Pepper (1/2 teaspoon)", "Ground Cinnamon (1/2 teaspoon)", "Ground Coriander (1/2 teaspoon)", "Ground Clove (1/4 tsp)"], "instructions": "1\r\nIn a dutch oven or slow cooker, add all the spices, beef broth and lemon juice. Stir to combine..\r\n2\r\nAdd the beef and turn to coat, spoon some sauce over the top.\r\n3\r\nCover and cook on low for 8-10 hours.\r\n4\r\nAfter cooking, remove beef and use two forks to shred. Discard any excess fat.\r\n5\r\nSkim fat off of the top of the liquid remaining.\r\n6\r\nMix shredded beef into sauce. Keep warm until you are ready to serve.\r\n7\r\nBuild wrap by spreading garlic sauce on the pita. Top with beef and add garnishes to your liking.\r\n8\r\nFold it burrito style.\r\n9\r\nHeat a grill pan and grill the wrap.", "image_url": "https://www.themealdb.com/images/media/meals/swo87v1763595282.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53217"},
{"meal_name": "Oxtail with broad beans", "category": "Beef", "tags": "Heavy,MainMeal,Speciality", "ingredients": ["Oxtail (450g)", "Onion (1 chopped)", "Spring Onions (1)", "Garlic (2 cloves minced)", "Ginger (1 tsp)", "Scotch Bonnet (1 chopped)", "Soy Sauce (2 tbs)", "Fresh Thyme (1 chopped)", "Vegetable Oil (2 tbs)", "Water (350ml)", "Broad Beans (200g)", "Corn Flour (1 tbs)", "Water (2 tbs)"], "instructions": "Toss the oxtail with the onion, spring onion, garlic, ginger, chilli, soy sauce, thyme, salt and pepper. Heat the vegetable oil in a large frying pan over medium-high heat. Brown the oxtail in the pan until browned all over, about 10 minutes. Place into a pressure cooker, and pour in 375ml water. Cook at pressure for 25 minutes, then remove from heat, and remove the lid according to manufacturer's directions.\r\nAdd the broad beans and pimento berries, and bring to a simmer over medium-high heat. Dissolve the cornflour in 2 tablespoons water, and stir into the simmering oxtail. Cook and stir a few minutes until the sauce has thickened, and the broad beans are tender.", "image_url": "https://www.themealdb.com/images/media/meals/1520083578.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52943"},
{"meal_name": "Paszteciki (Polish Pasties)", "category": "Beef", "tags": null, "ingredients": ["Flour (1 cup)", "Salt (1/4 tsp)", "Egg (1 Yolk)", "Egg (1)", "Butter (5 tbs)", "Butter (6 tblsp)", "Onion (1/3 cup)", "Swede (1/2 cup)", "Beef Brisket (1/2 lb)", "Eggs (2 Beaten)", "Salt (1 tsp)", "Pepper (1/4 tsp)"], "instructions": "Sift flour and salt into a large mixing bowl.\r\nUse a spoon to push the egg yolk through a fine sieve into the flour.\r\nAdd the raw egg and mix well.\r\nBeat in butter 1 tablespoon at a time.\r\nPlace dough on a floured surface and knead until smooth and elastic, then wrap in waxed paper and refrigerate until firm (at least 30 minutes).\r\nIn a heavy skillet, melt 2 tablespoons butter over medium heat; saute the onion and rutabaga until the onion is soft and transparent (5 minutes).\r\nPut the onions, rutabaga, and beef through a meat grinder twice if you have one, if not just chop them up as fine as possible.\r\nMelt the remaining 4 tablespoons butter over medium heat, and add the meat mixture.\r\nCook over low heat, stirring occasionally, until all of the liquid has evaporated and the mixture is thick enough to hold its shape.\r\nRemove from heat and let cool, then stir in 1 egg, and season with salt and pepper.\r\nPreheat oven to 350°F.\r\nOn a lightly floured surface, roll the dough out into a 13x8\" rectangle (1/8\" thick).\r\nSpoon the filling down the center of the rectangle lengthwise, leaving about an inch of space on each end.\r\nLightly brush the long sides with cold water, then fold one of the long sides over the filling and the other side over the top of that.\r\nBrush the short ends with cold water and fold them over the top, enclosing the filling.\r\nPlace pastry seam side down on a baking sheet and brush the top evenly with the remaining scrambled egg.\r\nBake in preheated oven until rich golden brown (30 minutes).\r\nSlice pastry diagonally into 1.5\" long pieces and serve as an appetizer or with soup.", "image_url": "https://www.themealdb.com/images/media/meals/c9a3l31593261890.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53017"},
{"meal_name": "Red Peas Soup", "category": "Beef", "tags": "Soup,SideDish", "ingredients": ["Kidney Beans (2 cups)", "Carrots (1 large)", "Spring Onions (2 chopped)", "Thyme (4 sprigs)", "Onion (1 Diced)", "Black Pepper (1/2 tsp)", "Red Pepper (2 chopped)", "Garlic Clove (4 Mashed)", "Allspice (1 tbs)", "Beef (2 Lbs)", "Water (2L)", "Potatoes (4)", "Plain Flour (1 cup)", "Water (1/4 cup)", "Coconut Milk (1 cup)"], "instructions": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.", "image_url": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52941"},
{"meal_name": "Roti john", "category": "Beef", "tags": null, "ingredients": ["Minced Beef (1/4 lb)", "Onion (1)", "Eggs (3)", "Chilli (1 tbs)", "Baguette (1/2)", "Salt (To taste)", "Pepper (To taste)", "Mayonnaise (Top)"], "instructions": "Mix all the ingredients in a bowl.\r\nHeat a pan or griddle with a little vegetable oil.\r\nPour the mixture onto the pan and place a piece of open-faced baguette on top.\r\nPress on the bread with a spatula and grill for 2 minutes.\r\nTurn the bread over to make it a little crispy.\r\nRemove from pan and cut the bread into small portions.\r\nAdd mayonnaise and/or Sambal before cutting the sandwich (optional).", "image_url": "https://www.themealdb.com/images/media/meals/hx335q1619789561.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53052"},
{"meal_name": "Portuguese prego with green piri-piri", "category": "Beef", "tags": null, "ingredients": ["Garlic (1 clove)", "Beef Fillet (2 small)", "Olive Oil (2 tbs)", "Vinegar (1 tbs)", "Parsley (Leaves)", "Ciabatta (2)", "Rocket (2 handfulls)", "Basil Leaves (Small bunch)", "Parsley (Small bunch)", "Jalapeno (1)", "Vinegar (1 tbs)", "Spring Onions (2 chopped)", "Garlic (1/2)", "Caster Sugar (1/2 tsp)"], "instructions": "STEP 1\r\n\r\nRub the garlic over the steaks then put in a sandwich bag and tip in the olive oil, sherry vinegar and parsley stalks. Smoosh everything together, then use a rolling pin to bash the steaks a few times. Leave for 1-2 hours.\r\n\r\nSTEP 2\r\n\r\nTo make the sauce, put all the ingredients into a blender with 1 tbsp water and whizz until as smooth as possible. This will make more than you’ll need for the recipe but will keep for a week in an airtight jar.\r\n\r\nSTEP 3\r\n\r\nHeat a griddle or frying pan to high. Brush away the garlic and parsley stalks from the steaks and season well. Sear the steaks for 2 minutes on each side then rest on a plate. Put the ciabatta halves onto the plate, toasted-side down, to soak up any juices.\r\n\r\nSTEP 4\r\n\r\nSlice the steaks then stuff into the rolls with the green sauce and rocket.", "image_url": "https://www.themealdb.com/images/media/meals/ewcikl1614348364.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53042"},
{"meal_name": "Pate Chinois", "category": "Beef", "tags": "MainMeal,Alcoholic", "ingredients": ["Potatoes (4 cups)", "Butter (60ml)", "Milk (½ cup)", "Minced Beef (450g)", "Onion (1 finely chopped)", "Creamed Corn (500ml)", "Paprika (to taste)", "Parsley (to taste)", "Salt (Dash)", "Pepper (Dash)"], "instructions": "In a large pot of salted water, cook the potatoes until they are very tender. Drain.\r\nWith a masher, coarsely crush the potatoes with at least 30 ml (2 tablespoons) of butter. With an electric mixer, purée with the milk. Season with salt and pepper. Set aside.\r\nWith the rack in the middle position, preheat the oven to 190 °C (375 °F).\r\nIn a large skillet, brown the onion in the remaining butter. Add the meat and cook until golden brown. Season with salt and pepper. Remove from the heat.\r\nLightly press the meat at the bottom of a 20-cm (8-inch) square baking dish. Cover with the corn and the mashed potatoes. Sprinkle with paprika and parsley.\r\nBake for about 30 minutes. Finish cooking under the broiler. Let cool for 10 minutes.", "image_url": "https://www.themealdb.com/images/media/meals/yyrrxr1511816289.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52930"},
{"meal_name": "Mulukhiyah", "category": "Beef", "tags": null, "ingredients": ["Mulukhiyah (800g)", "Onion (1 chopped)", "Beef (300g)", "Salt (1 tsp)", "Water (1 Litre)", "Garlic Clove (1)", "Olive Oil (1/2 cup)"], "instructions": "Saute the onions in the 3-4 tablespoons olive oil\r\nAdd the beef cubes or the chicken cutlets, sear for 3-4 min on each side\r\nAdd 1 liter of water or just enough to cover the meat\r\nCook over medium heat until the meat is done (I usually do this in the pressure cooker and press them for 5 min)\r\n\r\nAdd the frozen mulukhyia and stir until it thaws completely and then comes to a boil\r\n\r\nIn another pan add the 1/4 to 1/2 cup of olive oil and the cloves of garlic and cook over medium low heat until you can smell the garlic (don’t brown it, it will become bitter)\r\n\r\nAdd the oil and garlic to the mulukhyia and lower the heat and simmer for 5-10 minutes\r\nAdd salt to taste\r\n\r\nServe with a generous amount of lemon juice.\r\n\r\nYou can serve it with some short grain rice or some pita bread", "image_url": "https://www.themealdb.com/images/media/meals/x372ug1598733932.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53029"},
{"meal_name": "Moussaka", "category": "Beef", "tags": null, "ingredients": ["Beef (500g)", "Aubergine (1 large)", "Greek Yogurt (150g)", "Egg (1 beaten)", "Parmesan (3 tbs)", "Tomato (400g)", "Tomato Puree (4 tbs)", "Potatoes (350g)"], "instructions": "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.\r\n\r\nStir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden.", "image_url": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53006"},
{"meal_name": "Vietnamese chicken salad", "category": "Chicken", "tags": null, "ingredients": ["Rice Noodles (140g)", "Carrots (1)", "Cucumber (1/2)", "Chicken Breasts (2)", "Radish (50g)", "Red Onions (1/2)", "Mint (Bunch)", "Peanuts (25g)", "Red Chilli (1 chopped)", "Lime (Zest and juice of 1)", "Fish Sauce (1 ½ tbsp)", "Soy Sauce (1 ½ tbsp)", "Sesame Seed Oil (1 ½ tbsp)"], "instructions": "step 1\r\nTo make the dressing, whisk all the ingredients together in a large serving bowl. Cook the noodles following pack instructions, then drain and add to the bowl with the dressing.\r\n\r\nstep 2\r\nPeel the carrot into long strips using a vegetable peeler. Do the same for the cucumber, until you reach the seeds (discard them). Add the carrot and cucumber to the noodle mixture along with the shredded chicken, radishes, red onion and mint. Toss well to coat in the dressing, scatter over the peanuts and serve.", "image_url": "https://www.themealdb.com/images/media/meals/pk8wtn1763758591.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53232"},
{"meal_name": "Montreal Smoked Meat", "category": "Beef", "tags": "Speciality,Snack,StrongFlavor", "ingredients": ["Beef Brisket (1)", "Salt (3 tbs)", "Black Pepper (3 tbs)", "Coriander (1 tbs)", "Sugar (1 tbs)", "Bay Leaf (1 tsp)", "Cloves (1 tsp)", "Black Pepper (3 tbs)", "Coriander (1 tbs)", "Paprika (1 tbs)", "Garlic (1 tbs)", "Onion (1 tbs)", "Dill (1 tbs)", "English Mustard (1 tsp)", "Celery Salt (1 tbs)", "Red Pepper Flakes (1 tsp)"], "instructions": "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day.\r\nRemove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels.\r\nTo make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub.\r\nFire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours.\r\nTransfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed.\r\nTransfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard.", "image_url": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52927"},
{"meal_name": "Venezuelan Coconut Chicken", "category": "Chicken", "tags": null, "ingredients": ["Chicken Breasts (2)", "Onion (2 chopped)", "Garlic (1 clove peeled crushed)", "Bay Leaves (4)", "Black Pepper (Pinch)", "Turmeric (Pinch)", "Cumin (Pinch)", "Salt (Pinch)", "Sugar (1 tablespoon)", "Tomato (3)", "Ginger Paste (1 tablespoon)", "Olive Oil (1/3 cup)", "Coconut Milk (1 Can)", "Water (1/2 cup)"], "instructions": "Cut the chicken up into bite size pieces. Peel and cut the onions, mince the garlic.\r\nAssemble the rest of the ingredients and you are ready to start cooking.\r\nMake the Dish\r\nHeat up a fry pan over medium heat. Add the oil and when hot, sauté the onion until translucent. Remove from pan and transfer to a blender or food processor.\r\nAdd tomatoes, garlic, turmeric, cumin, sugar, ginger paste, coconut milk, water and blend smooth.\r\nIn the same pan you cooked the onion, add the chicken and brown all sides. This should take about 3 minutes.\r\nAdd the blender ingredients and bay leaves to the pan, bring to a simmer and cook until the chicken is white inside and the liquid is creamy. (15 to 20 minutes)\r\nRemove the bay leaves and serve with white rice.", "image_url": "https://www.themealdb.com/images/media/meals/z2sw3o1764378271.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53327"},
{"meal_name": "Tom kha gai", "category": "Chicken", "tags": null, "ingredients": ["Chicken Stock (800ml)", "Coconut Milk (800g)", "Galangal Paste (2 tablespoons)", "Lemongrass Stalks (2)", "Lime Leaves (8)", "Chicken Thighs (500g)", "Oyster Mushrooms (300g)", "Birds-eye Chillies (6)", "Caster Sugar (1 tablespoon)", "Fish Sauce (5 tablespoons)", "Lime (Juice of 3)", "Coriander Leaves (To serve)", "Rice (To serve)"], "instructions": "step 1\r\nPour the chicken stock and coconut milk into a large saucepan set over a medium heat. Tip in the galangal, lemongrass and lime leaves, and bring to a gentle simmer, around 6-8 mins. Keeping at a gentle simmer, add the chicken. Cook for 8-10 mins until tender and cooked through.\r\n\r\nstep 2\r\nStir in the mushrooms and chillies, and simmer for a further 3-5 mins until everything is cooked through. Sprinkle in the sugar and 3 tbsp each of the fish sauce and lime juice. Taste and add the remaining if required.\r\n\r\nstep 3\r\nRemove the galangal, lemongrass and lime leaves before serving using a slotted spoon. Ladle into bowls and serve with coriander leaves sprinkled over and steamed rice on the side. Will keep chilled for up to three days. Leave to cool first.", "image_url": "https://www.themealdb.com/images/media/meals/ol2xxt1763582263.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53207"},
{"meal_name": "Thai Green Curry", "category": "Chicken", "tags": "Curry,Mild", "ingredients": ["Potatoes (225g new)", "green beans (100g)", "sunflower oil (1 tbsp)", "garlic (1 clove)", "Thai green curry paste (4 tsp)", "coconut milk (400ml)", "Thai fish sauce (2 tsp)", "Sugar (1 tsp)", "Chicken (450g boneless)", "lime (2 fresh kaffir leaves)", "basil (handfull)", "Rice (Boiled)"], "instructions": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side.\r\nIn a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble.\r\nStir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked.\r\nTip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice.", "image_url": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52814"},
{"meal_name": "Thai chicken cakes with sweet chilli sauce", "category": "Chicken", "tags": null, "ingredients": ["Chicken Breast (2 large)", "Garlic (1 clove)", "Ginger (1 small)", "Onion (1 chopped)", "Coriander (4 tbs)", "Green Chilli (1 chopped)", "Olive Oil (2 tblsp)", "sweet chilli sauce (To serve)", "Lime (To serve)", "Spring Onions (Chopped)", "Red Chilli (Chopped)"], "instructions": "step 1\r\nToss the chicken, garlic, ginger, onion, coriander and chilli into a food processor and season well. Blitz until the chicken is finely ground and everything is well mixed. Use your hands to shape six small cakes.\r\n\r\nstep 2\r\nHeat the oil in a frying pan, then fry the cakes over a medium heat for about 6-8 mins, turning once. Serve hot, with sweet chilli sauce, lime wedges, coriander, shredded spring onion and red chilli.", "image_url": "https://www.themealdb.com/images/media/meals/6s3i3p1763488540.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53206"},
{"meal_name": "Thai drumsticks", "category": "Chicken", "tags": null, "ingredients": ["sweet chilli sauce (2 tablespoons)", "Orange (Zest of 1)", "Orange (2 tblsp)", "Garlic (1 clove peeled crushed)", "Thai Red Curry Paste (1 tblsp)", "Chicken drumsticks (8)"], "instructions": "step 1\r\nHeat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Mix the chilli sauce with the orange zest and juice, garlic, curry paste and ¼ tsp salt. Add the chicken and coat really well.\r\n\r\nstep 2\r\nArrange the drumsticks on the foil, spaced apart. Coat the chicken with any marinade left in the bowl, then roast for 35-40 mins until tender. Wrap in foil or pack into a food container.", "image_url": "https://www.themealdb.com/images/media/meals/ittake1763586925.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53212"},
{"meal_name": "Thai green chicken soup", "category": "Chicken", "tags": "Soup", "ingredients": ["Sunflower Oil (2 tblsp)", "Onion (1 chopped)", "Chicken Thighs (500g)", "Garlic Clove (4 sliced)", "Thai Green Curry Paste (280g)", "Coconut Milk (400ml)", "Chicken Stock (2 Litres)", "Lime Leaves (5)", "Fish Sauce (2 tblsp)", "Spring Onions (1  bunch)", "Green Beans (280g)", "Bamboo Shoot (150g)", "Lime (Juice of 2)", "Basil (Bunch)"], "instructions": "step 1\r\nHeat the oil in your largest pan, add the onion and fry for 3 mins to soften. Add the chicken and garlic, and cook until the chicken changes colour.\r\n\r\nstep 2\r\nAdd the curry paste, coconut milk, stock, lime leaves and fish sauce, then simmer for 12 mins. Add the chopped onion tops, green beans and bamboo shoots and cook for 4-6 mins, until the beans are just tender.\r\n\r\nstep 3\r\nMeanwhile, put the lime juice and basil in a narrow jug and blitz with a hand blender to make a smooth green paste. Pour into the soup with the sliced spring onion and heat through. Serve with lime wedges for a light lunch or supper or as a make-ahead starter.", "image_url": "https://www.themealdb.com/images/media/meals/7kb44y1763589084.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53214"},
{"meal_name": "Knafeh", "category": "Dessert", "tags": null, "ingredients": ["Knafeh (400g)", "Unsalted Butter (6 tablespoons)", "Yellow Food Colouring (1 pinch)", "Mozzarella (1 cup)", "Cream Cheese (1/4 cup)", "Milk (1 1/2 cup)", "Sugar (4 tablespoons)", "Corn Flour (2 tablespoons)", "Sugar (1 cup)", "Water (1 cup)", "Rose water (1 tsp)", "Lemon Juice (1/2 teaspoon)"], "instructions": "1\r\nTake kanfhe in a bowl and roughly cut them. Pour melted butter, yellow food color and mix well with your hands.\r\nIn a separate bowl mix milk, cream cheese, sugar, cornstarch well.\r\n2\r\nTurn on the flame and boil the liquid, when it gets thick turn off the flame let it cool down a little bit.\r\nAdd mozzarella in it and mix it well.\r\nNow make a base with half of the kanfhe in a dish, gently press it to level the dough well.\r\nPour the cheese mixture on the top and level it with a spoon.\r\n3\r\nCover it with the other half of the kanfhe.\r\nPut the dish in a preheated oven at 200 degree for about 20-25 minutes.\r\nIt's ready when kunafa is golden and crunchy in the surface.\r\n4\r\nBoil water in a pan and dissolve sugar in it for 4–5 minutes. OR cook it until slightly thicken and keep on stirring. Add lemon juice with rose water, mix well.\r\nEvenly pour the syrup over the kunafa as soon as it comes out of the oven.\r\nYour kunafa is ready to serve.", "image_url": "https://www.themealdb.com/images/media/meals/76nffj1763593933.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53216"},
{"meal_name": "Teriyaki Chicken Casserole", "category": "Chicken", "tags": "Meat,Casserole", "ingredients": ["soy sauce (3/4 cup)", "water (1/2 cup)", "brown sugar (1/4 cup)", "ground ginger (1/2 teaspoon)", "minced garlic (1/2 teaspoon)", "cornstarch (4 Tablespoons)", "chicken breasts (2)", "stir-fry vegetables (1 (12 oz.))", "brown rice (3 cups)"], "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!", "image_url": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52772"},
{"meal_name": "Key Lime Pie", "category": "Dessert", "tags": "Cake,Pie,Desert,Fruity,Sour", "ingredients": ["Digestive Biscuits (300g)", "Butter (150g)", "Condensed Milk (400g)", "Egg Yolks (3)", "Lime (4)", "Double Cream (300ml)", "Icing Sugar (1 tbls)", "Lime (to serve)"], "instructions": "Heat the oven to 160C/fan 140C/gas 3. Whizz the biscuits to crumbs in a food processor (or put in a strong plastic bag and bash with a rolling pin). Mix with the melted butter and press into the base and up the sides of a 22cm loose-based tart tin. Bake in the oven for 10 minutes. Remove and cool.\r\nPut the egg yolks in a large bowl and whisk for a minute with electric beaters. Add the condensed milk and whisk for 3 minutes then add the zest and juice and whisk again for 3 minutes. Pour the filling into the cooled base then put back in the oven for 15 minutes. Cool then chill for at least 3 hours or overnight if you like.\r\nWhen you are ready to serve, carefully remove the pie from the tin and put on a serving plate. To decorate, softly whip together the cream and icing sugar. Dollop or pipe the cream onto the top of the pie and finish with extra lime zest.", "image_url": "https://www.themealdb.com/images/media/meals/qpqtuu1511386216.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52859"},
{"meal_name": "Jam Roly-Poly", "category": "Dessert", "tags": null, "ingredients": ["Butter (50g)", "Self-raising Flour (250g)", "Vanilla (1 small)", "Suet (50g)", "Milk (150ml)", "Raspberry Jam (100g)", "Custard (to serve)"], "instructions": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.", "image_url": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52890"},
{"meal_name": "Tandoori chicken", "category": "Chicken", "tags": "Spicy,Meat", "ingredients": ["lemons (2 Juice)", "paprika (4 tsp)", "red onions (2 finely chopped)", "chicken thighs (16 skinnless)", "vegetable oil (For brushing)", "Greek yogurt (300ml)", "ginger (large piece)", "garlic clove (4)", "garam masala (¾ tsp)", "ground cumin (¾ tsp)", "chilli powder (½ tsp)", "turmeric (¼ tsp)"], "instructions": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.", "image_url": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52806"},
{"meal_name": "Jam jam cookies", "category": "Dessert", "tags": null, "ingredients": ["Egg (1)", "Butter (1 cup)", "Sugar (1 cup)", "Molasses (1/2 cup)", "Vanilla (1 tsp)", "Baking Powder (2 tsp)", "Water (3  tablespoons)", "Baking Powder (2 tablespoons)", "Cinnamon (1 tsp)", "Salt (2 tsp)", "Flour (4 cups)", "Jam (2 cups)"], "instructions": "Preheat the oven to 350 °F (180 °C) and line a large baking sheet with parchment paper.\r\nIn a stand mixer with the paddle attachment, cream the butter, white sugar and egg until combined, then add the molasses and vanilla and mix until smooth.\r\nOnce combined, add the baking soda water mixture and mix for another minute to combine.\r\nCombine dry ingredients; mix baking powder, cinnamon, flour and salt in a separate bowl then add to the wet ingredients a little at a time, mixing on low until fully combined and scraping down the sides to ensure everything is incorporated. The dough should be easily shaped.\r\nPortion dough with a small spoon, roll them into balls and place them on the lined cookie sheet, press them into flat discs using a floured glass or your moistened palm.\r\nPlace cookies on parchment-lined baking sheets and bake for 10-12 mins. Remove from the oven and let them cool for at least 10 minutes.\r\nOnce cooled the cookie sandwiches by spreading at least two teaspoons of your favourite jam between the two cookies. Repeat and enjoy with a cup of tea.", "image_url": "https://www.themealdb.com/images/media/meals/sktequ1764447186.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53339"},
{"meal_name": "Hot Chocolate Fudge", "category": "Dessert", "tags": "Snack,Chocolate", "ingredients": ["Chocolate Chips (2 cups)", "Heavy Cream (2 tbs)", "Condensed Milk (1 – 14-ounce can)", "Vanilla Extract (1 tsp)", "White Chocolate Chips (1-⅓ cups)", "Miniature Marshmallows (1-½ cups)"], "instructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nIn a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract to the dark chocolate mixture and stir well until smooth.\r\nTransfer the dark chocolate mixture into the prepared pan and spread into an even layer.\r\nIn a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nEvenly spread the white chocolate mixture on top of dark chocolate layer.\r\nTop the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.", "image_url": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52787"},
{"meal_name": "Honey Yogurt Cheesecake", "category": "Dessert", "tags": "Sweet", "ingredients": ["Digestive Biscuits (100g)", "Almonds (85g)", "Butter (85g)", "Greek Yogurt (250ml)", "Mascarpone (750g)", "Eggs (2)", "Lemon (Zest of 1)", "Orange (Zest of 1)", "Honey (250ml)", "Fruit Mix (To serve)"], "instructions": "Heat oven to 160C/140C fan/gas 3. Crush the biscuits and most of the almonds inside a plastic food bag using a rolling pin. Mix with the butter, then press into the bottom of a deep, oval, 23cm dish (or something similar in size – a roasting tin, baking dish or cake tin will work). Bake for 10 mins until crisp.\r\n\r\nStir or mash together the yogurt and mascarpone, then whisk in the eggs, one at a time. Stir in the lemon and orange zests, then stir in most of the honey, reserving about 3 tbsp. Spread over the biscuit base, cover loosely with foil and cook for 1 hr. Remove the foil and cook for 15 mins more until lightly golden and the top is firm with just the slightest wobble in the middle. Leave to cool. Can be kept in the fridge for up to 2 days.\r\n\r\nTo serve, scatter with almonds, drizzle over the remaining honey, and hand around fresh fruit to go with it.", "image_url": "https://www.themealdb.com/images/media/meals/y2irzl1585563479.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53007"},
{"meal_name": "Fyrstekake – Norwegian Prince Cake", "category": "Dessert", "tags": null, "ingredients": ["Granulated Sugar (3/4 cup)", "Vanilla Extract (1 teaspoon)", "Butter (2/3 Cup)", "Egg Yolks (4)", "Flour (2 cups)", "Baking Powder (1 teaspoon)", "Almonds (1 1/2 cups)", "Brown Sugar (3/4 cup)", "Melted Butter (2 tbsp)", "Egg (2 medium)", "Brandy (2 tablespoons)", "Almond Extract (5 drops)", "Egg (1)"], "instructions": "Crust\r\n▢\r\nMix together sugar, vanilla and butter until light and fluffy. Mix in the egg yolks. Add in the flour and baking powder and knead with hands until the dough is smooth.\r\n▢\r\nPack the dough in plastic wrap and chill in refrigerator for at least 30 minutes.\r\n\r\nAlmond filling\r\n▢\r\nRun the almonds and sugar together in a food processor until the almonds are finely ground (you can decide for yourself how coarse or fine you want them).\r\n▢\r\nStir in the butter, egg, cognac and/or almond extract (if using).\r\nAssembly\r\n▢\r\nLine the bottom of your cake form with baking paper and grease the sides of the form.\r\n▢\r\nPreheat oven to 350°F (175°C).\r\n▢\r\nCut 2/3 of the crust dough into slices and press down into the cake form. Cover the bottom of the cake form with the dough and bring the dough 2-3 cm (1 inch) up the sides of the form, pressing until even.\r\n▢\r\nScoop the almond filling on top of the crust, spreading it evenly across the cake form.\r\n▢\r\nRoll out of the rest of the dough and slice into long strips. Lay the strips of dough across the cake in a grid. Don't worry of the strips break – simply press them back together on the cake.\r\n▢\r\nGently brush the dough with egg wash.\r\n▢\r\nBake for about 45 minutes. The top of the cake should be golden brown while the almond filling will remain soft.", "image_url": "https://www.themealdb.com/images/media/meals/9zqrod1763075574.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53131"},
{"meal_name": "Flan", "category": "Dessert", "tags": null, "ingredients": ["Sugar (100g)", "Milk (350g)", "Sugar (45g)", "vanilla pod (1)", "Egg Yolks (4)", "Egg (2)", "Dulce de leche (To taste)"], "instructions": "For the caramel place 100 grams of sugar in a frying pan without any fat and melt on medium heat. Try not to stir with a spoon, but swirl the pan itself. Let melt until you have an amber color and sugar is fully melted. Fill the bottom of four flan containers with it. Caramel will harden immediately, so you need to be fast. My containers yield about 120 milliliters each.\r\n\r\n2\r\nPreheat oven to 150 degrees Celsius and look for a casserole or container all your four flan containers fit into.\r\n\r\n3\r\nHeat milk with 45 grams of sugar and the cut and scraped out vanilla pod. The milk does not need to boil, just needs to be heated. Take out vanilla pod after a few minutes. Meanwhile stir the egg yolks and eggs gently, try not to incorporate any air in it. Them pour milk-mix into egg-mix and again only stir very gently. Pour into prepared flan containers and place these into your casserole or container. Boil water and pour the water into the large casserole. Be sure not to touch the flan mixture. Place on middle rack in the oven and let bake for about 35-40 minutes. An inserted toothpick should come out clean.\r\n\r\n4\r\nLet cool inside the container for an hour before transferring to the fridge. Chill overnight. The next day gently release the rim and then turn upside down on a plate. Serve with some dulce de leche on the side.", "image_url": "https://www.themealdb.com/images/media/meals/0s80wo1764374393.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53322"},
{"meal_name": "Kentucky Fried Chicken", "category": "Chicken", "tags": "Meat,Spicy", "ingredients": ["Chicken (1 whole)", "Oil (2 quarts neutral frying)", "Egg White (1)", "Flour (1 1/2 cups)", "Brown Sugar (1 tablespoon)", "Salt (1 tablespoon)", "paprika (1 tablespoon)", "onion salt (2 teaspoons)", "chili powder (1 teaspoon)", "black pepper (1 teaspoon)", "celery salt (1/2 teaspoon)", "sage (1/2 teaspoon)", "garlic powder (1/2 teaspoon)", "allspice (1/2 teaspoon)", "oregano (1/2 teaspoon)", "basil (1/2 teaspoon)", "marjoram (1/2 teaspoon)"], "instructions": "Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.", "image_url": "https://www.themealdb.com/images/media/meals/40r49m1763197022.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52813"},
{"meal_name": "Pad See Ew", "category": "Chicken", "tags": "Pasta", "ingredients": ["rice stick noodles (6oz/180g)", "dark soy sauce (2 tbsp)", "oyster sauce (2 tbsp)", "soy sauce (2 tsp)", "white vinegar (2 tsp)", "sugar (2 tsp)", "water (2 tbsp)", "peanut oil (2 tbsp)", "garlic (2 cloves)", "Chicken (1 cup)", "Egg (1)", "Chinese broccoli (4 cups)"], "instructions": "Mix Sauce in small bowl.\r\nMince garlic into wok with oil. Place over high heat, when hot, add chicken and Chinese broccoli stems, cook until chicken is light golden.\r\nPush to the side of the wok, crack egg in and scramble. Don't worry if it sticks to the bottom of the wok - it will char and which adds authentic flavour.\r\nAdd noodles, Chinese broccoli leaves and sauce. Gently mix together until the noodles are stained dark and leaves are wilted. Serve immediately!", "image_url": "https://www.themealdb.com/images/media/meals/uuuspp1468263334.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52774"},
{"meal_name": "Nutty Chicken Curry", "category": "Chicken", "tags": null, "ingredients": ["Red Chilli (1 large)", "Ginger (0.5)", "Garlic (1 large)", "Coriander (Bunch)", "Sunflower Oil (1 tbsp)", "Chicken Breasts (4)", "Peanut Butter (5 tblsp)", "Chicken Stock (150ml)", "Greek Yogurt (200g)"], "instructions": "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato.", "image_url": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52851"},
{"meal_name": "General Tsos Chicken", "category": "Chicken", "tags": null, "ingredients": ["Chicken Breast (1 1/2)", "Plain Flour (3/4 cup)", "Egg (1)", "Starch (2 tbs)", "Baking Powder (1 tbs)", "Salt (1 tsp)", "Onion Salt (1/2 tsp)", "Garlic Powder (1/4 tsp)", "Water (3/4 cup)", "Chicken Stock (1/2 cup)", "Duck Sauce (1/4 cup)", "Soy Sauce (3 tbs)", "Honey (2 tbs)", "Rice Vinegar (1 tbs)", "Sesame Seed Oil (2 tbs)", "Gochujang (1/2 tbs)", "Starch (2 tbs)", "Garlic (1 clove)", "Spring Onions (2 chopped)", "Ginger (1 tsp)"], "instructions": "DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate", "image_url": "https://www.themealdb.com/images/media/meals/1529444113.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52951"},
{"meal_name": "Kung Pao Chicken", "category": "Chicken", "tags": null, "ingredients": ["Sake (2 tbs)", "Soy Sauce (2 tbs)", "Sesame Seed Oil (2 tbs)", "Corn Flour (2 tbs)", "Water (2 tbs)", "Chicken (500g)", "Chilli Powder (1 tbs)", "Rice Vinegar (1 tsp)", "Brown Sugar (1 tbs)", "Spring Onions (4 Chopped)", "Garlic Clove (6 cloves)", "Water Chestnut (220g)", "Peanuts (100g)"], "instructions": "Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.", "image_url": "https://www.themealdb.com/images/media/meals/1525872624.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52945"},
{"meal_name": "kabse", "category": "Chicken", "tags": null, "ingredients": ["Chicken (400g)", "Rice (1 cup)", "Green Pepper (1)", "Red Pepper (1)", "Mushrooms (2)", "Sweetcorn (1)", "Carrots (2)", "Raisins (Handful)", "Turmeric (1 tsp)", "Kabse Spice (1 tsp)", "Salt (Pinch)", "Black Pepper (Pinch)"], "instructions": "1\r\nCaramelize the chicken with olive oil then add a maggi cube and boil it for around 30 minutes.\r\n2\r\nIn another pot, add all the veggies and caramelize them till they are soft.\r\n3\r\nOnce everything is done, add the rice, raisins & spices to the veggies and add 2 and a half cups of water for the rice to cook.\r\n4\r\nOnce the rice is done put everything in the oven.", "image_url": "https://www.themealdb.com/images/media/meals/utqnjv1763598650.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53220"},
{"meal_name": "Jerk chicken with rice & peas", "category": "Chicken", "tags": "Chilli,Curry", "ingredients": ["Chicken Thighs (12)", "Lime (1/2)", "Spring Onions (1  bunch)", "Ginger (1 tbs chopped)", "Garlic (3 cloves)", "Onion (1/2)", "Red Chilli (3 chopped)", "Thyme (1/2 teaspoon)", "Lime (Juice of 1)", "Soy Sauce (2 tbs)", "Vegetable Oil (2 tbs)", "Brown Sugar (3 tbs)", "Allspice (1 tbs)", "Basmati Rice (200g)", "Coconut Milk (400g)", "Spring Onions (1  bunch)", "Thyme (2 sprigs)", "Garlic (2 cloves chopped)", "Allspice (1 tbs)", "Kidney Beans (800g)"], "instructions": "To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.\r\n\r\nTaste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.\r\n\r\nMake a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.\r\n\r\nIf you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.\r\n\r\nWhile the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.\r\n\r\nAdd the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy.", "image_url": "https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52937"},
{"meal_name": "Katsu Chicken curry", "category": "Chicken", "tags": "Curry,Meat", "ingredients": ["chicken breast (4 pounded to 1cm thickness)", "plain flour (2 tablespoons)", "egg (1 beaten)", "breadcrumbs (100g fine)", "vegetable oil (230ml frying)", "sunflower oil (2 tablespoons)", "onions (2 sliced)", "garlic (5 chopped cloves)", "carrot (2 sliced)", "plain flour (2 tablespoons)", "curry powder (4 teaspoons)", "chicken stock (600ml)", "honey (2 teaspoons)", "soy sauce (4 teaspoons)", "bay leaf (1)", "garam masala (1 teaspoon)"], "instructions": "Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.\r\nAdd flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.\r\nTurn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.\r\nFor the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.\r\nHeat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.\r\nPour curry sauce over chicken, serve with white rice and enjoy!", "image_url": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52820"},
{"meal_name": "Honey Balsamic Chicken with Crispy Broccoli & Potatoes", "category": "Chicken", "tags": null, "ingredients": ["Potatoes (5)", "Broccoli (1)", "Garlic (2 cloves)", "Chicken Breast (2)", "Balsamic Vinegar", "Honey", "Chicken Stock", "Butter (1 tbsp)", "Vegetable Oil (1 tbsp)", "Olive Oil (1 tbsp)"], "instructions": "2 Servings\r\n\r\n1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Toss on one side of a baking sheet with a drizzle of oil, salt, and pepper. (For 4 servings, spread potatoes out across entire sheet.) Roast on top rack for 5 minutes (we'll add the broccoli then). \r\n\r\n2. Meanwhile, cut broccoli florets into bite-size pieces, if necessary. Peel and finely chop garlic. In a small microwave-safe bowl, combine 1 TBSP olive oil (2 TBSP for 4 servings) and half the garlic. Microwave until garlic sizzles, 30 seconds. \r\n\r\n3. Once potatoes have roasted 5 minutes, remove sheet from oven and add broccoli to empty side; carefully toss with garlic oil, salt, and pepper. (For 4 servings, add broccoli to a second sheet.) Continue roasting until potatoes and broccoli are browned and crispy, 15-20 minutes more. \r\n\r\n4. While veggies roast, pat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. (If chicken browns too quickly, reduce heat to medium.) Turn off heat; set chicken aside to rest. Wash out pan. \r\n\r\n5. Heat pan used for chicken over medium-high heat. Add a drizzle of oil and remaining garlic; cook until fragrant, 30 seconds. Stir in vinegar, honey, stock concentrate, and 1/4 cup water (1/3 cup for 4 servings). Simmer until thick and glossy, 2-3 minutes. Remove from heat and stir in 1 TBSP butter (2 TBSP for 4). Season with salt and pepper. \r\n\r\n6. Return chicken to pan and turn to coat in glaze. Divide chicken, broccoli, and potatoes between plates. Spoon any remaining glaze over chicken and serve. ", "image_url": "https://www.themealdb.com/images/media/meals/kvbotn1581012881.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52993"},
{"meal_name": "Carrot Cake", "category": "Dessert", "tags": "Cake,Treat,Sweet", "ingredients": ["Vegetable Oil (450ml)", "Plain Flour (400g)", "Bicarbonate Of Soda (2 tsp)", "Sugar (550ml)", "Eggs (5)", "Salt (½ tsp)", "Cinnamon (2 tsp)", "Carrots (500g grated)", "Walnuts (150g)", "Cream Cheese (200g)", "Caster Sugar (150g)", "Butter (100g)"], "instructions": "For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cake tin.\r\nMix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts.\r\nSpoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack.\r\nMeanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife.", "image_url": "https://www.themealdb.com/images/media/meals/vrspxv1511722107.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52897"},
{"meal_name": "Canadian Butter Tarts", "category": "Dessert", "tags": "Speciality,Snack,Desert,Pudding", "ingredients": ["Shortcrust Pastry (375g)", "Eggs (2 large)", "Muscovado Sugar (175g)", "Raisins (100g)", "Vanilla Extract (1 tsp)", "Butter (50g)", "Single Cream (4 tsp)", "Walnuts (50g)"], "instructions": "Preheat the oven to fan 170C/ conventional 190C/gas 5. Roll out the pastry on a lightly floured surface so it’s slightly thinner than straight from the pack. Then cut out 18-20 rounds with a 7.5cm fluted cutter, re-rolling the trimmings. Use the rounds to line two deep 12-hole tart tins (not muffin tins). If you only have a regular-sized, 12-hole tart tin you will be able to make a few more slightly shallower tarts.\r\nBeat the eggs in a large bowl and combine with the rest of the ingredients except the walnuts. Tip this mixture into a pan and stir continuously for 3-4 minutes until the butter melts, and the mixture bubbles and starts to thicken. It should be thick enough to coat the back of a wooden spoon. Don’t overcook, and be sure to stir all the time as the mixture can easily burn. Remove from the heat and stir in the nuts.\r\nSpoon the filling into the unbaked tart shells so it’s level with the pastry. Bake for 15-18 minutes until set and pale golden. Leave in the tin to cool for a few minutes before lifting out on to a wire rack. Serve warm or cold.", "image_url": "https://www.themealdb.com/images/media/meals/wpputp1511812960.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52923"},
{"meal_name": "Chelsea Buns", "category": "Dessert", "tags": "Bun,Baking,Treat", "ingredients": ["White Flour (500g)", "Salt (1 tsp)", "Yeast (7g)", "Milk (300ml)", "Butter (40g)", "Eggs (1)", "Vegetable Oil (Dash)", "Butter (25g)", "Brown Sugar (75g)", "Cinnamon (2 tsp)", "Dried Fruit (150g)", "Milk (2 tbs)", "Caster Sugar (2 tbs)"], "instructions": "Sift the flour and salt into a large bowl. Make a well in the middle and add the yeast.\r\nMeanwhile, warm the milk and butter in a saucepan until the butter melts and the mixture is lukewarm.\r\nAdd the milk mixture and egg to the flour mixture and stir until the contents of the bowl come together as a soft dough. (You may need to add a little extra flour.)\r\nTip the dough onto a generously floured work surface. Knead for five minutes, adding more flour if necessary, until the dough is smooth and elastic and no longer feels sticky.\r\nLightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.\r\nLightly grease a baking tray.\r\nFor the filling, knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a rectangle 0.5cm/¼in thick. Brush all over with the melted butter, then sprinkle over the brown sugar, cinnamon and dried fruit.\r\nRoll the dough up into a tight cylinder , cut ten 4cm/1½in slice and place them onto a lightly greased baking sheet, leaving a little space between each slice. Cover with a tea towel and set aside to rise for 30 minutes.\r\nPreheat oven to 190C/375F/Gas 5.\r\nBake the buns in the oven for 20-25 minutes, or until risen and golden-brown.\r\nMeanwhile, for the glaze, heat the milk and sugar in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes.\r\nRemove the buns from the oven and brush with the glaze, then set aside to cool on a wire rack.", "image_url": "https://www.themealdb.com/images/media/meals/vqpwrv1511723001.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52898"},
{"meal_name": "Cashew Ghoriba Biscuits", "category": "Dessert", "tags": null, "ingredients": ["Cashew Nuts (250g)", "Icing Sugar (100g)", "Egg Yolks (2)", "Orange Blossom Water (2 tbs)", "Icing Sugar (To Glaze)", "Almonds (100g)"], "instructions": "Preheat the oven at 180 C / Gas 4. Line a baking tray with greaseproof paper.\r\nIn a bowl, mix the cashews and icing sugar. Add the egg yolks and orange blossom water and mix to a smooth homogeneous paste.\r\nTake lumps of the cashew paste and shape into small balls. Roll the balls in icing sugar and transfer to the baking tray. Push an almond in the centre of each ghribia.\r\nBake until the biscuits are lightly golden, about 20 minutes. Keep an eye on them, they burn quickly.", "image_url": "https://www.themealdb.com/images/media/meals/t3r3ka1560461972.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52976"},
{"meal_name": "Bread and Butter Pudding", "category": "Dessert", "tags": "Pudding,Brunch", "ingredients": ["butter (25g/1oz)", "bread (8 thin slices)", "sultanas (50g/2oz)", "cinnamon (2 tsp)", "milk (350ml/12fl)", "double cream (50ml/2fl oz)", "eggs (2 free-range)", "sugar (25g/1oz)", "nutmeg (grated, to taste)"], "instructions": "Grease a 1 litre/2 pint pie dish with butter.\r\nCut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.\r\nArrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.\r\nGently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.\r\nCrack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.\r\nAdd the warm milk and cream mixture and stir well, then strain the custard into a bowl.\r\nPour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.\r\nPreheat the oven to 180C/355F/Gas 4.\r\nPlace the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown.", "image_url": "https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52792"},
{"meal_name": "Budino Di Ricotta", "category": "Dessert", "tags": "Cake,Baking,Desert,Sweet,Alcoholic,Calorific", "ingredients": ["Ricotta (500g)", "Eggs (4 large)", "Flour (3 tbs)", "Sugar (250g)", "Cinnamon (1 tsp)", "Lemons (Grated Zest of 2)", "Dark Rum (5 tbs)", "Icing Sugar (sprinking)"], "instructions": "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.\r\n\r\nServe hot or cold dusted with icing sugar.", "image_url": "https://www.themealdb.com/images/media/meals/1549542877.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52961"},
{"meal_name": "Blueberry & lemon friands", "category": "Dessert", "tags": null, "ingredients": ["Unsalted Butter (100g)", "Icing Sugar (125g)", "Flour (25g)", "Almonds (85g)", "Egg White (3)", "Unwaxed Lemon (1)", "Blackberries (85g)"], "instructions": "step 1\r\nPreheat the oven to fan 180C/conventional 200C/gas 6. Generously butter six non-stick friand or muffin tins. Melt the butter and set aside to cool.\r\n\r\nstep 2\r\nSift the icing sugar and flour into a bowl. Add the almonds and mix everything between your fingers.\r\n\r\nstep 3\r\nWhisk the egg whites in another bowl until they form a light, floppy foam. Make a well in the centre of the dry ingredients, tip in the egg whites and lemon rind, then lightly stir in the butter to form a soft batter.\r\n\r\nstep 4\r\nDivide the batter among the tins, a large serving spoon is perfect for this job. Sprinkle a handful of blueberries over each cake and bake for 15-20 minutes until just firm to the touch and golden brown.\r\n\r\nstep 5\r\nCool in the tins for 5 minutes, then turn out and cool on a wire rack. To serve, dust lightly with icing sugar.", "image_url": "https://www.themealdb.com/images/media/meals/e756bf1761848342.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53100"},
{"meal_name": "Blackberry Fool", "category": "Dessert", "tags": "Desert,Summer,Fruity,Dairy", "ingredients": ["Hazlenuts (50g)", "Butter (125g)", "Caster Sugar (150g)", "Lemon (Grated)", "Plain Flour (150g)", "Baking Powder (½ tsp)", "Blackberries (600g)", "Sugar (75g)", "Caster Sugar (2 tbs)", "Lemon Juice (1 tbs)", "Double Cream (300ml)", "Yogurt (100ml)", "Mint (Garnish with)"], "instructions": "For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.\r\nPut the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.\r\nDivide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading.\r\nPress the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.\r\nStore in an airtight tin and eat within five days.\r\nFor the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar.\r\nStir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.\r\nSimmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée.\r\nPut the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far.\r\nWhen the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined.\r\nSpoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits.", "image_url": "https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52891"},
{"meal_name": "Battenberg Cake", "category": "Dessert", "tags": "Cake,Sweet", "ingredients": ["Butter (175g)", "Caster Sugar (175g)", "Self-raising Flour (140g)", "Almonds (50g)", "Baking Powder (½ tsp)", "Eggs (3 Medium)", "Vanilla Extract (½ tsp)", "Almond Extract (¼ teaspoon)", "Butter (175g)", "Caster Sugar (175g)", "Self-raising Flour (140g)", "Almonds (50g)", "Baking Powder (½ tsp)", "Eggs (3 Medium)", "Vanilla Extract (½ tsp)", "Almond Extract (¼ teaspoon)", "Pink Food Colouring (½ tsp)", "Apricot (200g)", "Marzipan (1kg)", "Icing Sugar (Dusting)"], "instructions": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.", "image_url": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52894"},
{"meal_name": "Beetroot pancakes", "category": "Dessert", "tags": null, "ingredients": ["Beetroot (3)", "Milk (50 ml)", "Self-raising Flour (200g)", "Baking Powder (1 tsp)", "Maple Syrup (2 tablespoons)", "Vanilla Extract (1/2 teaspoon)", "Egg (3)", "Butter (25g)", "Frozen Mixed Berries (200g)", "Blackcurrant Jam (2 tablespoons)", "Greek Yogurt (100g)"], "instructions": "step 1\r\nPut the beetroot in a jug with the milk and blend with a stick blender until smooth. Pour into a bowl with the rest of the pancake ingredients and whisk until smooth and vibrant purple.\r\n\r\nstep 2\r\nPut a small knob of butter in a large non-stick frying pan and heat over a medium-low heat until melted and foamy. Now create 3 or 4 pancakes each made from 2 tbsp of the batter. Cook for 2-3 mins then flip over and cook for a further minute until cooked through. Repeat with any remaining batter. Heat oven to lowest setting and keep the pancakes warm in there until needed.\r\n\r\nstep 3\r\nServe with your favourite pancake toppings or make a simple compote by simmering frozen berries in with 1 tbsp blackcurrant jam until bubbling and syrupy (about 5-10 mins). In a small bowl stir together the remaining jam and the yogurt. Stack the cooked pancakes with the yogurt and pour the warm berry compote over the top.", "image_url": "https://www.themealdb.com/images/media/meals/xlqqhw1764369924.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53316"},
{"meal_name": "BeaverTails", "category": "Dessert", "tags": "Treat,Pudding,Speciality", "ingredients": ["Water (1/2 cup)", "Yeast (2 parts)", "Sugar (1/2 cup)", "Milk (1/2 cup)", "Butter (6 tblsp)", "Eggs (2)", "Salt (1 ½ tsp)", "Flour (2-1/2 cups)", "Oil (for frying)", "Lemon (garnish)", "Sugar (garnish)", "Cinnamon (garnish)"], "instructions": "In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r\nInto the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r\nPlace a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r\nPlace dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r\nCut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r\nIn a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r\nDrain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!", "image_url": "https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52928"},
{"meal_name": "Baklava with spiced nuts, ricotta & chocolate", "category": "Dessert", "tags": null, "ingredients": ["Sugar (500g)", "Lemon Juice (To taste)", "Walnuts (300g)", "Pecan Nuts (200g)", "Almonds (100g)", "Ground Cinnamon (2 tablespoons)", "Ground Cardomom (1 tablespoon)", "Ricotta (500g)", "Lemon (Zest of 1)", "Orange (Zest of 1)", "Vanilla Bean Paste (1 tablespoon)", "Unsalted Butter (250g)", "Filo Pastry (500g)", "Ground Pistachios (100g)"], "instructions": "step 1\r\nFirst, make the syrup. Tip the sugar into a large saucepan with 650ml water. Stir over a low heat until the sugar has dissolved, then turn up the heat and bring to the boil. Reduce the heat to a simmer and cook for 15 mins, then squeeze in a few drops of lemon juice and simmer for a further 5 mins. Remove from the heat and leave to cool. Meanwhile, for assembling the baklava later, melt the butter in a small pan over a low heat for 5 mins, skimming and discarding any froth that rises to the surface.\r\n\r\nstep 2\r\nFor the filling, crush all of the nuts in a pestle and mortar, or blitz in a food processor – you want a mixture of finely ground nuts with a few chunky pieces. Tip into a bowl, stir through the spices and set aside.\r\n\r\nstep 3\r\nIn a separate bowl, mix the ricotta with the lemon and orange zests and vanilla. Heat the oven to 180C/160C fan/gas 4. Brush the bottom of a large baking tray (about 35 x 47cm) with some of the melted butter. Working with one sheet of filo at a time (covering the rest with a damp tea towel to prevent it drying out), lay the sheet out on a board so one of the short ends is facing you. Sprinkle 30g of the nut mixture evenly over the whole sheet, then spoon 1 tbsp of the ricotta mixture across the end closest to you. Fold this end over to enclose the filling, then lay a long, thin skewer next to the folded edge and roll the pastry around it to create a long roll. When it’s fully rolled up, it should be roughly the thickness of a chipolata sausage. While holding one end of the rolling pin or skewer, gently scrunch the filo roll like an accordion and carefully push it off the skewer and onto the prepared tray. Repeat with the rest of the filo and fillings – you should get about 12 rolls. Cut each roll into four to make 48 large baklava, or eight to make 96 mini.\r\n\r\nstep 4\r\nBrush with the remaining melted butter. Bake for 20-25 mins until evenly golden, turning the tray around halfway through. While still hot, immediately pour over 5-6 ladlefuls of the syrup. You should hear the syrup sizzle as it hits the hot baklava. Set aside to cool and absorb.\r\n\r\nstep 5\r\nMelt the dark chocolate in a heatproof bowl set over a pan of simmering water, ensuring the bowl doesn’t touch the water, or in the microwave in short bursts. Drizzle this over the cooled baklava and sprinkle with the ground pistachios.", "image_url": "https://www.themealdb.com/images/media/meals/ytme8t1764111401.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53279"},
{"meal_name": "Banana Pancakes", "category": "Dessert", "tags": "Breakfast,Desert,Sweet", "ingredients": ["Banana (1 large)", "Eggs (2 medium)", "Baking Powder (pinch)", "Vanilla Extract (spinkling)", "Oil (1 tsp)", "Pecan Nuts (25g)", "Raspberries (125g)"], "instructions": "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.", "image_url": "https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52855"},
{"meal_name": "Apricot & Turkish delight mess", "category": "Dessert", "tags": null, "ingredients": ["Mascarpone (100g)", "Greek Yogurt (50g)", "Icing Sugar (25g)", "Orange Blossom Water (2 tablespoons)", "Meringue Nests (1)", "Apricot (3)", "Turkish Delight (2 pieces)", "Almonds (25g)", "Mint (4)"], "instructions": "step 1\r\nPlace the mascarpone, yogurt, sugar and orange flower water into a large bowl and whisk until thickened. Fold the remaining ingredients through, then divide the mix between 2 dessert glasses or bowls and decorate with extra mint, if you like.", "image_url": "https://www.themealdb.com/images/media/meals/p277uc1764109195.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53276"},
{"meal_name": "Authentic Norwegian Kransekake", "category": "Dessert", "tags": null, "ingredients": ["Almonds (3 Cups)", "Egg White (4)", "Powdered Sugar (4 cups)", "Powdered Sugar (2 cups)", "Egg White (1)", "Lemon Juice (1/2 teaspoon)"], "instructions": "Grind almonds in an almond grinder or food processor.\r\n▢\r\nMix almonds and powdered sugar together in a large mixing bowl. Add three of the egg whites and knead the dough together with your hands until it comes together in a ball. Wrap in cling film and leave in the fridge for at least an hour, preferably until the next day.\r\n▢\r\nGrease the kransekake forms thoroughly and coat with semolina, flour, or bread crumbs.\r\n▢\r\nPreheat oven to 210°C (410°F) top and bottom heat. Divide the dough into six sections.\r\n▢\r\nSlowly add the remaining egg white to the dough and knead it until you can roll it into long sausages about as thick as your index finger. Fill the forms with the dough sausages, pinching the ends together to make rings.\r\n▢\r\nSet the forms on a baking sheet and back in the middle of the oven for about 10 – 12 minutes, until the tops are golden brown.", "image_url": "https://www.themealdb.com/images/media/meals/yk78uc1763075719.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53127"},
{"meal_name": "Bakewell tart", "category": "Dessert", "tags": "Tart,Baking,Alcoholic", "ingredients": ["plain flour (175g/6oz)", "chilled butter (75g/2½oz)", "cold water (2-3 tbsp)", "raspberry jam (1 tbsp)", "butter (125g/4½oz)", "caster sugar (125g/4½oz)", "ground almonds (125g/4½oz)", "free-range egg, beaten (1)", "almond extract (½ tsp)", "flaked almonds (50g/1¾oz)"], "instructions": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.", "image_url": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52767"},
{"meal_name": "Apam balik", "category": "Dessert", "tags": null, "ingredients": ["Milk (200ml)", "Oil (60ml)", "Eggs (2)", "Flour (1600g)", "Baking Powder (3 tsp)", "Salt (1/2 tsp)", "Unsalted Butter (25g)", "Sugar (45g)", "Peanut Butter (3 tbs)"], "instructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.", "image_url": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53049"},
{"meal_name": "Æbleskiver", "category": "Dessert", "tags": null, "ingredients": ["Flour (2 cups)", "Salt (1 teaspoon)", "Granulated Sugar (2 tblsp)", "Baking Powder (1 teaspoon)", "Cardamom (1/2 teaspoon)", "Egg (3)", "Buttermilk (2 cups)", "Butter (For Greasing)", "Powdered Sugar (Sprinkling)", "Raspberry Jam (1 scoop)"], "instructions": "Whisk the flour, salt, sugar, baking soda, and cardamom together in a large bowl.\r\n▢\r\nSeparate the eggs and add the egg yolks to the flour mixture. Pour in the buttermilk (or cultured milk) and whisk the batter together until smooth. Cover and refrigerate for about 30 minutes.\r\n▢\r\nUse a hand (or stand) mixer to beat the egg whites until stiff. Carefully fold into the æbleskiver batter.\r\n▢\r\nHeat the pan on medium heat. Once hot, brush the pan with butter and fill each æbleskive hole almost full with the batter.\r\n▢\r\nOnce the edges become firm use a knitting needle or wooden skewer to turn the æbleskiver about 1/4. Continue turning until you get round pancake spheres. They should be golden brown.\r\n▢\r\nRemove the æbleskiver from the pan and serve with powdered sugar and jam.", "image_url": "https://www.themealdb.com/images/media/meals/wkhg581762773124.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53120"},
{"meal_name": "Anzac biscuits", "category": "Dessert", "tags": null, "ingredients": ["Porridge oats (85g)", "Desiccated Coconut (85g)", "Plain Flour (100g)", "Caster Sugar (100g)", "Butter (100g)", "Golden Syrup (1 tblsp)", "Bicarbonate Of Soda (1 teaspoon)"], "instructions": "step 1\r\nHeat oven to 180C/fan 160C/gas 4. Put the oats, coconut, flour and sugar in a bowl. Melt the butter in a small pan and stir in the golden syrup. Add the bicarbonate of soda to 2 tbsp boiling water, then stir into the golden syrup and butter mixture.\r\n\r\nstep 2\r\nMake a well in the middle of the dry ingredients and pour in the butter and golden syrup mixture. Stir gently to incorporate the dry ingredients.\r\n\r\nstep 3\r\nPut dessertspoonfuls of the mixture on to buttered baking sheets, about 2.5cm/1in apart to allow room for spreading. Bake in batches for 8-10 mins until golden. Transfer to a wire rack to cool.", "image_url": "https://www.themealdb.com/images/media/meals/q47rkb1762324620.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53111"},
{"meal_name": "Apple & Blackberry Crumble", "category": "Dessert", "tags": "Pudding", "ingredients": ["Plain Flour (120g)", "Caster Sugar (60g)", "Butter (60g)", "Braeburn Apples (300g)", "Butter (30g)", "Demerara Sugar (30g)", "Blackberries (120g)", "Cinnamon (¼ teaspoon)", "Ice Cream (to serve)"], "instructions": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.", "image_url": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52893"},
{"meal_name": "Alfajores", "category": "Dessert", "tags": null, "ingredients": ["All purpose flour (300g)", "Cornstarch (200g)", "Butter (200g)", "Sugar (100g)", "Egg Yolks (2)", "Lemon Zest (1 teaspoon)", "Dulce de leche", "Desiccated Coconut (Sprinkling)"], "instructions": "Make the Dough: Cream butter and sugar. Add egg yolks and lemon zest. Gradually mix in flour and cornstarch to form a dough. Chill for 1 hour.\r\nBake the Cookies: Roll out the dough, cut into circles, and bake at 180°C (350°F) for 12-15 minutes. Let cool.\r\nAssemble: Spread dulce de leche on one cookie, then sandwich with another. Roll the edges in coconut flakes.\r\nPro Tips:\r\n\r\nChill the dough before rolling it out to make it easier to handle and to prevent the cookies from spreading too much while baking.\r\nDip the alfajores in melted chocolate and let them set on a wire rack for an extra decadent treat.", "image_url": "https://www.themealdb.com/images/media/meals/a4kgf21763075288.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53138"},
{"meal_name": "Apple Frangipan Tart", "category": "Dessert", "tags": "Tart,Baking,Fruity", "ingredients": ["digestive biscuits (175g/6oz)", "butter (75g/3oz)", "Bramley apples (200g/7oz)", "Salted Butter (75g/3oz)", "caster sugar (75g/3oz)", "free-range eggs, beaten (2)", "ground almonds (75g/3oz)", "almond extract (1 tsp)", "flaked almonds (50g/1¾oz)"], "instructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.", "image_url": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52768"},
{"meal_name": "Beef stroganoff", "category": "Beef", "tags": null, "ingredients": ["Olive Oil (1 tbls)", "Onions (1)", "Garlic (1 clove)", "Butter (1 tbsp)", "Mushrooms (250g)", "Beef Fillet (500g)", "Plain Flour (1tbsp)", "Creme Fraiche (150g)", "English Mustard (1 tbsp)", "Beef Stock (100ml)", "Parsley (Topping)"], "instructions": "Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.\r\nTip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice.", "image_url": "https://www.themealdb.com/images/media/meals/svprys1511176755.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52834"},
{"meal_name": "Beef pho", "category": "Beef", "tags": null, "ingredients": ["Beef Stock (1 L)", "Onion (1 large)", "Ginger (1 Large Chopped)", "Cinnamon Stick (1)", "Star Anise (2)", "Coriander Seeds (1 tsp)", "Cloves (1/2 teaspoon)", "Sirloin steak (225g)", "Palm Sugar (1 tsp)", "Fish Sauce (1 tablespoon)", "Soy Sauce (1 ½ tbsp)", "Rice Noodles (200g)", "Spring Onions (2 sliced)", "Birds-eye Chillies (1 small)", "Basil (Handful)", "Coriander (Handful)", "Lime (1)"], "instructions": "step 1\r\nTip the beef stock along with 500ml of water into a large saucepan. Sit the onion and ginger in a frying pan over a high heat and char on all sides, around 3-5 mins (you can also do this under your grill). Once charred, add to the beef stock. In the same pan, toast the spices for 2-3 mins and once they begin to smell fragrant, add them to the beef stock as well. Bring the stock to the boil, then turn to a simmer and cook for 30mins before straining.\r\n\r\nstep 2\r\nMeanwhile, cut the fat from the steak and wrap in cling film, then put into the freezer for 15 mins – this will make your steak really easy to slice! Slice it thinly, then cover with cling film again and pop into the fridge.\r\n\r\nstep 3\r\nTaste the beef stock and use the palm sugar, fish sauce and soy to season. Cook the noodles according to package instructions and split between two bowls, topping each with the sliced beef. Bring the stock to the boil and then pour into the bowls (the heat will cook the beef). Top each with the spring onions, chilli slices and herbs. Serve with the lime wedges to squeeze over.", "image_url": "https://www.themealdb.com/images/media/meals/pbzcrx1763765096.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53238"},
{"meal_name": "Beef Rendang", "category": "Beef", "tags": null, "ingredients": ["Beef (1lb)", "Vegetable Oil (5 tbs)", "Cinnamon Stick (1)", "Cloves (3)", "Star Anise (3)", "Cardamom (3)", "Coconut Cream (1 cup)", "Water (1 cup)", "Tamarind Paste (2 tbs)", "Lime (6)", "Sugar (1 tbs)", "Challots (5)"], "instructions": "Chop the spice paste ingredients and then blend it in a food processor until fine.\r\nHeat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.\r\nLower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight.", "image_url": "https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53053"},
{"meal_name": "Beef Mechado", "category": "Beef", "tags": "Stew,Warming", "ingredients": ["Garlic (3 cloves)", "Onion (1 sliced)", "Beef (2 Lbs)", "Tomato Puree (8 ounces)", "Water (1 cup)", "Olive Oil (3 tbs)", "Lemon (1 Slice)", "Potatoes (1 large)", "Soy Sauce (1/4 cup)", "Black Pepper (1/2 tsp)", "Bay Leaves (2)", "Salt (To taste)"], "instructions": "0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r\n1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r\n2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r\n3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r\n4.\tTransfer to a serving plate. Serve with Saffron rice.\r\n5.\tShare and enjoy!\r\n", "image_url": "https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53068"},
{"meal_name": "Beef Lo Mein", "category": "Beef", "tags": null, "ingredients": ["Beef (1/2 lb)", "Salt (pinch)", "Pepper (pinch)", "Sesame Seed Oil (2 tsp)", "Egg (1/2)", "Starch (3 tbs)", "Oil (5 tbs)", "Noodles (1/4 lb)", "Onion (1/2 cup)", "Minced Garlic (1 tsp)", "Ginger (1 tsp)", "Bean Sprouts (1 cup)", "Mushrooms (1 cup)", "Water (1 cup)", "Oyster Sauce (1 tbs)", "Sugar (1 tsp)", "Soy Sauce (1 tsp)"], "instructions": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.\r\nSTEP 2 - BOILING THE THE NOODLES\r\nIn a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.\r\nSTEP 3 - STIR FRY\r\nAdd 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.\r\nSet the cooked beef aside\r\nIn a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.\r\nAdd the noodles to wok\r\nTo make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.\r\nNext add the beef to wok and stir-fry", "image_url": "https://www.themealdb.com/images/media/meals/1529444830.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52952"},
{"meal_name": "Beef Dumpling Stew", "category": "Beef", "tags": "Stew,Baking", "ingredients": ["Olive Oil (2 tbs)", "Butter (25g)", "Beef (750g)", "Plain Flour (2 tblsp)", "Garlic (2 cloves minced)", "Onions (175g)", "Celery (150g)", "Carrots (150g)", "Leek (2 chopped)", "Swede (200g)", "Red Wine (150ml)", "Beef Stock (500g)", "Bay Leaf (2)", "Thyme (3 tbs)", "Parsley (3 tblsp chopped)", "Plain Flour (125g)", "Baking Powder (1 tsp)", "Suet (60g)", "Water (Splash)"], "instructions": "Preheat the oven to 180C/350F/Gas 4.\r\n\r\nFor the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.\r\n\r\nSprinkle over the flour and cook for a further 2-3 minutes.\r\n\r\nAdd the garlic and all the vegetables and fry for 1-2 minutes.\r\n\r\nStir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.\r\n\r\nCover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.\r\n\r\nFor the dumplings, sift the flour, baking powder and salt into a bowl.\r\nAdd the suet and enough water to form a thick dough.\r\n\r\nWith floured hands, roll spoonfuls of the dough into small balls.\r\n\r\nAfter two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)\r\n\r\nTo serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley.", "image_url": "https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52873"},
{"meal_name": "Beef Caldereta", "category": "Beef", "tags": null, "ingredients": ["Beef (2kg cut cubes)", "Beef Stock (1)", "Soy Sauce (1 tbs)", "Water (2 cups)", "Green Pepper (1 sliced)", "Red Pepper (1 sliced)", "Potatoes (1 sliced)", "Carrots (1 sliced)", "Tomato Puree (8 ounces)", "Peanut Butter (3  tablespoons)", "Chilli Powder (5)", "Onion (1 chopped)", "Garlic (5 cloves)", "Olive Oil (3 tbs)"], "instructions": "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens\r\n1.\tAdd beef. Saute until the outer part turns light brown.\r\n2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.\r\n3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.\r\n4.\tPan-fry carrot and potato until it browns. Set aside.\r\n5.\tAdd chili pepper, liver spread and peanut butter. Stir.\r\n6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.\r\n7.\tSeason with salt and ground black pepper. Serve.\r\n", "image_url": "https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53070"},
{"meal_name": "Beef Bourguignon", "category": "Beef", "tags": null, "ingredients": ["Goose Fat (3 tsp)", "Beef Shin (600g)", "Bacon (100g)", "Challots (350g)", "Chestnut Mushroom (250g)", "Garlic Clove (2 sliced)", "Bouquet Garni (1)", "Tomato Puree (1 tbs)", "Red Wine (750 ml)", "Celeriac (600g)", "Olive Oil (2 tbs)", "Thyme (sprigs of fresh)", "Rosemary (sprigs of fresh)", "Bay Leaf (2)", "Cardamom (4)"], "instructions": "Heat a large casserole pan and add 1 tbsp goose fat. Season the beef and fry until golden brown, about 3-5 mins, then turn over and fry the other side until the meat is browned all over, adding more fat if necessary. Do this in 2-3 batches, transferring the meat to a colander set over a bowl when browned.\r\nIn the same pan, fry the bacon, shallots or pearl onions, mushrooms, garlic and bouquet garni until lightly browned. Mix in the tomato purée and cook for a few mins, stirring into the mixture. This enriches the bourguignon and makes a great base for the stew. Then return the beef and any drained juices to the pan and stir through.\r\nPour over the wine and about 100ml water so the meat bobs up from the liquid, but isn’t completely covered. Bring to the boil and use a spoon to scrape the caramelised cooking juices from the bottom of the pan – this will give the stew more flavour.\r\nHeat oven to 150C/fan 130C/gas 2. Make a cartouche: tear off a square of foil slightly larger than the casserole, arrange it in the pan so it covers the top of the stew and trim away any excess foil. Then cook for 3 hrs. If the sauce looks watery, remove the beef and veg with a slotted spoon, and set aside. Cook the sauce over a high heat for a few mins until the sauce has thickened a little, then return the beef and vegetables to the pan.\r\nTo make the celeriac mash, peel the celeriac and cut into cubes. Heat the olive oil in a large frying pan. Tip in the celeriac and fry for 5 mins until it turns golden. Season well with salt and pepper. Stir in the rosemary, thyme, bay and cardamom pods, then pour over 200ml water, enough to nearly cover the celeriac. Turn the heat to low, partially cover the pan and leave to simmer for 25-30 mins.\r\nAfter 25-30 mins, the celeriac should be soft and most of the water will have evaporated. Drain away any remaining water, then remove the herb sprigs, bay and cardamom pods. Lightly crush with a potato masher, then finish with a glug of olive oil and season to taste. Spoon the beef bourguignon into serving bowls and place a large spoonful of the celeriac mash on top. Garnish with one of the bay leaves, if you like.", "image_url": "https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52904"},
{"meal_name": "Beef Empanadas", "category": "Beef", "tags": null, "ingredients": ["Lard (60g)", "Water (340g)", "Salt (1 tsp)", "All purpose flour (600g)", "Tomato (3)", "Garlic (1 clove)", "Red Onions (1 large)", "Spring Onions (Bunch)", "Sirloin steak (750g)", "Dried Oregano (1 tablespoon)", "Paprika (1 tsp)", "Red Pepper Flakes (1 tsp)", "Parsley (1 tsp)", "Salt (To taste)", "Pepper (To taste)", "Egg (3)", "Egg Wash (Splash)", "Chimichurri sauce (Drizzle)"], "instructions": "For the dough place lard, warm water and salt in a large kneading bowl and stir. Add flour and oregano and either knead five miutes by hand or with the kneading function of your machine. Let rest covered for at least half an hour or overnight in the fridge.\r\n\r\n2\r\nFor the filling place tomatoes for about 30 seconds in boiling water, then cool with cold water and peel of skin and cut into cubes. Press garlic through garlic press, cut onions into cubes. Simmer garlic and onions in some olive oil until translucent. Take out onions and garlic and brown the meat at high heat from all sides. Season with all herbs and add the onions, garlic and tomatoes. Let simmer for a few minutes, add salt, pepper and additional spices to taste. You can prepare the meat the night before, chill in fridge if doing so. Boil eggs and also cut into cubes and mix with prepared meat.\r\n\r\n3\r\nCut dough into half and roll out one half thinnly on floured surface. Cut out circles about 12-15cm in diameter. Mine have a diameter of 12.5 cm. Place about 2-4 teaspoons of filling on one circle, put a bit of water all around the edges and fold over the other half so that you get half moons. Be sure to seal the edges with a fork. Repeat until you have no dough and filling left.\r\n\r\n4\r\nMeanwhile preheat oven to 200 degrees Celsius. Brush empanadas with egg wash and bake about 8 empanadas on a baking sheet lined with parchment paper for about 25min or until golden. Serve warm with chimichurri sauce.", "image_url": "https://www.themealdb.com/images/media/meals/dxpc7j1764370714.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53317"},
{"meal_name": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber", "category": "Beef", "tags": null, "ingredients": ["Rice (White)", "Onion (1)", "Lime (1)", "Garlic Clove (3)", "Cucumber (1)", "Carrots (3 oz)", "Ground Beef (1 lb)", "Soy Sauce (2 oz)"], "instructions": "Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.", "image_url": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52997"},
{"meal_name": "Beef Brisket Pot Roast", "category": "Beef", "tags": "Meat", "ingredients": ["Beef Brisket (4-5 pound)", "Salt (Dash)", "Onion (3)", "Garlic (5 cloves)", "Thyme (1 Sprig)", "Rosemary (1 sprig)", "Bay Leaves (4)", "beef stock (2 cups)", "Carrots (3 Large)", "Mustard (1 Tbsp)", "Potatoes (4 Mashed)"], "instructions": "1 Prepare the brisket for cooking: On one side of the brisket there should be a layer of fat, which you want. If there are any large chunks of fat, cut them off and discard them. Large pieces of fat will not be able to render out completely.\r\nUsing a sharp knife, score the fat in parallel lines, about 3/4-inch apart. Slice through the fat, not the beef. Repeat in the opposite direction to make a cross-hatch pattern.\r\nSalt the brisket well and let it sit at room temperature for 30 minutes.\r\n \r\n2 Sear the brisket: You'll need an oven-proof, thick-bottomed pot with a cover, or Dutch oven, that is just wide enough to hold the brisket roast with a little room for the onions.\r\nPat the brisket dry and place it, fatty side down, into the pot and place it on medium high heat. Cook for 5-8 minutes, lightly sizzling, until the fat side is nicely browned. (If the roast seems to be cooking too fast, turn the heat down to medium. You want a steady sizzle, not a raging sear.)\r\nTurn the brisket over and cook for a few minutes more to brown the other side.\r\n\r\n3 Sauté the onions and garlic: When the brisket has browned, remove it from the pot and set aside. There should be a couple tablespoons of fat rendered in the pot, if not, add some olive oil.\r\nAdd the chopped onions and increase the heat to high. Sprinkle a little salt on the onions. Sauté, stirring often, until the onions are lightly browned, 5-8 minutes. Stir in the garlic and cook 1-2 more minutes.\r\n \r\n4 Return brisket to pot, add herbs, stock, bring to simmer, cover, cook in oven: Preheat the oven to 300°F. Use kitchen twine to tie together the bay leaves, rosemary and thyme.\r\nMove the onions and garlic to the sides of the pot and nestle the brisket inside. Add the beef stock and the tied-up herbs. Bring the stock to a boil on the stovetop.\r\nCover the pot, place the pot in the 300°F oven and cook for 3 hours. Carefully flip the brisket every hour so it cooks evenly.\r\n \r\n5 Add carrots, continue to cook: After 3 hours, add the carrots. Cover the pot and cook for 1 hour more, or until the carrots are cooked through and the brisket is falling-apart tender.\r\n6 Remove brisket to cutting board, tent with foil: When the brisket is falling-apart tender, take the pot out of the oven and remove the brisket to a cutting board. Cover it with foil. Pull out and discard the herbs.\r\n7 Make sauce (optional): At this point you have two options. You can serve as is, or you can make a sauce with the drippings and some of the onions. If you serve as is, skip this step.\r\nTo make a sauce, remove the carrots and half of the onions, set aside and cover them with foil. Pour the ingredients that are remaining into the pot into a blender, and purée until smooth. If you want, add 1 tablespoon of mustard to the mix. Put into a small pot and keep warm.\r\n8 Slice the meat across the grain: Notice the lines of the muscle fibers of the roast. This is the \"grain\" of the meat. Slice the meat perpendicular to these lines, or across the grain (cutting this way further tenderizes the meat), in 1/4-inch to 1/2-inch slices.\r\nServe with the onions, carrots and gravy. Serve with mashed, roasted or boiled potatoes, egg noodles or polenta.", "image_url": "https://www.themealdb.com/images/media/meals/ursuup1487348423.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52812"},
{"meal_name": "Beef Asado", "category": "Beef", "tags": null, "ingredients": ["Beef (1.5kg)", "Beef Stock Concentrate (1)", "Tomato Puree (8 ounces)", "Water (3 cups)", "Soy Sauce (6 tablespoons)", "White Wine Vinegar (1 tbs)", "Pepper (2 tbs)", "Bay Leaf (4)", "Lemon (1/2)", "Tomato Sauce (2 tbs)", "Butter (3 tbs)", "Olive Oil (1/2 cup)", "Onion (1 chopped)", "Garlic (4 cloves)"], "instructions": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.", "image_url": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53071"},
{"meal_name": "Beef and Oyster pie", "category": "Beef", "tags": "Pie", "ingredients": ["Beef (900g)", "Olive Oil (3 tbs)", "Shallots (3)", "Garlic (2 cloves minced)", "Bacon (125g)", "Thyme (1 tbs chopped)", "Bay Leaf (2)", "Stout (330ml)", "Beef Stock (400ml)", "Corn Flour (2 tbs)", "Oysters (8)", "Plain Flour (400g)", "Salt (pinch)", "Butter (250g)", "Eggs (To Glaze)"], "instructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.", "image_url": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52878"},
{"meal_name": "Beef and Mustard Pie", "category": "Beef", "tags": "Meat,Pie", "ingredients": ["Beef (1kg)", "Plain Flour (2 tbs)", "Rapeseed Oil (2 tbs)", "Red Wine (200ml)", "Beef Stock (400ml)", "Onion (1 finely sliced)", "Carrots (2 chopped)", "Thyme (3 sprigs)", "Mustard (2 tbs)", "Egg Yolks (2 free-range)", "Puff Pastry (400g)", "Green Beans (300g)", "Butter (25g)", "Salt (pinch)", "Pepper (pinch)"], "instructions": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.", "image_url": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=52874"},
{"meal_name": "Aussie Burgers", "category": "Beef", "tags": null, "ingredients": ["Lean Minced Steak (500g)", "Cooked Beetroot (100g)", "Naan Bread (2 small)", "Rocket (50g)", "Soured cream and chive dip (4 tablespoons)"], "instructions": "step 1\r\nMake the burgers: Tip the meat into a bowl and sprinkle over 1 tsp salt and a good grinding of black pepper.Work with wet hands to mix in the seasoning. Divide into four with your hands and shape into burgers. (It can be frozen at this stage.)\r\n\r\nstep 2\r\nSort out your ingredients: Slice the beetroot and split the naan breads.\r\n\r\nstep 3\r\nToast the naans: Heat a griddle pan or barbecue. Griddle the naans on both sides until lightly toasted and set aside. Add the burgers to the grill or barbecue and cook for 2-3 minutes, then turn and cook the other side for a further 2-3 minutes.\r\n\r\nstep 4\r\nAssemble the dish: Set half a toasted naan on each serving plate and put a pile of rocket on each. Top with a burger, then a few slices of beetroot and a dollop of soured cream. Sprinkle with salt and freshly ground black pepper and serve immediately with a big green salad and chips. A glass of red wine wouldn’t go amiss, either.", "image_url": "https://www.themealdb.com/images/media/meals/44bzep1761848278.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53099"},
{"meal_name": "Asado", "category": "Beef", "tags": null, "ingredients": ["Mixed Beef Cuts (2kg)", "Chorizo (4)", "Morcilla (2)", "Salt (To taste)"], "instructions": "Prepare the Fire: Start a wood fire in your grill and let it burn down to coals.\r\nSeason the Meat: Generously salt the beef cuts.\r\nGrill the Meat: Place the beef on the grill, starting with the thickest cuts farthest from the coals. Add chorizo and morcilla after the beef has been cooking for a while.\r\nCook to Perfection: Cook the meat, turning occasionally, until it reaches your desired doneness. Typically, ribs may take up to 2 hours; thinner cuts will cook faster.\r\nRest and Serve: Let the meat rest for about 10 minutes before slicing. Serve with chimichurri sauce and grilled vegetables.\r\nPro Tips:\r\n\r\nUse a mix of wood and charcoal for a consistent heat source. Wood adds flavor, while charcoal maintains temperature.\r\nSeason the meat just before grilling to ensure it retains its moisture and flavor.\r\nServing Suggestions:\r\n\r\nServe with a side of chimichurri sauce, a fresh tomato salad, and crusty bread. Pair with a robust Malbec wine to complement the rich flavors of the meat.", "image_url": "https://www.themealdb.com/images/media/meals/kgfh3q1763075438.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53133"},
{"meal_name": "Arepa pelua", "category": "Beef", "tags": null, "ingredients": ["Beef (500g)", "Onion (1)", "Red Pepper (1)", "Garlic (2 cloves)", "Cumin (1 tsp)", "Oregano (1 tsp)", "Paprika (1 tsp)", "Beef Stock (1 L)", "Water (2 1/2 cups)", "Salt (Pinch)", "Cheese (200g)", "Extra Virgin Olive Oil (Pinch)"], "instructions": "Cook the meat: Place the flank steak in a pot with broth or water and salt. Cook over low heat for about 2 hours, until tender and easy to shred.\r\nShred the meat: Once cooked, drain and shred the meat using two forks.\r\nPrepare the vegetables: Sauté chopped onion, bell pepper, and garlic in a little oil. Add cumin, oregano, paprika, and salt. Stir in the meat and cook for a few minutes until the flavors are well combined.\r\nMake the dough: In a bowl, mix the cornmeal with warm water and salt until a soft dough forms. Let it rest for 5 minutes.\r\nForm the arepas: Divide the dough into 6 portions, shape into balls, and flatten into thick discs.\r\nCook: Cook the arepas on a griddle or skillet over medium heat for 2–3 minutes on each side until golden. You can then bake them for a few minutes if you prefer them crispier.\r\nFill: Slice the arepas open on one side, fill with the hot shredded beef, and top with grated cheese.", "image_url": "https://www.themealdb.com/images/media/meals/jgl9qq1764437635.jpg", "source_url": "https://www.themealdb.com/api/json/v1/1/lookup.php?i=53329"}
]